[
    {
        "Artigo": "Artigo 1.º",
        "Ementa": "(Direito aplicável)",
        "Numero": [
            "O processo do contencioso administrativo rege-se pelo disposto no presente Código, nas leis sobre organização do sistema judiciário e, subsidiariamente e com as necessárias adaptações, na lei de processo civil."
        ],
        "Titulo": "CAPÍTULO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 2.º",
        "Ementa": "(Princípio da tutela jurisdicional efectiva)",
        "Numero": [
            "A todo o direito subjectivo público ou interesse legalmente protegido corresponde um ou mais meios processuais destinados à sua tutela jurisdicional efectiva, bem como os procedimentos preventivos e conservatórios necessários para acautelar o efeito útil de tais meios."
        ],
        "Titulo": "CAPÍTULO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 3.º",
        "Ementa": "(Conhecimento da competência)",
        "Numero": [
            "Com excepção do disposto na lei de processo civil quanto aos termos do processo comum de declaração, aplicável por força do n.º 1 do artigo 99.º, e no regime da arbitragem voluntária no domínio do contencioso administrativo, a competência para o julgamento de questões do contencioso administrativo é de ordem pública e o seu conhecimento precede o de outra matéria."
        ],
        "Titulo": "CAPÍTULO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 4.º",
        "Ementa": "(Patrocínio)",
        "Numero": [
            "1. É obrigatória para os particulares a constituição de advogado nos processos do contencioso administrativo, sem prejuízo do que se encontra legalmente previsto quanto à advocacia em causa própria, de cônjuge, ascendentes e descendentes ou por nomeação oficiosa.",
            "2. Os órgãos administrativos são obrigatoriamente patrocinados nos processos do contencioso administrativo, nos termos dos números seguintes.",
            "3. Nos meios processuais e procedimentos regulados nos capítulos II a IV, nas secções II a IV do capítulo V, nos capítulos VI e VII e nos conflitos de atribuições, bem como nos respectivos recursos jurisdicionais e em todas as execuções contra pessoas de direito público, o patrocínio é exercido por advogado constituído ou por licenciado em direito com funções de apoio jurídico, expressamente designado para o efeito.",
            "4. Nas restantes hipóteses, o patrocínio é exercido pelo Ministério Público."
        ],
        "Titulo": "CAPÍTULO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 5.º",
        "Ementa": "(Prazos)",
        "Numero": [
            "Com excepção dos relativos a actos da secretaria, são de 5 dias os prazos que não se encontrem expressamente fixados no presente Código."
        ],
        "Titulo": "CAPÍTULO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 6.º",
        "Ementa": "(Processos urgentes)",
        "Numero": [
            "1. Correm em férias e independentemente de vistos prévios, para além de outros por lei qualificados de urgentes, os processos relativos:",
            "a) Ao recurso contencioso de actos administrativos referentes à formação dos contratos de empreitada de obras públicas, de fornecimento contínuo e de prestação de serviços para fins de imediata utilidade pública;",
            "b) Ao contencioso eleitoral;",
            "c) À acção sobre prestação de informação, consulta de processo ou passagem de certidão;",
            "d) À suspensão de eficácia dos actos administrativos e das normas;",
            "e) À intimação para um comportamento;",
            "f) À produção antecipada de prova;",
            "g) Às providências preventivas e conservatórias não especificadas.",
            "2. Nos processos urgentes, excepto disposição especial em contrário, os prazos para vista ao Ministério Público e para decisão do tribunal são, respectivamente, de 5 e 7 dias.",
            "3. Os actos da secretaria nestes processos são praticados com a maior brevidade possível, com precedência sobre quaisquer outros."
        ],
        "Titulo": "CAPÍTULO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 7.º",
        "Ementa": "(Documentos e informações)",
        "Numero": [
            "1. No processo em que intervenham, os órgãos, funcionários e agentes da Administração e os particulares estão obrigados a facultar, em tempo oportuno, os documentos que lhes sejam solicitados e, em geral, a prestar, com brevidade, as informações pedidas.",
            "2. Sem prejuízo do que se encontre especialmente previsto, o tribunal aprecia livremente, para efeitos probatórios, o valor das condutas que infrinjam o disposto no número anterior."
        ],
        "Titulo": "CAPÍTULO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 8.º",
        "Ementa": "(Distribuição no Tribunal de Última Instância)",
        "Numero": [
            "7.ª Outros processos."
        ],
        "Titulo": "CAPÍTULO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 9.º",
        "Ementa": "(Distribuição no Tribunal de Segunda Instância)",
        "Numero": [
            "8.ª Outros processos."
        ],
        "Titulo": "CAPÍTULO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 10.º",
        "Ementa": "(Distribuição no Tribunal Administrativo)",
        "Numero": [
            "6.ª Outros processos."
        ],
        "Titulo": "CAPÍTULO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 11.º",
        "Ementa": "(Efeitos da apensação de processos na distribuição)",
        "Numero": [
            "1. Importa baixa na distribuição a apensação de processo a outro distribuído a juiz diferente.",
            "2. O processo apensado não conta para efeitos de distribuição de processos ao juiz que o venha a receber."
        ],
        "Titulo": "CAPÍTULO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 12.º",
        "Ementa": "(Erro na escolha do meio processual ou do procedimento)",
        "Numero": [
            "1. Quando haja erro na escolha do meio processual ou do procedimento adequados à satisfação do pedido formulado, transitado o despacho de rejeição liminar e sendo o tribunal competente para o conhecimento daquele pedido, é oficiosamente ordenada a baixa na distribuição efectuada e a sua repetição na espécie própria.",
            "2. Na hipótese prevista no número anterior, quando seja outro o tribunal competente para o conhecimento do adequado meio processual ou procedimento, aplica-se, com as necessárias adaptações, o regime previsto no artigo 49.º sempre que o exercício do correspondente direito se encontre sujeito a prazo de caducidade cujo termo ocorra em data anterior à nele prevista."
        ],
        "Titulo": "CAPÍTULO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 13.º",
        "Ementa": "(Citação dos órgãos administrativos)",
        "Numero": [
            "A citação dos órgãos administrativos é feita por carta registada com aviso de recepção."
        ],
        "Titulo": "CAPÍTULO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 14.º",
        "Ementa": "(Questão prejudicial)",
        "Numero": [
            "1. Quando o conhecimento do objecto do processo dependa de decisão de questão da competência de outro tribunal, pode o tribunal sobrestar na decisão até que o tribunal competente se pronuncie.",
            "2. A inércia dos interessados relativamente à instauração ou ao andamento de processo respeitante a questão prejudicial durante mais de 90 dias determina a cessação da suspensão do processo do contencioso administrativo, decidindo-se a questão com efeitos a ele restritos."
        ],
        "Titulo": "CAPÍTULO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 15.º",
        "Ementa": "(Competência do relator)",
        "Numero": [
            "1. Sem prejuízo do disposto nas leis sobre organização do sistema judiciário e das hipóteses em que se encontra especialmente previsto despacho seu ou acórdão do tribunal, compete ao relator:",
            "a) Rejeitar liminarmente os recursos contenciosos e os restantes meios processuais e procedimentos ou, em fase subsequente do processo, com fundamento em incumprimento de despachos de aperfeiçoamento da petição ou do requerimento;",
            "b) Relegar para final o conhecimento de excepções ou de outras questões que obstem ao conhecimento do recurso;",
            "c) Ordenar ou solicitar as diligências instrutórias julgadas necessárias;",
            "d) Declarar, quando seja imposta por lei, ou decidir a suspensão da instância;",
            "e) Ordenar, quando seja imposta por lei, ou decidir a apensação de processos;",
            "f) Julgar extinta a instância por deserção, desistência ou impossibilidade ou inutilidade superveniente da lide;",
            "g) Rejeitar liminarmente os requerimentos e incidentes de cujo objecto não deva tomar-se conhecimento;",
            "h) Julgar os incidentes;",
            "i) Conhecer de nulidades dos actos processuais e dos próprios despachos;",
            "j) Dar por findos os recursos contenciosos e os restantes meios processuais e procedimentos.",
            "2. Cabe reclamação para a conferência dos despachos do relator, com excepção dos de mero expediente e dos que admitam recursos de acórdãos do tribunal."
        ],
        "Titulo": "CAPÍTULO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 16.º",
        "Ementa": "(Intervenção de técnicos)",
        "Numero": [
            "Quando num processo se devam resolver questões que exijam conhecimentos especializados, pode o tribunal, oficiosamente ou a requerimento de qualquer das partes, determinar a intervenção de técnico por ele designado, que tem, para o efeito, vista no processo e é ouvido na respectiva discussão quando esta se efectue em conferência ou em tribunal colectivo."
        ],
        "Titulo": "CAPÍTULO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 17.º",
        "Ementa": "(Intervenção do Ministério Público nas conferências)",
        "Numero": [
            "Quando não intervenham no processo como demandantes ou demandados, mas apenas na defesa da legalidade, os representantes do Ministério Público nos Tribunais de Última e de Segunda Instâncias assistem às respectivas conferências e são ouvidos na discussão."
        ],
        "Titulo": "CAPÍTULO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 18.º",
        "Ementa": "(Inscrição em tabela)",
        "Numero": [
            "Nos Tribunais de Última e de Segunda Instâncias, o secretário judicial apresenta ao presidente, no final de cada sessão, o suporte documental ou informático destinado ao registo dos processos considerados prontos para julgamento para que, ouvidos os juízes, determine quais os que hão-de constituir a tabela da sessão seguinte."
        ],
        "Titulo": "CAPÍTULO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 19.º",
        "Ementa": "(Publicidade das decisões)",
        "Numero": [
            "1. Dos acórdãos dos Tribunais de Última e de Segunda Instâncias pode ser enviada cópia dactilografada à Imprensa Oficial de Macau para publicação em colectânea.",
            "2. As colectâneas são publicadas trimestralmente, inserindo, com os sumários elaborados pelos relatores, as decisões proferidas em cada trimestre e agrupando, separadamente, as relativas ao Tribunal de Última Instância e ao Tribunal de Segunda Instância."
        ],
        "Titulo": "CAPÍTULO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 20.º",
        "Ementa": "(Natureza e finalidade do recurso)",
        "Numero": [
            "Excepto disposição em contrário, o recurso contencioso é de mera legalidade e tem por finalidade a anulação dos actos recorridos ou a declaração da sua nulidade ou inexistência jurídica."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 21.º",
        "Ementa": "(Fundamentos do recurso)",
        "Numero": [
            "1. Constitui fundamento do recurso a ofensa, pelo acto recorrido, dos princípios ou normas jurídicas aplicáveis, designadamente:",
            "a) A usurpação de poder;",
            "b) A incompetência;",
            "c) O vício de forma, nele incluindo a falta de fundamentação ou equivalente;",
            "d) A violação de lei, nela incluindo o erro manifesto ou a total desrazoabilidade no exercício de poderes discricionários;",
            "e) O desvio de poder.",
            "2. São também fundamento do recurso outras causas relevantes de invalidade do acto recorrido, designadamente:",
            "a) A falta de elementos essenciais do acto;",
            "b) A falta e os vícios da vontade do autor do acto, quando relevantes."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 22.º",
        "Ementa": "(Efeitos do recurso)",
        "Numero": [
            "O recurso contencioso não tem efeito suspensivo da eficácia do acto recorrido, excepto quando, cumulativamente, esteja apenas em causa o pagamento de quantia certa, sem natureza de sanção disciplinar, e tenha sido prestada caução por qualquer das formas previstas na lei de processo tributário ou, na sua falta, pela forma prevista na lei de processo civil para prestação de caução no procedimento cautelar comum."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 23.º",
        "Ementa": "(Poderes processuais)",
        "Numero": [
            "A entidade recorrida e o recorrente têm idênticos poderes processuais."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 24.º",
        "Ementa": "(Cumulação de pedidos)",
        "Numero": [
            "1. Qualquer que seja o tribunal competente, pode cumular-se no recurso contencioso:",
            "a) O pedido de determinação da prática de acto administrativo legalmente devido quando, em vez do acto anulado ou declarado nulo ou juridicamente inexistente, devesse ter sido praticado um outro acto administrativo de conteúdo vinculado;",
            "b) O pedido de indemnização de perdas e danos que, pela sua natureza, devam subsistir mesmo em caso de reposição da situação actual hipotética obtida através do provimento do recurso.",
            "2. Nas hipóteses previstas no número anterior, aplicam-se à dedução dos pedidos de determinação da prática de acto administrativo legalmente devido e de indemnização de perdas e danos, bem como à sua discussão e decisão, as normas que regulam as correspondentes acções quando se não revelem incompatíveis com as aplicáveis à tramitação do recurso contencioso."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 25.º",
        "Ementa": "(Prazos)",
        "Numero": [
            "1. O direito de recurso de actos nulos ou juridicamente inexistentes não caduca, podendo ser exercido a todo o tempo.",
            "2. O direito de recurso de actos anuláveis caduca nos seguintes prazos:",
            "a) 30 dias, quando o recorrente resida em Macau;",
            "b) 60 dias, quando o recorrente resida no exterior de Macau;",
            "c) 365 dias, quando o recorrente seja o Ministério Público ou se esteja perante um indeferimento tácito.",
            "3. À contagem dos prazos previstos no número anterior é aplicável o disposto no Código do Procedimento Administrativo."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO II Prazos de recursos"
    },
    {
        "Artigo": "Artigo 26.º",
        "Ementa": "(Início da contagem dos prazos do recurso)",
        "Numero": [
            "1. A contagem do prazo para interposição do recurso não se inicia enquanto o acto não comece a produzir efeitos e sempre que a publicação ou a notificação, quando obrigatórias, não dêem a conhecer o sentido, o autor e a data da decisão.",
            "2. A contagem do prazo para interposição do recurso de acto expresso inicia-se:",
            "a) Quando apenas a publicação ou apenas a notificação seja obrigatória, a partir da sua efectivação;",
            "b) Quando a publicação e a notificação sejam ambas obrigatórias, a partir da que ocorra posteriormente.",
            "3. A contagem do prazo para interposição do recurso de acto expresso cuja publicação não seja obrigatória e cuja notificação não seja igualmente obrigatória ou se encontre legalmente dispensada, inicia-se a partir:",
            "a) Da prática do acto quando se trate de acto oral praticado na presença do interessado;",
            "b) Do conhecimento efectivo do acto, ou do seu conhecimento presumido nos termos do n.º 2 do artigo 121.º do Código do Procedimento Administrativo, nas restantes hipóteses.",
            "4. A contagem do prazo para interposição do recurso de indeferimento tácito inicia-se no termo do prazo previsto nos n.os 2 e 3 do artigo 102.º e no artigo 162.º do Código do Procedimento Administrativo.",
            "5. Quando o acto não seja de publicação obrigatória, a contagem do prazo para interposição do recurso pelo Ministério Público inicia-se a partir da primeira notificação que venha a ter lugar.",
            "6. O disposto nos n.os 1, 2 e 3 não impede a interposição do recurso quando tenha sido iniciada a execução do acto.",
            "7. A rectificação dos actos administrativos ou da sua publicação ou notificação não determina o início da contagem de novo prazo para interposição do recurso, excepto quando incida em aspectos relevantes para a recorribilidade desses actos."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO II Prazos de recursos"
    },
    {
        "Artigo": "Artigo 27.º",
        "Ementa": "(Suspensão da contagem dos prazos do recurso)",
        "Numero": [
            "1. A contagem do prazo para interposição do recurso suspende-se nos períodos em que, por decisão administrativa, o acto se torne ineficaz.",
            "2. Quando a notificação omita as indicações previstas no artigo 70.º do Código do Procedimento Administrativo ou a publicação não contenha os elementos enunciados no artigo 113.º e no n.º 4 do artigo 120.º do mesmo Código, pode o interessado requerer no prazo de dez dias à entidade que praticou o acto a notificação das indicações ou dos elementos em falta ou a passagem de certidão ou fotocópia autenticada que os contenha, ficando nesta hipótese suspenso, a partir da data da apresentação do requerimento e até à daquela notificação ou passagem, o prazo para interposição do recurso cuja contagem se tenha iniciado."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO II Prazos de recursos"
    },
    {
        "Artigo": "Artigo 28.º",
        "Ementa": "(Precedência de impugnação administrativa necessária)",
        "Numero": [
            "1. São actos administrativos contenciosamente recorríveis os que, produzindo efeitos externos, não se encontram sujeitos a impugnação administrativa necessária.",
            "2. A sujeição a impugnação administrativa necessária não obsta, porém, à recorribilidade contenciosa dos actos quando estes sejam, por força da lei ou de decisão administrativa, de execução imediata.",
            "3. A recorribilidade de actos anuláveis, quando precedida de impugnação administrativa necessária, depende da observância, quanto a esta, do disposto no artigo 149.º, no n.º 1 do artigo 155.º e no artigo 156.º do Código do Procedimento Administrativo.",
            "4. A inobservância das disposições referidas no número anterior impede igualmente o interessado de presumir tacitamente indeferida a impugnação administrativa interposta."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO III Recorribilidade do acto"
    },
    {
        "Artigo": "Artigo 29.º",
        "Ementa": "(Acto administrativo sob forma legislativa ou regulamentar)",
        "Numero": [
            "1. A recorribilidade dos actos administrativos não depende da sua forma.",
            "2. A não interposição de recurso de acto administrativo contido em diploma legislativo ou em regulamento administrativo não impede a recorribilidade dos respectivos actos de execução ou aplicação."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO III Recorribilidade do acto"
    },
    {
        "Artigo": "Artigo 30.º",
        "Ementa": "(Actos de execução ou aplicação)",
        "Numero": [
            "1. Sem prejuízo do disposto no número seguinte, os actos de mera execução ou aplicação de actos administrativos não são recorríveis.",
            "2. São recorríveis os actos previstos no n.º 2 do artigo anterior e nos n.os 3 e 4 do artigo 138.º do Código do Procedimento Administrativo, bem como aqueles que não tenham sido legitimados por acto administrativo prévio nos termos do n.º 1 do artigo 138.º do Código do Procedimento Administrativo."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO III Recorribilidade do acto"
    },
    {
        "Artigo": "Artigo 31.º",
        "Ementa": "(Recurso de acto meramente confirmativo)",
        "Numero": [
            "1. O recurso é rejeitado com fundamento na natureza meramente confirmativa do acto recorrido quando o acto confirmado tenha sido objecto de notificação ao recorrente, de publicação imposta por lei ou de impugnação administrativa ou contenciosa interposta por aquele.",
            "2. O acto que decida impugnação administrativa necessária não tem, para os efeitos do disposto no presente Código, natureza meramente confirmativa."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO III Recorribilidade do acto"
    },
    {
        "Artigo": "Artigo 32.º",
        "Ementa": "(Recorribilidade do indeferimento tácito)",
        "Numero": [
            "1. A recorribilidade do indeferimento tácito cessa quando o acto expresso seja publicado ou notificado ao interessado.",
            "2. Cessa, ainda, a mesma recorribilidade quando o interessado opte pela propositura de acção para determinação da prática de um acto administrativo legalmente devido nos termos previstos no n.º 2 do artigo 103.º"
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO III Recorribilidade do acto"
    },
    {
        "Artigo": "Artigo 33.º",
        "Ementa": "(Legitimidade activa)",
        "Numero": [
            "a) As pessoas singulares ou colectivas que se considerem titulares de direitos subjectivos ou interesses legalmente protegidos que tivessem sido lesados pelo acto recorrido ou que aleguem interesse directo, pessoal e legítimo no provimento do recurso;",
            "b) Os titulares do direito de acção popular;",
            "c) O Ministério Público;",
            "d) As pessoas colectivas, ainda em relação aos actos lesivos dos direitos ou interesses que a elas cumpra defender;",
            "e) Os municípios, também em relação aos actos que afectem o âmbito da sua autonomia."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO IV Legitimidade"
    },
    {
        "Artigo": "Artigo 34.º",
        "Ementa": "(Aceitação do acto)",
        "Numero": [
            "1. Não pode recorrer quem, sem reserva, total ou parcial, tenha aceitado, expressa ou tacitamente, o acto, depois de praticado.",
            "2. A aceitação tácita é a que deriva da prática espontânea de facto incompatível com a vontade de recorrer.",
            "3. A reserva é produzida por escrito perante o autor do acto.",
            "4. A execução ou acatamento por funcionário ou agente de acto de que seja destinatário não se considera aceitação tácita do acto executado ou acatado, excepto quando dependa da sua vontade a escolha da oportunidade da execução."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO IV Legitimidade"
    },
    {
        "Artigo": "Artigo 35.º",
        "Ementa": "(Coligação)",
        "Numero": [
            "Podem coligar-se vários recorrentes quando recorram do mesmo acto ou, com os mesmos fundamentos de facto e de direito, de actos contidos, formalmente, num despacho ou outra forma de decisão únicos."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO IV Legitimidade"
    },
    {
        "Artigo": "Artigo 36.º",
        "Ementa": "(Acção popular)",
        "Numero": [
            "1. São titulares do direito de acção popular, para efeitos de interposição de recurso contencioso de actos que lesem bens fundamentais como a saúde pública, a habitação, a educação, o património cultural, o ambiente, o ordenamento do território, a qualidade de vida e, em geral, qualquer bem do domínio público, os residentes de Macau, as pessoas colectivas às quais cumpra defender tais bens e os municípios.",
            "2. Os residentes de Macau são ainda titulares do direito de acção popular para efeitos de interposição de recurso contencioso de actos que lesem outros interesses públicos praticados pelos órgãos dos municípios e seus serviços públicos dotados de personalidade jurídica e autonomia administrativa."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO IV Legitimidade"
    },
    {
        "Artigo": "Artigo 37.º",
        "Ementa": "(Legitimidade passiva)",
        "Numero": [
            "Considera-se como entidade recorrida o órgão que tenha praticado o acto, ou que, por alteração legislativa ou regulamentar, lhe tenha sucedido na respectiva competência."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO IV Legitimidade"
    },
    {
        "Artigo": "Artigo 38.º",
        "Ementa": "(Delegação de poderes)",
        "Numero": [
            "O deferimento ou indeferimento tácito de requerimento dirigido a delegante ou subdelegante é imputado, para efeitos de legitimidade passiva no recurso contencioso, ao delegado ou subdelegado, ainda que a estes não tenha sido remetido o requerimento."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO IV Legitimidade"
    },
    {
        "Artigo": "Artigo 39.º",
        "Ementa": "(Contra-interessados)",
        "Numero": [
            "Têm legitimidade para intervir no processo como contra-interessados, as pessoas a quem o provimento do recurso possa directamente prejudicar."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO IV Legitimidade"
    },
    {
        "Artigo": "Artigo 40.º",
        "Ementa": "(Assistentes)",
        "Numero": [
            "1. Podem intervir no recurso como assistentes as pessoas, singulares ou colectivas, que demonstrem possuir um interesse idêntico ao do recorrente, ao da entidade recorrida ou ao dos contra-interessados, ou com ele conexo.",
            "2. O assistente pode intervir até à fase de alegações, deve aceitar o processo no estado em que se encontre e a sua posição subordina-se à do assistido, não modificando os direitos deste para livremente confessar ou desistir com as legais consequências."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO IV Legitimidade"
    },
    {
        "Artigo": "Artigo 41.º",
        "Ementa": "(Apresentação da petição)",
        "Numero": [
            "1. O recurso contencioso é interposto pela apresentação da respectiva petição na secretaria do tribunal a que é dirigida.",
            "2. A petição pode ainda ser enviada, sob registo do correio, à secretaria do tribunal a que é dirigida, considerando-se apresentada na data daquele registo."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 42.º",
        "Ementa": "(Requisitos da petição)",
        "Numero": [
            "1. Na petição de recurso, elaborada por forma articulada, deve o recorrente:",
            "a) Designar o tribunal a que o recurso é dirigido;",
            "b) Indicar a sua identidade e residência ou sede, bem como as dos contra-interessados, requerendo a sua citação;",
            "c) Identificar o acto recorrido e o seu autor, mencionando, quando o haja, o uso de delegação ou subdelegação de poderes;",
            "d) Expor com clareza os factos e as razões de direito que fundamentam o recurso;",
            "e) Apresentar, de forma clara e sintética, conclusões, indicando precisamente as normas ou princípios que considere infringidos;",
            "f) Formular o pedido ou os pedidos;",
            "g) Indicar os factos cuja prova pretende fazer;",
            "h) Requerer os meios de prova que entenda necessários, reportando-os especificadamente aos factos indicados;",
            "i) Identificar os documentos que, obrigatória ou facultativamente, acompanham a petição;",
            "j) Indicar o escritório do signatário da petição para efeitos de notificações, quando não se trate do Ministério Público.",
            "2. A petição não é recebida quando não designe o tribunal a que o recurso é dirigido.",
            "3. O recorrente pode estabelecer entre os fundamentos do recurso que determinem a anulação do acto recorrido uma relação de subsidiariedade."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 43.º",
        "Ementa": "(Instrução da petição)",
        "Numero": [
            "1. Para além do que seja exigido por lei especial, são obrigatoriamente juntos à petição:",
            "a) Documento comprovativo do acto recorrido;",
            "b) Todos os documentos destinados a demonstrar a verdade dos factos alegados, com excepção dos que constem do processo administrativo instrutor;",
            "c) Rol de testemunhas, quando seja requerida prova testemunhal, com indicação dos factos sobre que cada testemunha deve depor;",
            "d) Procuração forense ou equivalente;",
            "e) Duplicados legais.",
            "2. Quando o recurso tenha por objecto um indeferimento tácito, deve juntar-se à petição duplicado ou fotocópia do requerimento sem decisão, no qual tenha sido passado recibo pelo órgão administrativo onde foi apresentado o original ou, na sua falta, qualquer documento comprovativo da entrega do requerimento.",
            "3. Quando o recurso tenha por objecto um acto oral, a sua prova deve resultar dos factos alegados ou de documentos juntos de onde se possa inferir que tal acto foi efectivamente praticado.",
            "4. Quando o recurso tenha por objecto um acto juridicamente inexistente, deve o recorrente juntar, quando os haja, documentos comprovativos da aparência desse acto e dos seus efeitos lesivos.",
            "5. Quando a interposição do recurso tenha sido antecedida de pedido de notificação ou passagem de certidão ou fotocópia autenticada nos termos previstos no n.º 2 do artigo 27.º, seguido ou não de acção sobre prestação de informação, consulta de processo ou passagem de certidão, deve a petição ser instruída com os respectivos documentos comprovativos.",
            "6. Quando o recorrente, por motivos justificados, não tenha podido obter alguns dos documentos com que a petição haja de ser instruída, deve especificar em que consistem tais documentos e solicitar a fixação de um prazo razoável para a sua junção."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 44.º",
        "Ementa": "(Cumulação de impugnações)",
        "Numero": [
            "1. O recorrente pode cumular a impugnação de actos que estejam, entre si, numa relação de dependência ou conexão.",
            "2. Não é admissível cumulação:",
            "a) Quando seja apresentada em termos de subsidiariedade ou de alternatividade;",
            "b) Quando a competência para o conhecimento das impugnações caiba a tribunais diferentes."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 45.º",
        "Ementa": "(Despacho liminar)",
        "Numero": [
            "Autuada a petição e feito o preparo ou decorrido o respectivo prazo, quando aquele seja devido, o processo é concluso ao juiz ou ao relator para que seja lavrado despacho liminar."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 46.º",
        "Ementa": "(Rejeição liminar)",
        "Numero": [
            "1. O recurso é liminarmente rejeitado quando a petição seja inepta.",
            "2. O recurso é, ainda, liminarmente rejeitado quando seja manifesta a verificação de circunstâncias que obstem ao seu prosseguimento, designadamente:",
            "a) A falta de personalidade ou capacidade judiciária do recorrente;",
            "b) A falta de objecto do recurso;",
            "c) A irrecorribilidade do acto recorrido;",
            "d) A ilegitimidade do recorrente;",
            "e) A ilegalidade da coligação dos recorrentes;",
            "f) O erro na identificação do autor do acto recorrido ou a falta de identificação dos contra-interessados, quando o erro ou a falta sejam manifestamente indesculpáveis;",
            "g) A ilegalidade da cumulação de impugnações;",
            "h) A caducidade do direito de recurso."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 47.º",
        "Ementa": "(Rejeição por ineptidão da petição e por erro ou falta de identificação)",
        "Numero": [
            "1. Quando haja lugar a rejeição liminar por ineptidão da petição ou por verificação da circunstância prevista na alínea f) do n.º 2 do artigo anterior, pode o recorrente apresentar nova petição de recurso, no prazo de 5 dias contado da notificação do despacho de rejeição ou, quando tenha recorrido deste despacho sem ganho de causa, da notificação que lhe seja feita da entrega do processo no tribunal recorrido.",
            "2. Em qualquer hipótese, o novo recurso considera-se interposto na data em que a primeira petição foi apresentada."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 48.º",
        "Ementa": "(Rejeição por invocação indevida de delegação)",
        "Numero": [
            "Quando haja lugar a rejeição de recurso interposto de acto praticado com invocação de delegação ou subdelegação de poderes, com fundamento na inexistência, invalidade ou ineficácia destas ou por não compreenderem a prática do acto, pode o recorrente usar o meio administrativo necessário à recorribilidade contenciosa do acto no prazo de 30 dias contado do trânsito em julgado do despacho de rejeição."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 49.º",
        "Ementa": "(Rejeição por ilegal coligação dos recorrentes)",
        "Numero": [
            "Rejeitado o recurso por ilegal coligação dos recorrentes, podem estes interpor novo ou novos recursos, no prazo de 30 dias contados do trânsito em julgado do despacho, considerando-se as respectivas petições apresentadas na data da entrega da primeira."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 50.º",
        "Ementa": "(Rejeição por ilegal cumulação de impugnações)",
        "Numero": [
            "1. A ilegalidade da cumulação de impugnações que resulte apenas da infracção ao disposto na alínea b) do n.º 2 do artigo 44.º, não obsta ao prosseguimento do recurso relativamente à impugnação para cujo conhecimento o tribunal seja competente.",
            "2. Em qualquer hipótese, rejeitado o recurso ou prosseguindo nos termos do número anterior, pode o recorrente usar da faculdade prevista no artigo anterior."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 51.º",
        "Ementa": "(Despacho de aperfeiçoamento)",
        "Numero": [
            "1. Quando a petição ou a sua instrução enfermem de deficiências ou irregularidades formais, o recorrente é notificado para as suprir ou corrigir em prazo fixado pelo juiz ou relator.",
            "2. Quando o recorrente supra ou corrija as deficiências ou irregularidades, o recurso considera-se interposto na data da entrega da primeira petição.",
            "3. Quando, tendo sido convidado a suprir a omissão, o recorrente que tenha requerido prova testemunhal não apresente o rol de testemunhas ou não indique os factos sobre que devem depor, fica impedido de fazer tal prova.",
            "4. Com excepção do disposto no número anterior, a falta de suprimento ou correcção das deficiências ou irregularidades apontadas em despacho não reclamado para a conferência, ou por esta confirmado, implica a rejeição do recurso."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 52.º",
        "Ementa": "(Citação da entidade recorrida)",
        "Numero": [
            "1. Não sendo rejeitado o recurso, é citada a entidade recorrida para contestar no prazo de 20 dias.",
            "2. A citação deve conter informação sobre as prescrições previstas nos artigos 53.º a 55.º"
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 53.º",
        "Ementa": "(Contestação da entidade recorrida)",
        "Numero": [
            "1. Na contestação, deve a entidade recorrida deduzir, por forma articulada, toda a matéria relativa à defesa, indicar os factos cuja prova pretende fazer, juntar todos os documentos destinados a demonstrar a verdade dos factos alegados e, quando seja caso disso, apresentar rol de testemunhas ou requerer outros meios de prova.",
            "2. À falta de apresentação do rol de testemunhas ou de indicação dos factos sobre que elas devem depor é aplicável o disposto no n.º 3 do artigo 51.º",
            "3. Quando a contestação seja subscrita por licenciado em Direito com funções de apoio jurídico, deve ser junta cópia do despacho da entidade recorrida que o designa."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 54.º",
        "Ementa": "(Falta de contestação ou de impugnação)",
        "Numero": [
            "A falta de contestação ou de impugnação implica a confissão dos factos alegados pelo recorrente, excepto quando estejam em manifesta oposição com a defesa considerada no seu conjunto, não seja admissível confissão sobre eles ou resultem contraditados pelos documentos que constituem o processo administrativo instrutor."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 55.º",
        "Ementa": "(Remessa do processo administrativo)",
        "Numero": [
            "1. Com a contestação, ou dentro do respectivo prazo, a entidade recorrida é obrigada a remeter ao tribunal o original do processo administrativo e todos os demais documentos relativos à matéria do recurso para ficarem apensos aos autos como processo instrutor.",
            "2. Quando o processo administrativo se encontre já apenso a outros autos, a entidade recorrida deve dar conhecimento do facto ao tribunal.",
            "3. O original do processo administrativo apenas pode ser substituído por fotocópias autenticadas e devidamente ordenadas mediante justificação fundamentada da entidade recorrida com base em prejuízo considerável para o interesse público.",
            "4. Quando, sem justificação, o processo não seja remetido ou venha a ser substituído por fotocópias, o tribunal intima a entidade recorrida a remeter o seu original.",
            "5. O incumprimento da intimação, sem qualquer justificação ou com justificação julgada inaceitável, constitui crime de desobediência, faz incorrer a entidade recorrida na responsabilidade civil e disciplinar a que haja lugar, constitui o tribunal na faculdade de aplicar, com as necessárias adaptações, a medida compulsória prevista para obter a execução de decisões jurisdicionais e não obsta ao prosseguimento do recurso.",
            "6. A decisão sobre a justificação apresentada é precedida de parecer do Ministério Público.",
            "7. Na hipótese prevista no n.º 5, inverte-se o ónus da prova que recaísse sobre o recorrente relativamente aos factos cuja prova, sem o processo administrativo, se torna impossível ou de considerável dificuldade.",
            "8. A inversão do ónus da prova não prejudica o exercício dos poderes inquisitórios do juiz ou do relator na instrução do recurso.",
            "9. Para efeitos do disposto no presente artigo, o processo administrativo e todos os demais documentos relativos à matéria do recurso contencioso podem ser enviados, nos termos da lei, através da plataforma electrónica específica dos tribunais.*"
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 56.º",
        "Ementa": "(Citação dos contra-interessados)",
        "Numero": [
            "Junta a contestação da entidade recorrida, ou findo o respectivo prazo, e apensado o processo administrativo instrutor, ou expirado o prazo fixado na intimação prevista no artigo anterior, os contra-interessados são citados para contestar no prazo de 20 dias."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 58.º",
        "Ementa": "(Vista inicial do Ministério Público)",
        "Numero": [
            "1. Decorridos os trâmites previstos no artigo 55.º ou, havendo contra-interessados, juntas as contestações ou findo o respectivo prazo, os autos são continuados com vista, por 8 dias, ao Ministério Público, excepto no recurso por ele interposto.",
            "2. Na sua vista, o Ministério Público pode suscitar, ainda, o aperfeiçoamento da petição e, em geral, todas as questões que afectem o prosseguimento do recurso, bem como emitir parecer sobre as que sejam suscitadas nas contestações."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 59.º",
        "Ementa": "(Questões relativas a deficiências ou irregularidades da petição)",
        "Numero": [
            "1. Concluso o processo, o juiz ou o relator, oficiosamente ou sobre alegação da entidade recorrida, dos contra-interessados ou do Ministério Público, podem ainda ordenar a notificação do recorrente para, em prazo que fixem, suprir ou corrigir deficiências ou irregularidades da petição, observando-se, com as necessárias adaptações, o disposto no artigo 51.º",
            "2. Consideram-se sanados, na hipótese de não terem fundamentado a rejeição liminar do recurso, o erro na identificação do autor do acto recorrido ou a falta de identificação dos contra-interessados quando o verdadeiro autor do acto tenha apresentado contestação ou tenha remetido o processo administrativo instrutor, ou os contra-interessados tenham, entretanto, requerido a sua intervenção no recurso."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 60.º",
        "Ementa": "(Aproveitamento do processado)",
        "Numero": [
            "Quando não sejam lesados os poderes processuais das partes nem comprometida a justa decisão da causa, o juiz ou o relator podem dispensar a repetição de diligências que viessem a ser determinadas pelo suprimento ou correcção das deficiências ou irregularidades da petição."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 61.º",
        "Ementa": "(Questões que obstem ao conhecimento do recurso)",
        "Numero": [
            "1. Em prazo fixado pelo juiz ou relator, o recorrente é ouvido sobre outras questões, suscitadas oficiosamente ou sobre alegação das entidades previstas no n.º 1 do artigo 59.º, que obstem ao conhecimento do recurso.",
            "2. Quando as questões previstas no número anterior não tenham sido por ele suscitadas, o Ministério Público tem vista nos autos para emitir parecer."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 62.º",
        "Ementa": "(Tramitação subsequente)",
        "Numero": [
            "1. Ordenadas e efectuadas as diligências necessárias para a resolução das questões suscitadas que obstem ao conhecimento do recurso, o juiz profere decisão no prazo de 10 dias.",
            "2. Nos Tribunais de Última e de Segunda Instâncias, o relator ordena que os autos sejam continuados com vista aos juízes-adjuntos, observando-se, com as necessárias adaptações, o disposto nos artigos 72.º e seguintes.",
            "3. Nas hipóteses previstas nos números anteriores, a decisão pode ser relegada para final.",
            "4. A decisão de improcedência das referidas questões não impede que o recurso seja rejeitado a final pela mesma causa anteriormente desatendida, sempre que o processo forneça novos elementos de apreciação."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 63.º",
        "Ementa": "(Conhecimento do pedido)",
        "Numero": [
            "1. Quando, resolvidas as questões que obstem ao conhecimento do recurso e devendo este prosseguir, se afigure possível ao juiz ou ao relator conhecer do mérito do recurso sem necessidade de produção de prova, no despacho que o declare é ordenada a notificação do recorrente, da entidade recorrida e dos contra-interessados para, querendo, apresentar alegações.",
            "2. Às alegações e tramitação subsequente é aplicável, com as necessárias adaptações, o disposto nos artigos 68.º e seguintes."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 64.º",
        "Ementa": "(Alteração do requerimento de prova)",
        "Numero": [
            "Não se verificando a hipótese prevista no artigo anterior, é ordenada a notificação do recorrente, da entidade recorrida e dos contra-interessados para, no prazo de 5 dias, usarem da faculdade de alterar o requerimento de prova sempre que a alteração seja justificada pelo conhecimento superveniente de factos ou documentos relevantes."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 65.º",
        "Ementa": "(Produção de prova)",
        "Numero": [
            "1. Requerida a alteração de prova, ou findo o respectivo prazo, procede-se à produção de prova.",
            "2. É de 30 dias, prorrogável por mais 15, o prazo para a recolha da prova.",
            "3. O juiz ou o relator devem limitar a produção de prova aos factos que considerem relevantes para a decisão da causa e sejam susceptíveis de prova pelos meios requeridos."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 66.º",
        "Ementa": "(Prova testemunhal e por depoimento de parte)",
        "Numero": [
            "1. É aplicável aos limites do número de testemunhas o regime previsto para o processo civil comum de declaração, na forma sumária.",
            "2. As testemunhas são inquiridas pelo juiz ou relator sendo aplicável aos depoimentos, com as necessárias adaptações, o disposto nos artigos 447.º e 449.º do Código de Processo Civil.",
            "3. Não é admissível prova por depoimento de parte."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 67.º",
        "Ementa": "(Princípio do inquisitório)",
        "Numero": [
            "O juiz ou o relator podem, oficiosamente ou a requerimento do Ministério Público, ordenar as diligências de prova que entendam necessárias para a justa decisão da causa."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 68.º",
        "Ementa": "(Alegações facultativas)",
        "Numero": [
            "1. Finda a produção de prova, são notificados o recorrente, a entidade recorrida e os contra-interessados para alegações facultativas.",
            "2. O prazo para alegações é de 20 dias contado, para o recorrente, da notificação e, para a entidade recorrida e os contra-interessados, do termo do prazo do recorrente e da entidade recorrida, respectivamente, e corre simultaneamente para todos os contra-interessados.",
            "3. Nas alegações, o recorrente pode alegar novos fundamentos do seu pedido, cujo conhecimento tenha sido superveniente, ou restringi-los expressamente.",
            "4. É obrigatória a formulação de conclusões, as quais, na hipótese prevista no número anterior, devem englobar as da petição que o recorrente pretenda manter, sendo aplicável o disposto no n.º 4 do artigo 598.º e na alínea b) do n.º 1 e no n.º 4 do artigo 619.º do Código de Processo Civil.",
            "5. A entidade recorrida e os contra-interessados podem suscitar, nas alegações, novas questões que obstem ao conhecimento do recurso."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 69.º",
        "Ementa": "(Vista final do Ministério Público)",
        "Numero": [
            "1. Produzidas alegações, ou findo o respectivo prazo, os autos são continuados com vista, por 15 dias, ao Ministério Público, excepto no recurso por ele interposto.",
            "2. Na sua vista, pode o Ministério Público:",
            "a) Deduzir excepções ou suscitar novas questões que obstem ao conhecimento do recurso;",
            "b) Pronunciar-se sobre questões que não tenha suscitado;",
            "c) Arguir fundamentos não invocados pelo recorrente, no âmbito definido pelos factos trazidos ao processo e independentemente da caducidade do direito de arguição;",
            "d) Emitir parecer sobre a decisão final a proferir."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 70.º",
        "Ementa": "(Garantia do contraditório)",
        "Numero": [
            "1. Quando a entidade recorrida, os contra-interessados ou o Ministério Público suscitem, nas alegações ou na vista final, respectivamente, novas questões que obstem ao conhecimento do recurso, o recorrente é notificado para, no prazo de 10 dias, se pronunciar.",
            "2. Na hipótese prevista na alínea c) do n.º 2 do artigo anterior, a entidade recorrida e os contra-interessados são notificados para, no prazo de 10 dias, se pronunciarem."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 71.º",
        "Ementa": "(Conclusão ao juiz ou ao relator)",
        "Numero": [
            "1. Concluso o processo ao juiz ou ao relator, podem estes ainda suscitar questões que obstem ao conhecimento do recurso ou proceder às diligências que considerem necessárias.",
            "2. Na hipótese prevista na primeira parte do número anterior são ouvidos, sucessivamente, o Ministério Público e o recorrente."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 72.º",
        "Ementa": "(Vistos dos juízes-adjuntos)",
        "Numero": [
            "1. Quando não se verifique nenhuma das hipóteses previstas nos artigos 70.º e 71.º, ou logo que concluídos os respectivos trâmites, o relator manda o processo a vistos dos juízes-adjuntos.",
            "2. O prazo para visto de cada um dos juízes-adjuntos é de 15 dias.",
            "3. Considerando a simplicidade da causa, o relator pode dispensar os vistos ou reduzir o seu prazo até 5 dias.",
            "4. Nos seus vistos, os juízes-adjuntos podem reputar necessária alguma diligência, a qual é ordenada pelo relator quando o processo lhe volte concluso.",
            "5. Quando o relator considere dispensável a diligência, a questão é resolvida em conferência, na sessão imediata."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 73.º",
        "Ementa": "(Processo pronto para julgamento)",
        "Numero": [
            "1. No Tribunal Administrativo, o juiz profere sentença no prazo de 15 dias.",
            "2. Nos Tribunais de Última e de Segunda Instâncias, o relator deve considerar o processo pronto para julgamento:",
            "a) No prazo de 8 dias, quando os vistos dos juízes-adjuntos tenham sido dispensados ou o seu prazo reduzido;",
            "b) No prazo de 15 dias, na hipótese contrária."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 74.º",
        "Ementa": "(Ordem do conhecimento das questões)",
        "Numero": [
            "1. Na sentença ou acórdão, o tribunal começa por resolver as questões que obstem ao conhecimento do recurso e que tenham sido suscitadas nas alegações, na vista final do Ministério Público ou pelo juiz ou relator, ou cuja decisão tenha sido relegada para final.",
            "2. Quando nada obste ao julgamento do recurso, o tribunal conhece prioritariamente dos fundamentos que conduzam à declaração de nulidade ou de inexistência jurídica do acto recorrido e, depois, dos que determinem a sua anulação.",
            "3. Nos referidos grupos, a apreciação dos fundamentos é feita pela ordem seguinte:",
            "a) No primeiro grupo, a dos fundamentos cuja procedência determine, segundo a prudente convicção do tribunal, mais estável ou mais eficaz tutela dos direitos ou interesses lesados;",
            "b) No segundo grupo, a ordem indicada pelo recorrente, quando estabeleça entre os fundamentos apresentados uma relação de subsidiariedade, ou, na sua falta, a que resulte da regra prevista na alínea anterior.",
            "4. Quando o Ministério Público invoque novos fundamentos de anulação do acto, é observada, na ordem de apreciação dos fundamentos alegados, a regra prevista na alínea a) do número anterior.",
            "5. A procedência de um dos fundamentos não prejudica a apreciação de outros, na ordem prevista, quando o tribunal, face à eventualidade de renovação do acto recorrido, o entenda necessário para melhor tutela dos direitos ou interesses do recorrente.",
            "6. A errada qualificação pelo recorrente dos fundamentos do recurso não impede o seu provimento com base na qualificação que o tribunal considere adequada."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 75.º",
        "Ementa": "(Diferimento do acórdão)",
        "Numero": [
            "1. Não podendo ser lavrado acórdão na sessão em que seja julgado o recurso, o resultado do que se tenha vencido é anotado no suporte documental ou informático adequado e datado e assinado pelos juízes vencedores e vencidos.",
            "2. O juiz que tenha tirado o acórdão fica com o processo para o lavrar, o qual, sem prejuízo do resultado ser logo publicado no tribunal, é lido em conferência na sessão seguinte e aí datado e assinado pelos juízes que nele tenham intervindo, quando estejam presentes.",
            "3. Não estando presente na conferência algum dos juízes que tenham intervindo no acórdão, o relator deixa expresso o respectivo voto mediante declaração por si assinada."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 76.º",
        "Ementa": "(Conteúdo da sentença e acórdão)",
        "Numero": [
            "A sentença e o acórdão devem mencionar o recorrente, a entidade recorrida e os contra-interessados, resumir com clareza e precisão os fundamentos e conclusões úteis da petição e das contestações, ou das alegações, especificar os factos provados e concluir pela decisão final, devidamente fundamentada."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 77.º",
        "Ementa": "(Efeito da sentença e acórdão)",
        "Numero": [
            "A sentença e o acórdão que anulem actos administrativos aproveitam a todos os titulares de direitos subjectivos ou interesses legalmente protegidos que tenham sido lesados pelo acto anulado mesmo quando dele não tenham recorrido."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 78.º",
        "Ementa": "(Publicidade da sentença e acórdão de provimento)",
        "Numero": [
            "1. A sentença e o acórdão transitados em julgado, que concedam provimento a recurso de acto que tenha sido objecto de publicidade, são publicitados, por ordem do tribunal, pela mesma forma, nas mesmas línguas e no mesmo local em que o haja sido o acto recorrido.",
            "2. A publicidade efectua-se mediante extracto, remetido pela secretaria no prazo de 8 dias contado do trânsito em julgado, do qual conste a indicação do tribunal, do recorrente, da entidade recorrida e dos contra-interessados, do acto recorrido e do local onde foi publicitado e do sentido e data da decisão."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO V Marcha do processo"
    },
    {
        "Artigo": "Artigo 79.º",
        "Ementa": "(Revogação do acto recorrido com efeitos retroactivos)",
        "Numero": [
            "1. Quando seja praticado, na pendência do recurso, acto revogatório do acto recorrido, com efeitos retroactivos, acompanhado de nova regulamentação da situação, pode o recorrente requerer que o recurso prossiga tendo por objecto o acto revogatório, com a faculdade de alegação de novos fundamentos e de oferecimento de diferentes meios de prova, sempre que:",
            "a) O requerimento seja apresentado no prazo para interposição do recurso do acto revogatório e antes do trânsito em julgado da decisão que julgue extinta a instância; e",
            "b) O tribunal seja competente para o conhecimento do recurso do acto revogatório.",
            "2. O disposto no número anterior é igualmente aplicável quando o acto recorrido seja modificado ou substituído por outro com os mesmos efeitos.",
            "3. O trânsito em julgado da decisão que julgue extinta a instância não prejudica a recorribilidade contenciosa do acto revogatório, nos termos gerais."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO VI Modificação e extinção da instância"
    },
    {
        "Artigo": "Artigo 80.º",
        "Ementa": "(Revogação do acto recorrido sem efeitos rectroactivos)",
        "Numero": [
            "1. Quando a revogação do acto recorrido não tenha efeitos retroactivos, o recurso prossegue tendo em vista a obtenção de decisão anulatória dos efeitos produzidos, sempre que estes continuem a afectar a esfera jurídica do recorrente e sejam susceptíveis de cessar pela reposição da situação actual hipotética obtida através do provimento do recurso.",
            "2. Quando a revogação seja acompanhada de nova regulamentação da situação, o recorrente, independentemente do prosseguimento do recurso relativamente aos efeitos produzidos, goza da faculdade prevista no artigo anterior.",
            "3. O disposto nos números anteriores é igualmente aplicável, com as necessárias adaptações, quando o acto recorrido seja modificado ou substituído por outro sem efeitos retroactivos."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO VI Modificação e extinção da instância"
    },
    {
        "Artigo": "Artigo 81.º",
        "Ementa": "(Prática de acto expresso ou seu conhecimento posteriores à interposição do recurso de indeferimento tácito)",
        "Numero": [
            "1. Quando, na pendência do recurso de indeferimento tácito, seja praticado acto expresso que não satisfaça, ou não satisfaça integralmente, os interesses do recorrente, pode este requerer que o recurso prossiga tendo por objecto o acto expresso, com a faculdade de alegação de novos fundamentos e de oferecimento de diferentes meios de prova, sempre que:",
            "a) O requerimento seja apresentado no prazo de 15 dias contado da publicação ou da notificação do acto expresso, considerando-se como tal, quando a notificação não tenha sido efectuada anteriormente, o conhecimento obtido através do recurso contencioso; e",
            "b) O tribunal seja competente para o conhecimento do recurso do acto expresso.",
            "2. O disposto no número anterior é igualmente aplicável quando o acto expresso tenha sido praticado em data anterior à interposição do recurso de indeferimento tácito e publicado ou notificado, ou por qualquer outra forma conhecido do recorrente, em data posterior àquela interposição.",
            "3. A não apresentação do requerimento previsto na alínea a) do n.º 1 não prejudica a recorribilidade contenciosa do acto expresso, nos termos gerais."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO VI Modificação e extinção da instância"
    },
    {
        "Artigo": "Artigo 82.º",
        "Ementa": "(Apensação de recursos)",
        "Numero": [
            "1. É admissível a apensação de recursos quando:",
            "a) O acto recorrido seja o mesmo;",
            "b) Os actos recorridos estejam formalmente contidos num despacho ou outra forma de decisão únicos e sejam impugnados com os mesmos fundamentos de facto e de direito.",
            "2. A apensação apenas pode ser requerida quando os recursos a apensar não tenham ultrapassado a fase dos articulados e não ocorra razão especial que a torne inconveniente.",
            "3. Os recursos são apensados ao que tenha sido interposto em primeiro lugar, considerando-se como tal o de numeração inferior."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO VI Modificação e extinção da instância"
    },
    {
        "Artigo": "Artigo 83.º",
        "Ementa": "(Prosseguimento de recurso a requerimento do Ministério Público)",
        "Numero": [
            "O Ministério Público pode requerer, assumindo a posição de recorrente, o prosseguimento de recurso a que tenha sido posto termo por decisão ainda não transitada fundada em desistência ou em outra causa impeditiva do seu conhecimento conexionada com o recorrente."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO VI Modificação e extinção da instância"
    },
    {
        "Artigo": "Artigo 84.º",
        "Ementa": "(Causas de extinção da instância)",
        "Numero": [
            "a) A sentença;",
            "b) O compromisso arbitral, nos termos admitidos pela lei;",
            "c) A deserção;",
            "d) A desistência;",
            "e) A impossibilidade ou inutilidade superveniente da lide."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO VI Modificação e extinção da instância"
    },
    {
        "Artigo": "Artigo 85.º",
        "Ementa": "(Deserção)",
        "Numero": [
            "a) Esteja parado, por inércia do recorrente, durante mais de 365 dias;",
            "b) Com excepção do disposto no n.º 2 do artigo 14.º, decorram mais de 365 dias sem que o recorrente promova os termos de incidente com efeito suspensivo."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO VI Modificação e extinção da instância"
    },
    {
        "Artigo": "Artigo 86.º",
        "Ementa": "(Forma de desistência)",
        "Numero": [
            "A desistência pode fazer-se por requerimento, por documento autêntico ou por termo no processo."
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO VI Modificação e extinção da instância"
    },
    {
        "Artigo": "Artigo 87.º",
        "Ementa": "(Impossibilidade ou inutilidade superveniente da lide)",
        "Numero": [
            "a) A revogação do acto recorrido sem que tenha havido lugar à aplicação do disposto nos artigos 79.º e 80.º;",
            "b) A prática de acto expresso ou o seu conhecimento posteriores à interposição do recurso de indeferimento tácito sem que tenha havido lugar à aplicação do disposto no artigo 81.º"
        ],
        "Titulo": "CAPÍTULO II Recurso contencioso SECÇÃO VI Modificação e extinção da instância"
    },
    {
        "Artigo": "Artigo 88.º",
        "Ementa": "(Natureza e finalidade da impugnação de normas)",
        "Numero": [
            "1. A impugnação de normas tem por finalidade a declaração de ilegalidade, com força obrigatória geral, de norma contida em regulamento administrativo.",
            "2. Fica excluída do regime de impugnabilidade regulado no presente capítulo a norma contida em regulamento administrativo:",
            "a) Que viole norma constante de lei fundamental ou princípio dela decorrente;",
            "b) Que viole norma constante de acto legislativo, ou a ele equiparado, aplicável em Macau, emanado de órgão do seu exterior com competência exclusiva para o efeito;",
            "c) Que viole norma constante de acordo ou convenção celebrados com o exterior de Macau, regularmente aprovados;",
            "d) Emanada de órgão do exterior de Macau, aqui aplicável, que viole norma ou princípio referidos nas alíneas anteriores."
        ],
        "Titulo": "CAPÍTULO III Impugnação de normas SECÇÃO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 89.º",
        "Ementa": "(Efeitos da declaração de ilegalidade)",
        "Numero": [
            "1. A declaração de ilegalidade de uma norma produz efeitos desde a data da sua entrada em vigor.",
            "2. Quando razões de equidade ou de interesse público de excepcional relevo, devidamente fundamentadas, o justifiquem, o tribunal pode reportar os efeitos da declaração à data do trânsito em julgado da decisão ou a momento anterior.",
            "3. A declaração de ilegalidade de uma norma determina a repristinação das normas que ela haja revogado, excepto quando tenha entretanto ocorrido outra causa de cessação da sua vigência.",
            "4. A retroactividade permitida pelos n.os 1 e 2 não afecta os casos julgados nem os actos administrativos consolidados na ordem jurídica, excepto quando o tribunal decida em contrário com fundamento no facto de a norma respeitar a matéria sancionatória e ser de conteúdo menos favorável ao particular."
        ],
        "Titulo": "CAPÍTULO III Impugnação de normas SECÇÃO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 90.º",
        "Ementa": "(Norma ilegal)",
        "Numero": [
            "1. A declaração de ilegalidade pode ser pedida quando a norma tenha sido julgada ilegal por qualquer tribunal em três casos concretos ou quando os seus efeitos se produzam imediatamente, independentemente de um acto administrativo ou jurisdicional de aplicação.",
            "2. Quando o requerente seja o Ministério Público, a declaração pode ser pedida independentemente dos requisitos previstos no número anterior."
        ],
        "Titulo": "CAPÍTULO III Impugnação de normas SECÇÃO II Pressupostos processuais"
    },
    {
        "Artigo": "Artigo 91.º",
        "Ementa": "(Legitimidade e prazo)",
        "Numero": [
            "1. A declaração de ilegalidade pode ser pedida a todo o tempo pelo Ministério Público, por quem se considere lesado pela aplicação da norma, ou possa previsivelmente vir a sê-lo em momento próximo, ou pelo Alto-Comissário Contra a Corrupção e a Ilegalidade Administrativa e deve ser obrigatoriamente pedida pelo Ministério Público quando tenha conhecimento de três decisões de quaisquer tribunais, transitadas em julgado, que recusem a sua aplicação com fundamento em ilegalidade.",
            "2. As decisões previstas no número anterior são comunicadas pelos tribunais que as profiram, por meio de certidão, ao representante do Ministério Público no tribunal competente."
        ],
        "Titulo": "CAPÍTULO III Impugnação de normas SECÇÃO II Pressupostos processuais"
    },
    {
        "Artigo": "Artigo 92.º",
        "Ementa": "(Tramitação)",
        "Numero": [
            "1. O processo de impugnação de normas segue os termos do processo de recurso contencioso de actos administrativos.",
            "2. O juiz ou o relator podem dispensar a citação do autor da norma quando este já tenha sido ouvido sobre os mesmos fundamentos em outro processo.",
            "3. No despacho que ordene ou dispense a citação do autor da norma o juiz ou o relator mandam publicitar, pela forma, nas línguas e no local utilizados para dar publicidade à norma, anúncio do pedido de declaração da sua ilegalidade a fim de permitir a intervenção no processo de eventuais interessados.",
            "4. A intervenção prevista no número anterior é admissível até ao início da fase de alegações.",
            "5. É ordenada a apensação dos processos relativos à mesma norma, excepto quando o seu estado ou outra razão especial a torne inconveniente."
        ],
        "Titulo": "CAPÍTULO III Impugnação de normas SECÇÃO III Marcha do processo"
    },
    {
        "Artigo": "Artigo 93.º",
        "Ementa": "(Decisão)",
        "Numero": [
            "1. O tribunal pode decidir com fundamento na ofensa de princípios ou normas jurídicas diversos daqueles cuja ofensa tenha sido invocada.",
            "2. A decisão de provimento é integralmente publicitada por ordem do tribunal, pela mesma forma, nas mesmas línguas e no mesmo local em que o haja sido a norma impugnada.",
            "3. É aplicável à publicidade da decisão, com as necessárias adaptações, o disposto no n.º 2 do artigo 78.º"
        ],
        "Titulo": "CAPÍTULO III Impugnação de normas SECÇÃO III Marcha do processo"
    },
    {
        "Artigo": "Artigo 94.º",
        "Ementa": "(Natureza do contencioso eleitoral)",
        "Numero": [
            "O contencioso eleitoral é de plena jurisdição."
        ],
        "Titulo": "CAPÍTULO IV Contencioso eleitoral"
    },
    {
        "Artigo": "Artigo 95.º",
        "Ementa": "(Pressupostos e prazo)",
        "Numero": [
            "1. O recurso em contencioso eleitoral pode ser interposto por quem, na eleição em causa, seja eleitor ou elegível ou, quanto à omissão nos cadernos ou listas eleitorais, quando os haja, também pelas pessoas cuja inscrição haja sido omitida.",
            "2. Excepto disposição especial em contrário, o prazo para interposição do recurso é de 7 dias contado da data em que seja possível o conhecimento do acto ou da omissão.",
            "3. É aplicável aos demais pressupostos o disposto para o recurso contencioso de actos administrativos."
        ],
        "Titulo": "CAPÍTULO IV Contencioso eleitoral"
    },
    {
        "Artigo": "Artigo 96.º",
        "Ementa": "(Tramitação)",
        "Numero": [
            "1. Com excepção do previsto nos números seguintes, ao recurso em contencioso eleitoral é aplicável o disposto para o recurso dos actos administrativos.",
            "2. Apenas é admissível prova documental.",
            "3. Apenas são admissíveis alegações quando, com a contestação, seja requerida ou produzida prova.",
            "4. Devem ser observados os seguintes prazos:",
            "a) 7 dias para a contestação e para alegações, correndo simultaneamente para todos os recorrentes ou para todos os recorridos;",
            "b) 5 dias para a decisão do juiz ou do relator ou para este considerar o processo pronto para julgamento;",
            "c) 3 dias para as restantes hipóteses.",
            "5. No processo para cujo conhecimento seja competente o Tribunal de Última Instância, são extraídas cópias das peças oferecidas pelos intervenientes, em número igual ao dos juízes-adjuntos, e imediatamente entregues a estes por termo nos autos ou por protocolo.",
            "6. Quando o processo não seja decidido pelo relator, é julgado, independentemente de vistos, na primeira sessão que tenha lugar após ter sido considerado pronto para o efeito."
        ],
        "Titulo": "CAPÍTULO IV Contencioso eleitoral"
    },
    {
        "Artigo": "Artigo 97.º",
        "Ementa": "(Espécies de acções)",
        "Numero": [
            "a) Reconhecimento de direitos ou interesses legalmente protegidos;",
            "b) Determinação da prática de actos administrativos legalmente devidos;",
            "c) Prestação de informação, consulta de processo ou passagem de certidão;",
            "d) Contratos administrativos;",
            "e) Responsabilidade da Administração ou dos titulares dos seus órgãos, funcionários ou agentes por prejuízos decorrentes de actos de gestão pública, incluindo acções de regresso;",
            "f) Outras relações jurídicas administrativas controvertidas a que lei especial faça corresponder acções do contencioso administrativo."
        ],
        "Titulo": "CAPÍTULO V Acções SECÇÃO I Disposições comuns"
    },
    {
        "Artigo": "Artigo 98.º",
        "Ementa": "(Prazos)",
        "Numero": [
            "Com excepção do disposto nos artigos 105.º, 109.º e 115.º e em lei especial, as acções podem ser propostas a todo o tempo."
        ],
        "Titulo": "CAPÍTULO V Acções SECÇÃO I Disposições comuns"
    },
    {
        "Artigo": "Artigo 99.º",
        "Ementa": "(Tramitação)",
        "Numero": [
            "1. Com excepção do disposto no n.º 5, na Secção IV e em lei especial, as acções seguem os termos do processo civil comum de declaração, na sua forma ordinária, com as especialidades constantes dos n.os 2 a 4.",
            "2. Excepto quando intervenha como demandante ou represente uma parte, o Ministério Público tem vista final para emitir parecer, no prazo de 14 dias, sobre a decisão a proferir.",
            "3. Excepto nas hipóteses em que a lei prescinda da sua intervenção e nas acções destinadas a obter uma indemnização cujo valor não exceda a alçada do Tribunal de Segunda Instância, as questões de facto nas acções propostas no Tribunal Administrativo são julgadas em tribunal colectivo.*",
            "4. No Tribunal Administrativo a sentença é proferida pelo juiz do processo, ainda que no julgamento intervenha o tribunal colectivo.",
            "5. Na hipótese prevista no n.º 3 do artigo 113.º, aplicam-se à dedução do pedido de anulação ou de declaração de nulidade ou inexistência jurídica, bem como à sua discussão e decisão, as normas que regulam o recurso contencioso quando se não revelem incompatíveis com as aplicáveis à tramitação da acção."
        ],
        "Titulo": "CAPÍTULO V Acções SECÇÃO I Disposições comuns"
    },
    {
        "Artigo": "Artigo 100.º",
        "Ementa": "(Pressupostos e finalidades)",
        "Numero": [
            "1. A acção para reconhecimento de um direito ou interesse legalmente protegido pode ser proposta quando, não tendo havido lugar à prática de um acto administrativo, nem a um indeferimento tácito, e não se pretendendo a determinação da prática de qualquer acto administrativo, tenha por finalidade a declaração do conteúdo de uma relação jurídica administrativa controvertida, designadamente o reconhecimento:",
            "a) De um direito fundamental face à Administração;",
            "b) De direito ao pagamento de quantia em dinheiro;",
            "c) De direito a entrega de coisa;",
            "d) De direito a uma prestação de facto.",
            "2. A acção prevista no número anterior pode também ser proposta quando tenha havido lugar a uma operação material ou a um acto administrativo nulo ou juridicamente inexistente de que, em qualquer das hipóteses, não tenha sido interposto recurso contencioso."
        ],
        "Titulo": "CAPÍTULO V Acções SECÇÃO II Acção para reconhecimento de direitos ou interesses legalmente protegidos"
    },
    {
        "Artigo": "Artigo 101.º",
        "Ementa": "(Legitimidade)",
        "Numero": [
            "A acção prevista nesta secção pode ser proposta por quem invoque a titularidade do direito ou interesse a reconhecer e pelos titulares do direito de acção popular definidos no artigo 36.º e deve ser intentada contra o órgão competente para determinar as operações decorrentes do, ou impostas pelo, reconhecimento do direito ou interesse de cuja titularidade o autor se arroga."
        ],
        "Titulo": "CAPÍTULO V Acções SECÇÃO II Acção para reconhecimento de direitos ou interesses legalmente protegidos"
    },
    {
        "Artigo": "Artigo 102.º",
        "Ementa": "(Cumulação de pedidos)",
        "Numero": [
            "a) O pedido de condenação na realização da prestação devida ou na prática, dentro dos prazos fixados pela decisão, dos actos e operações necessários para assegurar a tutela do direito ou interesse em causa;",
            "b) O pedido de indemnização de perdas e danos decorrentes da violação ou do não reconhecimento do direito ou interesse em causa."
        ],
        "Titulo": "CAPÍTULO V Acções SECÇÃO II Acção para reconhecimento de direitos ou interesses legalmente protegidos"
    },
    {
        "Artigo": "Artigo 103.º",
        "Ementa": "(Pressupostos)",
        "Numero": [
            "1. A acção para determinação da prática de actos administrativos legalmente devidos pode ser proposta quando:",
            "a) Tenha havido lugar a um indeferimento tácito;",
            "b) Tenha sido praticado um acto administrativo de recusa da prática de acto de conteúdo vinculado;",
            "c) Tenha sido praticado um acto administrativo de recusa de apreciação de pretensão cuja decisão envolvesse o exercicio de discricionariedade ou o preenchimento valorativo de conceitos jurídicos indeterminados.",
            "2. A acção prevista no número anterior apenas pode ser proposta quando do indeferimento tácito ou do acto administrativo praticado não tenha sido interposto recurso contencioso."
        ],
        "Titulo": "CAPÍTULO V Acções SECÇÃO III Acção para determinação da prática de actos administrativos legalmente devidos"
    },
    {
        "Artigo": "Artigo 104.º",
        "Ementa": "(Finalidades)",
        "Numero": [
            "1. A acção para determinação da prática de actos administrativos legalmente devidos tem por finalidade a condenação da Administração na prática do acto omitido ou recusado.",
            "2. Nas hipóteses de indeferimento tácito de pretensão cuja decisão envolvesse o exercício de discricionariedade ou o preenchimento valorativo de conceitos jurídicos indeterminados e de recusa de apreciação de tal pretensão, a finalidade da acção prevista no número anterior restringe-se à condenação na prática de acto expresso de forma a que a Administração disponha de margem de livre apreciação.",
            "3. Na hipótese prevista no número anterior, pode, contudo, a decisão, quando as circunstâncias o justifiquem, formular directivas de juridicidade do «iter» valorativo e cognoscitivo que conduz ao acto administrativo, sem fixar o seu concreto conteúdo."
        ],
        "Titulo": "CAPÍTULO V Acções SECÇÃO III Acção para determinação da prática de actos administrativos legalmente devidos"
    },
    {
        "Artigo": "Artigo 105.º",
        "Ementa": "(Prazo)",
        "Numero": [
            "1. Quando tenha havido lugar a um indeferimento tácito e se preveja que da procedência da acção resultem directamente prejuízos para terceiros, o direito de acção caduca no prazo de 365 dias cuja contagem se inicia no termo do prazo previsto nos n.os 2 e 3 do artigo 102.º e no artigo 162.º do Código do Procedimento Administrativo.",
            "2. Quando tenha sido praticado um acto administrativo de recusa da prática do acto pretendido pelo particular, o direito de acção caduca nos termos previstos para o recurso contencioso de indeferimento tácito e o início da contagem do prazo para o respectivo exercício tem lugar nos termos previstos para o recurso contencioso de acto expresso."
        ],
        "Titulo": "CAPÍTULO V Acções SECÇÃO III Acção para determinação da prática de actos administrativos legalmente devidos"
    },
    {
        "Artigo": "Artigo 107.º",
        "Ementa": "(Cumulação de pedidos)",
        "Numero": [
            "Qualquer que seja o tribunal competente, pode cumular-se com o pedido de determinação da prática de um acto administrativo legalmente devido, o pedido de indemnização de perdas e danos decorrentes da não prática tempestiva do acto omitido ou recusado."
        ],
        "Titulo": "CAPÍTULO V Acções SECÇÃO III Acção para determinação da prática de actos administrativos legalmente devidos"
    },
    {
        "Artigo": "Artigo 108.º",
        "Ementa": "(Pressupostos)",
        "Numero": [
            "1. Quando não seja dada satisfação às pretensões formuladas ao abrigo dos artigos 63.º a 67.º do Código do Procedimento Administrativo ou de lei especial sobre direito dos particulares à informação, consulta de processo ou passagem de certidão, o interessado ou o Ministério Público podem pedir a intimação do órgão administrativo competente nos termos e com os efeitos previstos na presente secção.",
            "2. O pedido de intimação é igualmente aplicável na hipótese prevista no n.º 2 do artigo 27.º",
            "3. À legitimidade na acção para prestação de informação, consulta de processo ou passagem de certidão é aplicável, com as necessárias adaptações, o disposto na alínea f) do n.º 2 do artigo 46.º e no artigo 47.º"
        ],
        "Titulo": "CAPÍTULO V Acções SECÇÃO IV Acção para prestação de informação, consulta de processo ou passagem de certidão"
    },
    {
        "Artigo": "Artigo 109.º",
        "Ementa": "(Prazo)",
        "Numero": [
            "a) Decurso do prazo, contado da data de apresentação da pretensão, sem que o órgão administrativo a satisfaça;",
            "b) Recusa expressa de satisfação da pretensão;",
            "c) Satisfação parcial da pretensão."
        ],
        "Titulo": "CAPÍTULO V Acções SECÇÃO IV Acção para prestação de informação, consulta de processo ou passagem de certidão"
    },
    {
        "Artigo": "Artigo 110.º",
        "Ementa": "(Suspensão de prazos)",
        "Numero": [
            "1. O pedido de prestação de informação, consulta de processo ou passagem de certidão dirigido a órgão administrativo, quando se destine a permitir ao interessado o uso de meios procedimentais administrativos ou processuais contenciosos, determina, a partir da data da sua apresentação, a suspensão da contagem dos respectivos prazos.",
            "2. O efeito suspensivo, incluindo o previsto na parte final do n.º 2 do artigo 27.º, mantém-se quando o interessado peça a subsequente intimação e cessa:",
            "a) Com o cumprimento da decisão que defira o pedido de intimação ou com o trânsito em julgado da que o indefira;",
            "b) Com o trânsito em julgado da decisão que extinga a instância por satisfação da pretensão na pendência do pedido de intimação.",
            "3. Não se verifica o efeito suspensivo quando o tribunal competente para o conhecimento do meio processual contencioso que venha a ser usado pelo interessado julgue que o pedido constituiu expediente manifestamente dilatório."
        ],
        "Titulo": "CAPÍTULO V Acções SECÇÃO IV Acção para prestação de informação, consulta de processo ou passagem de certidão"
    },
    {
        "Artigo": "Artigo 111.º",
        "Ementa": "(Tramitação)",
        "Numero": [
            "1. Apresentada a petição, o juiz ordena a citação do órgão administrativo para contestar no prazo de 10 dias.",
            "2. Apresentada a contestação ou findo o respectivo prazo, é ouvido o Ministério Público, quando não seja o requerente, e, concluídas as diligências que se mostrem necessárias, o juiz profere decisão."
        ],
        "Titulo": "CAPÍTULO V Acções SECÇÃO IV Acção para prestação de informação, consulta de processo ou passagem de certidão"
    },
    {
        "Artigo": "Artigo 112.º",
        "Ementa": "(Decisão)",
        "Numero": [
            "1. Na decisão o juiz determina o prazo em que a intimação deve ser cumprida.",
            "2. A decisão que conheça do pedido apenas o pode indeferir com fundamento nas razões que, nos termos do Código do Procedimento Administrativo ou de lei especial, permitem ao órgão administrativo recusar ou limitar a satisfação da pretensão do interessado."
        ],
        "Titulo": "CAPÍTULO V Acções SECÇÃO IV Acção para prestação de informação, consulta de processo ou passagem de certidão"
    },
    {
        "Artigo": "Artigo 113.º",
        "Ementa": "(Finalidade e cumulação de pedidos)",
        "Numero": [
            "1. A acção sobre contratos administrativos tem por finalidade dirimir os litígios sobre interpretação, validade ou execução dos contratos, incluindo a efectivação de responsabilidade civil contratual.",
            "2. O conhecimento da acção sobre contratos administrativos não impede o recurso contencioso de actos administrativos relativos à formação e execução do contrato.",
            "3. O pedido de anulação ou de declaração de nulidade ou inexistência jurídica de actos administrativos relativos à formação e execução do contrato pode ser deduzido, inicial ou supervenientemente, em acção sobre contratos administrativos quando aquele pedido e os formulados nos termos do n.º 1 estejam entre si numa relação de prejudicialidade ou de dependência ou quando a procedência de todos os pedidos dependa essencialmente da apreciação dos mesmos factos ou da interpretação e aplicação das mesmas normas jurídicas ou cláusulas contratuais."
        ],
        "Titulo": "CAPÍTULO V Acções SECÇÃO V Acção sobre contratos administrativos"
    },
    {
        "Artigo": "Artigo 114.º",
        "Ementa": "(Legitimidade)",
        "Numero": [
            "1. A acção sobre interpretação dos contratos pode ser proposta pelos sujeitos da relação contratual e, na estrita medida em que se relacione com a respectiva validade ou execução, pelas entidades referidas nos números seguintes.",
            "2. A acção sobre validade, total ou parcial, dos contratos pode ser proposta:",
            "a) Pelos sujeitos da relação contratual;",
            "b) Pelo Ministério Público;",
            "c) Pelos que, tendo legitimidade para interpor recurso contencioso de um acto administrativo relativo à formação do contrato, o tenham feito, na estrita medida em que a decisão então proferida lhes tenha sido favorável;",
            "d) Pelas pessoas singulares ou colectivas titulares ou defensoras de direitos subjectivos ou interesses legalmente protegidos aos quais a execução do contrato considerado inválido cause, ou possa previsivelmente causar, prejuízo.",
            "3. A acção sobre execução dos contratos pode ser proposta:",
            "a) Pelos sujeitos da relação contratual;",
            "b) Pelo Ministério Público, quando se trate da execução de cláusulas contratuais estabelecidas no interesse geral da comunidade;",
            "c) Pelas pessoas singulares ou colectivas titulares ou defensoras de direitos subjectivos ou interesses legalmente protegidos em função dos quais as cláusulas contratuais tenham sido estabelecidas."
        ],
        "Titulo": "CAPÍTULO V Acções SECÇÃO V Acção sobre contratos administrativos"
    },
    {
        "Artigo": "Artigo 115.º",
        "Ementa": "(Prazo)",
        "Numero": [
            "1. O direito de acção sobre validade dos contratos para cuja propositura tenham legitimidade as entidades referidas nas alíneas b) a d) do n.º 2 do artigo anterior caduca nos seguintes prazos:",
            "a) 180 dias contados do conhecimento do conteúdo do contrato, mas nunca depois de decorridos 3 anos desde a sua celebração, nas hipóteses previstas nas alíneas b) e d);",
            "b) 180 dias contados do trânsito em julgado da decisão de anulação ou de declaração de nulidade ou inexistência jurídica de acto administrativo relativo à formação do contrato, na hipótese prevista na alínea c).",
            "2. Ao pedido de anulação previsto no n.º 3 do artigo 113.º é aplicável o disposto nos n.os 2 e 3 do artigo 25.º e nos artigos 26.º e 27.º"
        ],
        "Titulo": "CAPÍTULO V Acções SECÇÃO V Acção sobre contratos administrativos"
    },
    {
        "Artigo": "Artigo 116.º",
        "Ementa": "(Pressupostos)",
        "Numero": [
            "Não pode ser proposta acção para efectivação de responsabilidade civil extracontratual, por danos causados por acto administrativo ilícito de que tenha sido interposto recurso contencioso, antes do trânsito em julgado da respectiva decisão, excepto, quando não tenha sido utilizada a faculdade prevista na alínea b) do n.º 1 do artigo 24.º, relativamente a perdas e danos que, pela sua natureza, devam subsistir mesmo em caso de reposição da situação actual hipotética obtida através do provimento do recurso."
        ],
        "Titulo": "CAPÍTULO V Acções SECÇÃO VI Acção para efectivação de responsabilidade civil extracontratual"
    },
    {
        "Artigo": "Artigo 117.º",
        "Ementa": "(Legitimidade)",
        "Numero": [
            "A acção para efectivação de responsabilidade civil extracontratual pode ser proposta por quem considere ter sofrido prejuízos decorrentes de actos de gestão pública."
        ],
        "Titulo": "CAPÍTULO V Acções SECÇÃO VI Acção para efectivação de responsabilidade civil extracontratual"
    },
    {
        "Artigo": "Artigo 118.º",
        "Ementa": "(Recurso)",
        "Numero": [
            "1. O recurso de actos de aplicação de multas e sanções acessórias e dos restantes actos previstos na lei praticados por órgãos administrativos em processos de infracção administrativa segue os termos do processo de recurso contencioso de actos administrativos, com as especialidades constantes do número seguinte.",
            "2. Quando o tribunal, não obstante conceda provimento ao recurso, entenda que o recorrente deve ser condenado, fixa para o efeito, na sentença, o quantitativo da multa e a espécie e duração da sanção acessória."
        ],
        "Titulo": "CAPÍTULO VI Meios processuais relativos a infracções administrativas"
    },
    {
        "Artigo": "Artigo 119.º",
        "Ementa": "(Revisão de decisões)",
        "Numero": [
            "1. Ao pedido de revisão das decisões de aplicação de multas e sanções acessórias proferidas por órgãos administrativos em processos de infracção administrativa é aplicável, com as necessárias adaptações, o disposto no Código de Processo Penal.",
            "2. A revisão apenas pode ter lugar nas seguintes hipóteses:",
            "a) A favor do infractor, quando não tenham decorrido mais de 2 anos sobre a data em que a decisão se tornou inimpugnável;",
            "b) Contra o infractor, quando vise a sua condenação pela prática de um crime.",
            "3. Na hipótese prevista na alínea a) do número anterior, não é admissível a revisão quando a multa aplicada seja de valor inferior ao montante correspondente ao índice 30 da tabela indiciária de vencimentos dos trabalhadores da Administração Pública ou o prejuízo sofrido com a sanção acessória não exceda aquele limite.",
            "4. O processo de revisão é da exclusiva competência do Tribunal Administrativo.",
            "5. A revisão pode ser pedida pelo infractor, pelo órgão administrativo ou pelo Ministério Público."
        ],
        "Titulo": "CAPÍTULO VI Meios processuais relativos a infracções administrativas"
    },
    {
        "Artigo": "Artigo 120.º",
        "Ementa": "(Suspensão de eficácia de actos administrativos)",
        "Numero": [
            "a) Tenham conteúdo positivo;",
            "b) Tendo conteúdo negativo, apresentem uma vertente positiva e a suspensão seja circunscrita a esta vertente."
        ],
        "Titulo": "CAPÍTULO VII Procedimentos preventivos e conservatórios SECÇÃO I Suspensão de eficácia"
    },
    {
        "Artigo": "Artigo 121.º",
        "Ementa": "(Legitimidade e requisitos)",
        "Numero": [
            "1. A suspensão de eficácia dos actos administrativos, que pode ser pedida por quem tenha legitimidade para deles interpor recurso contencioso, é concedida pelo tribunal quando se verifiquem os seguintes requisitos:",
            "a) A execução do acto cause previsivelmente prejuízo de difícil reparação para o requerente ou para os interesses que este defenda ou venha a defender no recurso;",
            "b) A suspensão não determine grave lesão do interesse público concretamente prosseguido pelo acto; e",
            "c) Do processo não resultem fortes indícios de ilegalidade do recurso.",
            "2. Quando o acto tenha sido declarado nulo ou juridicamente inexistente, por sentença ou acórdão pendentes de recurso jurisdicional, a suspensão de eficácia depende apenas da verificação do requisito previsto na alínea a) do número anterior.",
            "3. Não é exigível a verificação do requisito previsto na alínea a) do n.º 1 para que seja concedida a suspensão de eficácia de acto com a natureza de sanção disciplinar.",
            "4. Ainda que o tribunal não dê como verificado o requisito previsto na alínea b) do n.º 1, a suspensão de eficácia pode ser concedida quando, preenchidos os restantes requisitos, sejam desproporcionadamente superiores os prejuízos que a imediata execução do acto cause ao requerente.",
            "5. Verificados os requisitos previstos no n.º 1 ou na hipótese prevista no número anterior, a suspensão não é, contudo, concedida quando os contra-interessados façam prova de que dela lhes resulta prejuízo de mais difícil reparação do que o que resulta para o requerente da execução do acto."
        ],
        "Titulo": "CAPÍTULO VII Procedimentos preventivos e conservatórios SECÇÃO I Suspensão de eficácia"
    },
    {
        "Artigo": "Artigo 122.º",
        "Ementa": "(Acto já executado)",
        "Numero": [
            "1. A execução do acto não impede a suspensão da sua eficácia quando dela possa advir para o requerente ou para os interesses que este defenda ou venha a defender no recurso utilidade relevante no que respeita aos efeitos que o acto ainda produza ou venha a produzir.",
            "2. Quando tenha sido concedida a suspensão de acto já executado ou haja sido recusada com fundamento no disposto no n.º 5 do artigo anterior, podem o recorrente e os contra-interessados requerer o julgamento urgente do recurso, reduzindo-se os prazos para metade."
        ],
        "Titulo": "CAPÍTULO VII Procedimentos preventivos e conservatórios SECÇÃO I Suspensão de eficácia"
    },
    {
        "Artigo": "Artigo 123.º",
        "Ementa": "(Momento e forma do pedido)",
        "Numero": [
            "1. A suspensão é pedida, por uma só vez, em requerimento próprio apresentado:",
            "a) Previamente à interposição do recurso;",
            "b) Juntamente com a petição do recurso;",
            "c) Na pendência do recurso.",
            "2. O requerimento é apresentado, conforme as hipóteses, no tribunal competente para o conhecimento do recurso contencioso ou do recurso jurisdicional de sentença ou acórdão que já tenham sido proferidos.",
            "3. No requerimento deve o requerente indicar a sua identidade e residência ou sede, bem como as dos contra-interessados a quem a suspensão de eficácia do acto possa directamente prejudicar, identificar o acto e o seu autor e especificar, de forma articulada, os fundamentos do pedido, juntando os documentos que entenda necessários e, quando a suspensão tenha sido pedida previamente à interposição do recurso, fazendo prova do acto nos termos previstos no artigo 43.º e da sua publicação ou notificação ou, na sua falta, da data a partir da qual se iniciou a contagem do prazo para interposição do recurso.",
            "4. Quando o requerimento seja apresentado na pendência do recurso, o requerente deve, ainda, identificar o respectivo processo.",
            "5. Quando haja contra-interessados, o requerente deve juntar os correspondentes duplicados do requerimento e mais um."
        ],
        "Titulo": "CAPÍTULO VII Procedimentos preventivos e conservatórios SECÇÃO I Suspensão de eficácia"
    },
    {
        "Artigo": "Artigo 124.º",
        "Ementa": "(Identificação dos contra-interessados)",
        "Numero": [
            "1. Quando o requerente não conheça a identidade e residência ou sede dos contra-interessados, deve requerer, previamente, certidão do processo administrativo de onde constem aqueles elementos de identificação.",
            "2. A certidão prevista no número anterior deve ser passada no prazo de 24 horas pelo órgão administrativo.",
            "3. Quando a certidão não seja passada, o requerente junta ao requerimento de suspensão de eficácia duplicado do requerimento dirigido ao órgão administrativo acompanhado do respectivo recibo de entrega e indica a identidade e residência ou sede dos contra-interessados que conheça.",
            "4. Quando haja lugar à aplicação do disposto no número anterior, a secretaria, logo que registe a apresentação do requerimento, apresenta-o ao juiz ou relator a fim de ordenar a notificação do órgão administrativo para, no prazo de 2 dias, remeter a certidão requerida.",
            "5. Ao incumprimento da notificação prevista na parte final do número anterior é aplicável, com as necessárias adaptações, o disposto nos n.os 5 e 6 do artigo 55.º"
        ],
        "Titulo": "CAPÍTULO VII Procedimentos preventivos e conservatórios SECÇÃO I Suspensão de eficácia"
    },
    {
        "Artigo": "Artigo 125.º",
        "Ementa": "(Autuação, rejeição e citação)",
        "Numero": [
            "1. Quando a suspensão tenha sido pedida previamente à interposição do recurso, o processo, logo que transite em julgado a decisão sobre a suspensão, é apensado ao recurso que se encontre ou venha a encontrar pendente; nas restantes hipóteses o requerimento é autuado por apenso.",
            "2. Quando o requerimento ou a sua instrução enfermem de deficiências ou irregularidades formais, aplica-se, com as necessárias adaptações, o disposto no artigo 51.º",
            "3. Sem prejuízo do disposto no número anterior, a secretaria, logo que registe a apresentação do requerimento e independentemente de despacho prévio, cita simultaneamente o órgão administrativo e os contra-interessados, quando os haja, para contestarem no prazo de 10 dias, remetendo-lhes os duplicados juntos pelo requerente.",
            "4. Quando haja lugar à aplicação do disposto no n.º 4 do artigo anterior, a secretaria apenas expede as citações após a resposta do órgão administrativo ou o termo do respectivo prazo.",
            "5. Quando não haja resposta do órgão administrativo, a secretaria cita os contra-interessados indicados pelo requerente.",
            "6. A citação dos contra-interessados que sejam incertos, designadamente pela falta de resposta do órgão administrativo, ou cuja residência ou sede seja desconhecida, é feita por edital, afixado no tribunal na data da expedição das restantes citações, e por publicação de anúncios.",
            "7. Quando a suspensão tenha sido pedida na pendência do recurso, o órgão administrativo e os contra-interessados que já tenham sido citados para o recurso são chamados ao processo por notificação.",
            "8. Qualquer interessado que não tenha recebido a citação apenas pode intervir no processo até à conclusão ao juiz ou ao relator para efeitos de decisão ou de submissão à conferência, respectivamente."
        ],
        "Titulo": "CAPÍTULO VII Procedimentos preventivos e conservatórios SECÇÃO I Suspensão de eficácia"
    },
    {
        "Artigo": "Artigo 126.º",
        "Ementa": "(Suspensão provisória)",
        "Numero": [
            "1. Recebida a citação ou notificação, o órgão administrativo não pode iniciar ou prosseguir a execução, devendo impedir, com urgência, que os serviços competentes ou os interessados procedam ou continuem a proceder à execução.",
            "2. Excepto na hipótese prevista no n.º 2 do artigo 121.º, não é aplicável o disposto no número anterior quando o órgão administrativo reconheça, fundamentadamente e por escrito, no prazo de 3 dias, grave prejuízo para o interesse público na não imediata execução.",
            "3. O reconhecimento previsto no número anterior é imediatamente comunicado ao tribunal."
        ],
        "Titulo": "CAPÍTULO VII Procedimentos preventivos e conservatórios SECÇÃO I Suspensão de eficácia"
    },
    {
        "Artigo": "Artigo 127.º",
        "Ementa": "(Execução indevida)",
        "Numero": [
            "1. Considera-se indevida a execução que se inicie ou prossiga sem que tenha sido fundamentada e comunicada nos termos dos n.os 2 e 3 do artigo anterior ou quando o tribunal julgue improcedentes as razões em que se fundamenta.",
            "2. O requerente pode pedir ao tribunal onde penda o processo de suspensão de eficácia, e até ao trânsito em julgado da sua decisão, a declaração de ineficácia, para efeitos de suspensão, dos actos de execução indevida.",
            "3. O incidente é processado nos autos de suspensão de eficácia.",
            "4. Pedida a declaração de ineficácia dos actos de execução indevida, o tribunal ouve o órgão administrativo, pelo prazo de 5 dias, e o Ministério Público, quando não seja o requerente, pelo prazo de 3 dias.",
            "5. Nos Tribunais de Última e de Segunda Instâncias, a decisão é proferida pelo relator."
        ],
        "Titulo": "CAPÍTULO VII Procedimentos preventivos e conservatórios SECÇÃO I Suspensão de eficácia"
    },
    {
        "Artigo": "Artigo 129.º",
        "Ementa": "(Tramitação subsequente do processo)",
        "Numero": [
            "1. Quando não haja contestação do órgão administrativo ou alegação de que a suspensão de eficácia do acto causa grave lesão do interesse público, o tribunal, excepto quando, perante as circunstâncias do caso, seja manifesta ou ostensiva essa grave lesão, considera verificado o requisito previsto na alínea b) do n.º 1 do artigo 121.º",
            "2. Juntas as contestações ou findo o respectivo prazo, o processo vai com vista ao Ministério Público, por 2 dias e, seguidamente, é concluso ao juiz para decidir, ou ao relator para o submeter à conferência na sessão imediata, independentemente de vistos, que só correm quando qualquer dos juízes-adjuntos os solicite, hipótese em que a decisão é proferida na sessão seguinte àquela."
        ],
        "Titulo": "CAPÍTULO VII Procedimentos preventivos e conservatórios SECÇÃO I Suspensão de eficácia"
    },
    {
        "Artigo": "Artigo 130.º",
        "Ementa": "(Decisão e seu regime)",
        "Numero": [
            "1. Quando considere manifesta a verificação de circunstâncias que obstem ao conhecimento do pedido, a decisão pode ser proferida apenas pelo relator.",
            "2. A suspensão pode ser sujeita a termo ou condição.",
            "3. A decisão que suspenda a eficácia é urgentemente notificada ao órgão administrativo para cumprimento.",
            "4. A decisão que suspenda a eficácia deve ser imediatamente cumprida.",
            "5. Para efeitos do disposto no número anterior, o órgão administrativo competente não pode iniciar ou prosseguir a execução do acto, deve impedir, com urgência, que os serviços ou os interessados procedam ou continuem a proceder à execução e encontra-se obrigado a adoptar as providências necessárias à neutralização da execução já realizada e à eliminação dos efeitos já produzidos.",
            "6. Excepto determinação em contrário, a suspensão subsiste até ao trânsito em julgado da decisão do recurso contencioso.",
            "7. Quando seja pedida previamente à interposição do recurso, a suspensão caduca com o termo do prazo de que o requerente dispõe para interpor recurso de actos anuláveis sem que aquela interposição tenha tido lugar."
        ],
        "Titulo": "CAPÍTULO VII Procedimentos preventivos e conservatórios SECÇÃO I Suspensão de eficácia"
    },
    {
        "Artigo": "Artigo 131.º",
        "Ementa": "(Suspensão de eficácia de normas)",
        "Numero": [
            "1. A eficácia de normas contidas em regulamento administrativo susceptíveis de impugnação nos termos do presente Código pode ser suspensa.",
            "2. À suspensão de eficácia prevista no número anterior é aplicável o disposto nesta secção com as necessárias adaptações, designadamente as seguintes:",
            "a) A referência ao recurso contencioso é substituída por referência à impugnação de normas;",
            "b) A referência à declaração de nulidade ou de inexistência jurídica do acto administrativo é substituída por referência à declaração de ilegalidade da norma;",
            "c) A referência ao órgão administrativo é substituída por referência ao autor da norma;",
            "d) Os contra-interessados são citados, independentemente de despacho prévio, nos termos do n.º 3 do artigo 92.º, contando-se o prazo para contestação da data da publicitação.",
            "3. Quando seja pedida previamente à apresentação do pedido de declaração de ilegalidade da norma, a suspensão caduca no prazo de 30 dias contado do trânsito em julgado da decisão sem que aquela apresentação tenha tido lugar."
        ],
        "Titulo": "CAPÍTULO VII Procedimentos preventivos e conservatórios SECÇÃO I Suspensão de eficácia"
    },
    {
        "Artigo": "Artigo 132.º",
        "Ementa": "(Pressupostos)",
        "Numero": [
            "1. Quando os órgãos administrativos, os particulares ou os concessionários violem normas de direito administrativo ou deveres decorrentes de acto ou contrato administrativos ou quando a actividade dos primeiros e dos últimos viole um direito fundamental ou ainda quando, em ambas as hipóteses, haja fundado receio de violação, pode o Ministério Público ou qualquer pessoa a cujos interesses a violação cause ofensa digna de tutela jurisdicional pedir ao tribunal que os intime a adoptar certo comportamento ou a abster-se dele com o fim de assegurar, respectivamente, o cumprimento das normas ou deveres em causa ou o respeito pelo exercício do direito.",
            "2. O pedido pode ser apresentado antes ou na pendência do uso do meio procedimental administrativo ou processual contencioso adequado à tutela dos interesses a que a intimação se destina e constitui incidente quando aquele meio tenha a natureza de processo contencioso.",
            "3. O pedido de intimação não pode ser apresentado quando os interesses que com ele se pretendam tutelar sejam susceptíveis de defesa, em concreto, por via da suspensão de eficácia."
        ],
        "Titulo": "CAPÍTULO VII Procedimentos preventivos e conservatórios SECÇÃO II Intimação para um comportamento"
    },
    {
        "Artigo": "Artigo 133.º",
        "Ementa": "(Tramitação)",
        "Numero": [
            "1. Apresentado o requerimento, o juiz ou o relator ordenam a citação do requerido para contestar no prazo de 7 dias.",
            "2. Quando o pedido seja apresentado na pendência de processo contencioso, o requerido que já tenha sido citado naquele processo é chamado ao incidente por notificação.",
            "3. Ouvido seguidamente o Ministério Público, quando não seja o requerente, e concluídas as diligências que se mostrem necessárias, aplica-se o disposto no n.º 2 do artigo 129.º",
            "4. Na hipótese de excepcional urgência, o juiz ou o relator podem, em despacho fundamentado, encurtar o prazo para contestação do requerido e o da vista ao Ministério Público ou ainda dispensar a audiência daquele.",
            "5. Em qualquer momento, face à complexidade da matéria controvertida, o juiz ou o relator podem determinar que passem a seguir-se os termos do recurso contencioso de actos administrativos, mantendo-se, porém, a natureza urgente do processo."
        ],
        "Titulo": "CAPÍTULO VII Procedimentos preventivos e conservatórios SECÇÃO II Intimação para um comportamento"
    },
    {
        "Artigo": "Artigo 134.º",
        "Ementa": "(Decisão provisória)",
        "Numero": [
            "1. Quando seja dispensada a audiência do requerido, a decisão do tribunal é provisória e converte-se em definitiva na falta da oposição prevista nos números seguintes.",
            "2. O requerido pode deduzir oposição à decisão provisória no prazo de 7 dias contado da notificação, apresentando duplicado para entrega ao requerente.",
            "3. Excepto quando a decisão provisória tenha por objecto o respeito pelo exercício de um direito fundamental, a oposição tem efeito suspensivo da intimação.",
            "4. Ouvidos o requerente e o Ministério Público, quando este não seja o requerente, em prazo fixado em função da urgência do caso, e concluídas as diligências que se mostrem necessárias, o tribunal conhece dos fundamentos da oposição e profere decisão final sobre o pedido de intimação."
        ],
        "Titulo": "CAPÍTULO VII Procedimentos preventivos e conservatórios SECÇÃO II Intimação para um comportamento"
    },
    {
        "Artigo": "Artigo 135.º",
        "Ementa": "(Decisão)",
        "Numero": [
            "Na decisão o tribunal especifica o comportamento ou a abstenção a adoptar, o responsável ou responsáveis por estes e, quando o deva fazer, o prazo para o respectivo cumprimento."
        ],
        "Titulo": "CAPÍTULO VII Procedimentos preventivos e conservatórios SECÇÃO II Intimação para um comportamento"
    },
    {
        "Artigo": "Artigo 136.º",
        "Ementa": "(Caducidade da intimação)",
        "Numero": [
            "1. A intimação caduca quando:",
            "a) O requerente não faça uso, no respectivo prazo, do meio procedimental administrativo ou processual contencioso adequado à tutela dos interesses a que o pedido de intimação se destinou;",
            "b) Tendo o requerente feito uso desse meio, o correspondente procedimento ou processo esteja parado durante mais de 90 dias por negligência sua em promover os respectivos termos ou os de algum incidente de que dependa o andamento do procedimento ou processo;",
            "c) No procedimento ou processo usado nos termos da alínea a), seja proferida decisão desfavorável ao pedido do requerente que não seja impugnada dentro do prazo legal ou não seja susceptível de impugnação;",
            "d) O procedimento ou processo usado nos termos da alínea a) finde por extinção do procedimento ou da instância e o requerente não instaure novo procedimento ou processo, quando a lei o permita, dentro do prazo fixado para o efeito;",
            "e) Se extinga o interesse a cuja tutela o pedido de intimação se destinou.",
            "2. Quando a tutela dos interesses a que o pedido de intimação se destinou seja assegurada por meio procedimental administrativo ou processual contencioso não sujeito a prazo, deve o requerente, para efeitos do disposto na alínea a) do número anterior e quando outro não seja fixado pelo tribunal em atenção às circunstâncias do caso, usar o meio no prazo de 30 dias contado do trânsito em julgado da decisão.",
            "3. A intimação caduca ainda, sem necessidade de declaração pelo tribunal, quando a adopção do comportamento ou da respectiva abstenção pelo requerido extinga, por satisfação integral, o interesse a cuja tutela o pedido de intimação se destinou.",
            "4. Quando a intimação caduque, o requerente que não tenha agido com a prudência normal é responsável pelos danos causados ao requerido."
        ],
        "Titulo": "CAPÍTULO VII Procedimentos preventivos e conservatórios SECÇÃO II Intimação para um comportamento"
    },
    {
        "Artigo": "Artigo 137.º",
        "Ementa": "(Tramitação do pedido de caducidade)",
        "Numero": [
            "1. Excepto na hipótese prevista no n.º 3 do artigo anterior, a caducidade da intimação é declarada pelo tribunal a pedido fundamentado de qualquer interessado ou do Ministério Público.",
            "2. Apresentado o requerimento, o juiz ou o relator ordenam a notificação do requerente da intimação para contestar no prazo de 7 dias.",
            "3. Ouvido o Ministério Público, quando a declaração de caducidade não seja por ele requerida, e concluídas as diligências que se mostrem necessárias, o tribunal decide."
        ],
        "Titulo": "CAPÍTULO VII Procedimentos preventivos e conservatórios SECÇÃO II Intimação para um comportamento"
    },
    {
        "Artigo": "Artigo 138.º",
        "Ementa": "(Pressupostos)",
        "Numero": [
            "Havendo justo receio de vir a tornar-se impossível ou de difícil realização o depoimento de certas pessoas ou a verificação de certos factos por meio de prova pericial ou de inspecção, podem o depoimento, a perícia ou a inspecção realizar-se antes de instaurado o processo."
        ],
        "Titulo": "CAPÍTULO VII Procedimentos preventivos e conservatórios SECÇÃO III Produção antecipada de prova"
    },
    {
        "Artigo": "Artigo 139.º",
        "Ementa": "(Tramitação)",
        "Numero": [
            "1. O requerimento, a apresentar com tantos duplicados quantas as pessoas a notificar, deve justificar sumariamente a necessidade de antecipação de prova, mencionar com precisão os factos sobre que esta há-de recair, especificar os meios de prova a produzir, identificar as pessoas que hão-de ser ouvidas, quando a tal haja lugar, e indicar, com a possível concretização, o pedido e os fundamentos do processo a instaurar, bem como a pessoa ou órgão em relação aos quais se pretende fazer uso da prova.",
            "2. A pessoa ou órgão indicados são notificados para intervir nos actos de preparação e produção da prova ou para deduzir oposição no prazo de 3 dias.",
            "3. Tratando-se de incapazes, incertos ou ausentes é notificado o Ministério Público.",
            "4. Quando não seja notificado, o Ministério Público é ouvido no prazo de 3 dias, após o que o tribunal decide em igual prazo.",
            "5. Quando a notificação prevista no n.º 2 não possa ser feita a tempo de, com grande probabilidade, se realizar a diligência pedida, é apenas notificado o Ministério Público.",
            "6. Na hipótese prevista no número anterior, a pessoa ou órgão indicados são imediatamente notificados da realização da diligência, tendo a faculdade de requerer, no prazo de 7 dias, a sua repetição, quando seja possível."
        ],
        "Titulo": "CAPÍTULO VII Procedimentos preventivos e conservatórios SECÇÃO III Produção antecipada de prova"
    },
    {
        "Artigo": "Artigo 140.º",
        "Ementa": "(Pedido em processo pendente)",
        "Numero": [
            "O disposto nesta secção é aplicável, com as necessárias adaptações, ao pedido de antecipação de prova em processo já instaurado."
        ],
        "Titulo": "CAPÍTULO VII Procedimentos preventivos e conservatórios SECÇÃO III Produção antecipada de prova"
    },
    {
        "Artigo": "Artigo 141.º",
        "Ementa": "(Pressupostos)",
        "Numero": [
            "1. Quando um particular mostre fundado receio de que uma actividade administrativa cause lesão grave e dificilmente reparável a um seu direito ou interesse legalmente protegido, pode requerer a providência preventiva ou conservatória concretamente adequada a assegurar a tutela do direito ou interesse ameaçado.",
            "2. A providência requerida não pode ter por objecto a indisponibilidade de bens móveis ou imóveis afectos a serviços de relevante interesse público.",
            "3. O pedido de providência não pode ser apresentado quando o direito ou interesse que com ele se pretendam tutelar sejam susceptíveis de defesa, em concreto, por via dos restantes procedimentos regulados no presente capítulo."
        ],
        "Titulo": "CAPÍTULO VII Procedimentos preventivos e conservatórios SECÇÃO IV Providências preventivas e conservatórias não especificadas"
    },
    {
        "Artigo": "Artigo 142.º",
        "Ementa": "(Tramitação)",
        "Numero": [
            "1. Sem prejuízo do previsto nos números seguintes, é aplicável às providências preventivas e conservatórias não especificadas, com as necessárias adaptações, o disposto na lei de processo civil sobre providências conservatórias ou antecipatórias não especificadas.",
            "2. As testemunhas oferecidas são apresentadas pelas partes no dia e local designados para a inquirição, não podendo esta ser adiada por falta de testemunhas ou dos mandatários.",
            "3. Nos Tribunais de Última e de Segunda Instâncias:",
            "a) Apenas é admitida prova documental e testemunhal;",
            "b) Os depoimentos são prestados perante o relator e reduzidos a escrito.",
            "4. Produzida a prova, aplica-se o disposto no n.º 2 do artigo 129.º",
            "5. É aplicável à decisão que decrete a providência, com as necessárias adaptações, o disposto nos n.os 3 a 6 do artigo 130.º",
            "6. A providência decretada não pode ser substituída por caução."
        ],
        "Titulo": "CAPÍTULO VII Procedimentos preventivos e conservatórios SECÇÃO IV Providências preventivas e conservatórias não especificadas"
    },
    {
        "Artigo": "Artigo 143.º",
        "Ementa": "(Lei aplicável ao conflito de jurisdição e de competência)",
        "Numero": [
            "Sem prejuízo do previsto nos artigos seguintes, é aplicável ao conflito de jurisdição e de competência, com as necessárias adaptações, o disposto na lei de processo civil sobre conflitos de competência."
        ],
        "Titulo": "CAPÍTULO VIII Conflito de jurisdição, competência e atribuições"
    },
    {
        "Artigo": "Artigo 144.º",
        "Ementa": "(Pressupostos)",
        "Numero": [
            "A resolução do conflito de jurisdição e de competência pode ser pedida por qualquer interessado ou pelo Ministério Público, em prazos iguais aos previstos para interposição de recursos contenciosos contados da data em que se torne irrecorrível a última das decisões."
        ],
        "Titulo": "CAPÍTULO VIII Conflito de jurisdição, competência e atribuições"
    },
    {
        "Artigo": "Artigo 145.º",
        "Ementa": "(Decisão provisória)",
        "Numero": [
            "Quando da inacção das autoridades em conflito possa resultar grave prejuízo, o relator submete a questão a conferência, na primeira sessão, independentemente de vistos, para que o tribunal designe a autoridade que deve exercer provisoriamente a jurisdição ou competência em tudo o que seja urgente."
        ],
        "Titulo": "CAPÍTULO VIII Conflito de jurisdição, competência e atribuições"
    },
    {
        "Artigo": "Artigo 146.º",
        "Ementa": "(Decisão)",
        "Numero": [
            "1. A decisão que resolva o conflito, além de especificar a autoridade que deve exercer a jurisdição ou competência, declara a nulidade dos actos ou das decisões da outra autoridade em conflito.",
            "2. Quando razões de equidade ou de interesse público especialmente relevante fundamentadamente o justifiquem, a decisão pode excluir da declaração de nulidade os actos preparatórios."
        ],
        "Titulo": "CAPÍTULO VIII Conflito de jurisdição, competência e atribuições"
    },
    {
        "Artigo": "Artigo 147.º",
        "Ementa": "(Conflito de atribuições)",
        "Numero": [
            "a) Os prazos são encurtados para metade, com arredondamento por defeito;",
            "b) O autor do primeiro acto é chamado ao processo, na fase da contestação da entidade recorrida e no mesmo prazo, para se pronunciar;",
            "c) Apenas é admissível prova documental;",
            "d) Não são admissíveis alegações."
        ],
        "Titulo": "CAPÍTULO VIII Conflito de jurisdição, competência e atribuições"
    },
    {
        "Artigo": "Artigo 148.º",
        "Ementa": "(Princípio geral)",
        "Numero": [
            "As decisões dos tribunais em processos do contencioso administrativo, incluindo as proferidas no âmbito do processo executivo, são impugnáveis por meio de recursos nos termos previstos no presente capítulo."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 149.º",
        "Ementa": "(Espécies e regime aplicável aos recursos)",
        "Numero": [
            "1. Sem prejuízo do previsto na Secção II do presente capítulo, o recurso ordinário é admitido e processado como o correspondente recurso para o Tribunal de Segunda Instância em processo civil.",
            "2. O recurso com fundamento em oposição de acórdãos é admitido e processado nos termos da Secção III do presente capítulo e, subsidiariamente, nos previstos para o recurso ordinário.",
            "3. Sem prejuízo do previsto na Secção IV do presente capítulo, o recurso de revisão é admitido e processado como o correspondente recurso em processo civil."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 150.º",
        "Ementa": "(Admissibilidade de recurso ordinário)",
        "Numero": [
            "1. Não é admissível recurso ordinário:",
            "a) Das decisões proferidas em acções e sobre pedidos cumulados cujo valor da causa não exceda a alçada dos tribunais;",
            "b) Das decisões que resolvam conflitos de jurisdição, competência e atribuições;",
            "c) Dos acórdãos dos Tribunais de Última e de Segunda Instâncias que decidam em segundo grau de jurisdição.",
            "2. Exceptuam-se do previsto nas alíneas a) e b) do número anterior as hipóteses de admissibilidade de recurso ordinário previstos nos n.os 2 e 3 do artigo 583.º do Código de Processo Civil.",
            "3. Exceptua-se do previsto na alínea c) do n.º 1 o recurso, nos termos estabelecidos no Código de Processo Civil, dos acórdãos do Tribunal de Segunda Instância que decidam, em segundo grau de jurisdição, as acções previstas nas alíneas a), d), e) e f) do artigo 97.º*",
            "4. Quando, por força do disposto na alínea a) do n.º 1, seja interposto recurso ordinário apenas da decisão sobre o pedido principal, a decisão sobre o pedido cumulado fica suspensa até que os autos baixem ao tribunal recorrido para que este proceda em conformidade com o julgado pelo tribunal de recurso.*",
            "5. Baixando os autos, o tribunal mantém ou reformula a decisão sobre o pedido cumulado em conformidade com o julgado no pedido principal.*"
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO II Recurso ordinário"
    },
    {
        "Artigo": "Artigo 151.º",
        "Ementa": "(Legitimidade)",
        "Numero": [
            "1. Podem recorrer a parte ou interveniente no processo que fique vencido, a pessoa directa e efectivamente prejudicada pela decisão e o Ministério Público.",
            "2. Em processo de recurso contencioso, tem ainda legitimidade para impugnar a decisão final de provimento o recorrente que tenha ficado vencido relativamente a fundamento cuja procedência pudesse assegurar tutela mais eficaz dos direitos ou interesses lesados pelo acto recorrido."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO II Recurso ordinário"
    },
    {
        "Artigo": "Artigo 152.º",
        "Ementa": "(Recurso dos acórdãos do Tribunal de Segunda Instância)",
        "Numero": [
            "O recurso dos acórdãos do Tribunal de Segunda Instância apenas pode ter por fundamento a violação ou a errada aplicação de lei substantiva ou processual ou a nulidade da decisão impugnada."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO II Recurso ordinário"
    },
    {
        "Artigo": "Artigo 153.º",
        "Ementa": "(Indeferimento ou retenção do recurso)",
        "Numero": [
            "1. Do despacho do juiz que não admita ou retenha o recurso interposto de decisão do Tribunal Administrativo, cabe reclamação para o presidente do tribunal que fosse competente para dele conhecer.",
            "2. Do despacho do relator que não admita ou retenha o recurso interposto de decisão do Tribunal de Segunda Instância, cabe reclamação para a conferência."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO II Recurso ordinário"
    },
    {
        "Artigo": "Artigo 154.º",
        "Ementa": "(Alegações)",
        "Numero": [
            "Com excepção do disposto para o recurso em processos urgentes, o prazo de apresentação das alegações é de 30 dias contado, para o recorrente, da notificação do despacho de admissão do recurso e, para todos os recorridos, do termo do prazo do recorrente."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO II Recurso ordinário"
    },
    {
        "Artigo": "Artigo 155.º",
        "Ementa": "(Efeitos e regime de subida)",
        "Numero": [
            "1. Sem prejuízo do disposto no número seguinte, o recurso que suba imediatamente tem efeito suspensivo da decisão.",
            "2. O recurso da decisão de suspensão da eficácia de actos administrativos ou de normas e de aplicação de medida compulsória tem efeito meramente devolutivo.",
            "3. Nos processos urgentes, o recurso sobe imediatamente nos próprios autos, quando estejam findos no tribunal recorrido, ou em separado, na hipótese contrária."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO II Recurso ordinário"
    },
    {
        "Artigo": "Artigo 156.º",
        "Ementa": "(Cópia dactilografada da decisão impugnada)",
        "Numero": [
            "O recurso sobe acompanhado, entre outros documentos, de cópia dactilografada e revista da decisão impugnada."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO II Recurso ordinário"
    },
    {
        "Artigo": "Artigo 157.º",
        "Ementa": "(Vista ao Ministério Público)",
        "Numero": [
            "1. Com excepção do disposto para o recurso em processos urgentes, depositados os preparos, quando devidos, e decididas pelo relator, nos termos da lei de processo civil, as questões prévias, o Ministério Público tem vista pelo prazo de 14 dias.",
            "2. O Ministério Público não tem vista quando intervém na posição de recorrente ou de recorrido.",
            "3. Na sua vista, o Ministério Público pode pronunciar-se sobre a decisão do recurso e suscitar questões prévias de conhecimento oficioso não decididas com trânsito em julgado."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO II Recurso ordinário"
    },
    {
        "Artigo": "Artigo 158.º",
        "Ementa": "(Questões prévias)",
        "Numero": [
            "O recorrente é notificado para se pronunciar sobre as questões prévias de conhecimento oficioso que tenham sido suscitadas pelo Ministério Público, na sua vista."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO II Recurso ordinário"
    },
    {
        "Artigo": "Artigo 159.º",
        "Ementa": "(Poderes de cognição do tribunal de recurso)",
        "Numero": [
            "1. Quando o tribunal de recurso julgue que não procede o fundamento que na decisão impugnada determinou o não conhecimento do pedido e nenhum outro motivo obste à decisão sobre o mérito da causa, os autos baixam ao tribunal recorrido para esse efeito.",
            "2. Quando a decisão impugnada seja nula, compete ao tribunal recorrido reformá-la em conformidade com o julgado.",
            "3. No recurso de decisões proferidas em processos urgentes não se aplica o disposto nos números anteriores, devendo o tribunal de recurso decidir, quando possível, sobre o mérito da causa."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO II Recurso ordinário"
    },
    {
        "Artigo": "Artigo 160.º",
        "Ementa": "(Tramitação do recurso em processos urgentes)",
        "Numero": [
            "1. O recurso de decisões proferidas em processos urgentes e interposto mediante requerimento que inclua ou junte a respectiva alegação.",
            "2. O recurso previsto no número anterior é alegado pelos recorridos em prazo igual ao do recorrente contado da notificação do despacho de admissão do recurso.",
            "3. No tribunal de recurso, os autos vão com vista ao Ministério Público por 2 dias e aos juízes-adjuntos por 7 dias, sendo mandados submeter à conferência na sessão imediata."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO II Recurso ordinário"
    },
    {
        "Artigo": "Artigo 161.º",
        "Ementa": "(Pressupostos)",
        "Numero": [
            "1. Excepto quando a solução neles perfilhada esteja de acordo com jurisprudência obrigatória, há lugar a recurso com fundamento em oposição de acórdãos:",
            "a) Do Tribunal de Última Instância, proferidos em primeiro ou segundo graus de jurisdição, que, relativamente à mesma questão fundamental de direito e na ausência de alteração substancial da regulamentação jurídica, perfilhem solução oposta à de acórdão do mesmo Tribunal;",
            "b) Do Tribunal de Segunda Instância, proferidos em segundo grau de jurisdição que, na hipótese prevista na alínea anterior, perfilhem solução oposta à de acórdão desse mesmo Tribunal ou do Tribunal de Última Instância.",
            "2. Há ainda lugar ao recurso previsto no número anterior de decisões do Tribunal de Segunda Instância ou do Tribunal Administrativo, proferidas em primeiro grau de jurisdição, de que não seja admissível recurso ordinário por força do disposto nas alíneas a) e b) do n.º 1 do artigo 150.º, quando, na ausência de jurisprudência obrigatória, perfilhem solução oposta à de acórdão do Tribunal de Última Instância ou do Tribunal de Segunda Instância relativamente à mesma questão fundamental de direito e na ausência de alteração substancial da regulamentação jurídica."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO III Recurso com fundamento em oposição de acórdãos"
    },
    {
        "Artigo": "Artigo 162.º",
        "Ementa": "(Alegação)",
        "Numero": [
            "No requerimento de interposição do recurso, o recorrente identifica o acórdão relativamente ao qual alegue estar em oposição a decisão impugnada e a ele junta documento comprovativo do seu teor e trânsito em julgado e, bem assim, a alegação do recurso relativamente à existência da invocada oposição e ao mérito da causa, com tantos duplicados quantos os recorridos."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO III Recurso com fundamento em oposição de acórdãos"
    },
    {
        "Artigo": "Artigo 163.º",
        "Ementa": "(Despacho liminar)",
        "Numero": [
            "O recurso é liminarmente rejeitado por despacho quando o requerimento não respeite o disposto no artigo anterior ou não se verifiquem os restantes pressupostos processuais."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO III Recurso com fundamento em oposição de acórdãos"
    },
    {
        "Artigo": "Artigo 164.º",
        "Ementa": "(Termos ulteriores)",
        "Numero": [
            "1. Quando o recurso tenha que prosseguir, o recorrido é notificado para apresentar a sua alegação no prazo de 10 dias, o qual corre simultaneamente para todos os recorridos.",
            "2. Junta a alegação do recorrido, ou findo o respectivo prazo, o processo que não se encontre no Tribunal de Última Instância transita para ele.",
            "3. O relator de qualquer acórdão do Tribunal de Última Instância que esteja em oposição não se encontra impedido de exercer a função de juiz-adjunto no julgamento ampliado, não podendo, porém, exercer a de relator."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO III Recurso com fundamento em oposição de acórdãos"
    },
    {
        "Artigo": "Artigo 165.º",
        "Ementa": "(Vista ao Ministério Público)",
        "Numero": [
            "Distribuído o processo para julgamento ampliado, nos termos das leis sobre organização do sistema judiciário, o Ministério Público tem vista para, em 7 dias, emitir parecer, designadamente sobre as questões suscitadas nas alegações."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO III Recurso com fundamento em oposição de acórdãos"
    },
    {
        "Artigo": "Artigo 166.º",
        "Ementa": "(Verificação da oposição)",
        "Numero": [
            "1. O relator decide, no prazo de 10 dias, sobre a existência da invocada oposição de decisões, julgando o recurso findo quando verifique que a oposição não existe.",
            "2. Do despacho do relator que julgue findo o recurso, cabe reclamação para a conferência ampliada.",
            "3. O despacho que julgue verificada a oposição não vincula a conferência ampliada."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO III Recurso com fundamento em oposição de acórdãos"
    },
    {
        "Artigo": "Artigo 167.º",
        "Ementa": "(Decisão final)",
        "Numero": [
            "1. Corridos os vistos legais, é proferida decisão sobre o mérito da causa.",
            "2. Quando a reclamação prevista no n.º 2 do artigo anterior seja atendida, a conferência ampliada conhece imediatamente do mérito da causa.",
            "3. Cada juiz, incluindo o presidente do Tribunal de Última Instância, dispõe de um voto, sendo a decisão tomada por maioria.",
            "4. A decisão de uniformização de jurisprudência é publicada no Boletim Oficial e constitui jurisprudência obrigatória para os tribunais de Macau a partir da publicação.",
            "5. Quando vingue solução diferente da jurisprudência obrigatória anteriormente estabelecida, a nova decisão revoga a anterior e passa a constituir jurisprudência obrigatória.",
            "6. No processo em que o recurso tenha sido interposto, a decisão é eficaz a partir do momento em que tenha sido proferida, devendo o Tribunal de Última Instância julgar o objecto do recurso em conformidade com a jurisprudência nela estabelecida.",
            "7. Quando não se verifique a hipótese prevista no n.º 5, o objecto do recurso, no processo em que tenha sido interposto, é julgado em conformidade com a jurisprudência obrigatória já estabelecida."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO III Recurso com fundamento em oposição de acórdãos"
    },
    {
        "Artigo": "Artigo 168.º",
        "Ementa": "(Relator por vencimento)",
        "Numero": [
            "Quando o relator fique vencido, e sem prejuízo do disposto no n.º 3 do artigo 164.º, o acórdão é relatado por juiz determinado em sorteio a efectuar entre os que tenham feito vencimento."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO III Recurso com fundamento em oposição de acórdãos"
    },
    {
        "Artigo": "Artigo 169.º",
        "Ementa": "(Prazo para a interposição)",
        "Numero": [
            "1. O direito de recurso de revisão caduca decorrido o prazo de 90 dias contado, conforme as hipóteses, desde o trânsito em julgado da decisão em que se funde o pedido de revisão ou desde o momento em que se tenha obtido o documento ou se tenha tido conhecimento do facto que lhe serve de fundamento.",
            "2. Quando a revisão seja pedida pelo Ministério Público, o prazo previsto no número anterior é de 180 dias."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO IV Recurso de revisão"
    },
    {
        "Artigo": "Artigo 170.º",
        "Ementa": "(Legitimidade)",
        "Numero": [
            "Têm legitimidade para pedir a revisão aqueles contra quem tenha sido ou esteja em vias de ser executada a decisão a rever, os que tenham ou, com legitimidade, pudessem ter intervindo no processo em que foi proferida a decisão e o Ministério Público."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO IV Recurso de revisão"
    },
    {
        "Artigo": "Artigo 171.º",
        "Ementa": "(Forma e instrução do requerimento)",
        "Numero": [
            "O requerimento é elaborado com os requisitos e os duplicados exigidos para a petição de recurso contencioso de acto administrativo e instruído com certidão de teor da decisão a rever e com os demais documentos necessários à justificação do pedido."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO IV Recurso de revisão"
    },
    {
        "Artigo": "Artigo 172.º",
        "Ementa": "(Tramitação)",
        "Numero": [
            "1. O requerimento é autuado por apenso ao processo a que respeita e, quando a tal haja lugar, é enviado com este ao tribunal a que seja dirigido o recurso.",
            "2. Ouvido o Ministério Público, o tribunal decide se o recurso deve ou não prosseguir, analisando a sua conformidade com, designadamente, o disposto nos artigos 169.º a 171.º",
            "3. Quando o recurso haja de prosseguir, é ordenada a citação das entidades e dos interessados particulares que, conforme as hipóteses, tenham ou devessem ter sido citados para o processo em que foi proferida a decisão a rever.",
            "4. O processo segue, ulteriormente, os termos previstos para aquele em que foi proferida a decisão a rever."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO IV Recurso de revisão"
    },
    {
        "Artigo": "Artigo 173.º",
        "Ementa": "(Julgamento)",
        "Numero": [
            "1. Julgada de novo a questão, é mantida ou revogada a decisão impugnada.",
            "2. Da decisão cabem os recursos de que fosse susceptível a decisão impugnada."
        ],
        "Titulo": "CAPÍTULO IX Recursos jurisdicionais SECÇÃO IV Recurso de revisão"
    },
    {
        "Artigo": "Artigo 174.º",
        "Ementa": "(Cumprimento espontâneo)",
        "Numero": [
            "1. Excepto quando ocorra falta de verba ou cabimento orçamental ou causa legítima de inexecução, na ausência de normas específicas previstas no presente Código, as decisões dos tribunais em processos do contencioso administrativo, quando transitadas em julgado, devem ser espontaneamente cumpridas pelos órgãos administrativos no prazo máximo de 30 dias.",
            "2. Na ausência de norma específica, o cumprimento deve ser ordenado pelo órgão que tenha praticado o acto recorrido ou, tratando-se de acções ou outro meio processual ou procedimento, pelo principal órgão dirigente da pessoa colectiva pública em causa ou por aquele que tenha ficado concretamente obrigado pela decisão.",
            "3. O cumprimento consiste na prática de todos os actos jurídicos e operações materiais que sejam necessários, conforme as hipóteses, à reintegração efectiva da ordem jurídica violada e à reposição da situação actual hipotética.",
            "4. Quando a entidade recorrida tenha extraído de acto juridicamente inexistente consequências lesivas dos direitos subjectivos ou interesses legalmente protegidos do recorrente, a decisão que declare aquela inexistência é cumprida nos termos do número anterior."
        ],
        "Titulo": "CAPÍTULO X Processo executivo SECÇÃO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 175.º",
        "Ementa": "(Causa legítima de inexecução)",
        "Numero": [
            "1. Apenas constitui causa legítima de inexecução a impossibilidade absoluta e definitiva de execução e o grave prejuízo para o interesse público no cumprimento da decisão.",
            "2. A causa legítima de inexecução pode respeitar a toda a decisão ou a parte dela.",
            "3. A invocação de causa legítima de inexecução deve ser fundamentada e notificada ao interessado, com os respectivos fundamentos, no prazo previsto para cumprimento da decisão.",
            "4. Não pode ser invocada causa legítima de inexecução das decisões cuja execução se traduza no pagamento de quantia certa, nem grave prejuízo para o interesse público no cumprimento das que defiram as seguintes espécies de pedidos:",
            "a) Intimação de órgão administrativo para prestar informação, facultar a consulta de processo ou passar certidão;",
            "b) Suspensão de eficácia dos actos administrativos e das normas;",
            "c) Declaração de ineficácia, para efeitos de suspensão, dos actos de execução indevida;",
            "d) Intimação de órgão administrativo, particular ou concessionário para adoptar ou se abster de certo comportamento;",
            "e) Produção antecipada de prova;",
            "f) Decretamento de providência preventiva ou conservatória não especificada."
        ],
        "Titulo": "CAPÍTULO X Processo executivo SECÇÃO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 176.º",
        "Ementa": "(Execução contra particulares)",
        "Numero": [
            "l. A execução contra particulares para pagamento de quantia certa segue os termos do processo de execução fiscal.",
            "2. As execuções contra particulares para fins diferentes dos previstos no número anterior seguem os termos das correspondentes execuções em processo civil."
        ],
        "Titulo": "CAPÍTULO X Processo executivo SECÇÃO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 177.º",
        "Ementa": "(Execução contra pessoas de direito público)",
        "Numero": [
            "A execução contra uma ou mais pessoas de direito público rege-se pelo disposto nas secções seguintes."
        ],
        "Titulo": "CAPÍTULO X Processo executivo SECÇÃO I Disposições gerais"
    },
    {
        "Artigo": "Artigo 178.º",
        "Ementa": "(Disposição preliminar)",
        "Numero": [
            "1. Quando a execução consista no pagamento de quantia certa, o órgão competente apenas não a ordena quando invoque, fundadamente e no prazo previsto para cumprimento da decisão, falta de verba ou cabimento orçamental.",
            "2. Quando a obrigação do órgão administrativo não seja certa, exigível ou líquida, aplica-se, com as necessárias adaptações, o disposto na lei de processo civil para a fase preliminar da execução."
        ],
        "Titulo": "CAPÍTULO X Processo executivo SECÇÃO II Execução para pagamento de quantia certa"
    },
    {
        "Artigo": "Artigo 179.º",
        "Ementa": "(Falta de verba ou cabimento orçamental)",
        "Numero": [
            "1. No Orçamento Geral é anualmente inscrita uma dotação, à ordem do Conselho Judiciário, afecta ao pagamento de quantias devidas a título de execução de decisões jurisdicionais, a qual corresponde, no mínimo, ao montante acumulado previsto nas decisões proferidas contra órgãos administrativos no ano anterior e respectivos juros de mora.",
            "2. Quando o órgão competente invoque falta de verba ou cabimento orçamental para ordenar a execução ou não a ordene sem qualquer justificação, pode o interessado, no prazo de 365 dias, pedir ao tribunal competente para a execução o pagamento por conta da dotação orçamental prevista no número interior.",
            "3. Deferido o pedido, o tribunal comunica a sua decisão ao Conselho Judiciário, o qual, no prazo de 30 dias, emite a favor do interessado a correspondente ordem de pagamento.",
            "4. Quando o órgão competente para o pagamento de quantia devida a título de execução de decisão jurisdicional seja uma pessoa colectiva pública pertencente à administração indirecta, as quantias pagas por ordem do Conselho Judiciário são descontadas nas transferências a efectuar para aquele órgão no Orçamento Geral do ano seguinte ou, não havendo transferências, são oficiosamente inscritas no orçamento privativo de tal órgão pelo órgão tutelar a quem caiba a aprovação do orçamento.",
            "5. Quando o órgão competente pertença à administração autónoma, procede-se igualmente a desconto nas transferências orçamentais do ano seguinte, devendo o Território, quando não haja transferências, intentar acção de regresso no tribunal competente.",
            "6. Quando a dotação seja insuficiente, o presidente do Conselho Judiciário oficia imediatamente ao Presidente da Assembleia Legislativa e ao Governador no sentido de se promover o seu reforço.",
            "7. Sendo a dotação insuficiente e, 90 dias após a comunicação prevista no n.º 3, assim se mantenha, pode o interessado instaurar, no tribunal competente para a execução, acção executiva contra o órgão administrativo para pagamento de quantia certa, a qual segue os termos da correspondente acção em processo civil."
        ],
        "Titulo": "CAPÍTULO X Processo executivo SECÇÃO II Execução para pagamento de quantia certa"
    },
    {
        "Artigo": "Artigo 180.º",
        "Ementa": "(Requerimento)",
        "Numero": [
            "1. Quando a execução consista na entrega de coisa certa ou na prestação de um facto e o órgão administrativo não cumpra integralmente a decisão no prazo legal, o interessado pode pedir ao tribunal competente a sua execução.",
            "2. O requerimento deve ser apresentado no prazo de 365 dias contado a partir do termo do prazo para o cumprimento espontâneo ou da notificação da invocação de causa legítima de inexecução, e, quando não tenham sido fixados na decisão, especificar os actos e operações em que, no entender do interessado, a execução deve consistir.",
            "3. Quando o órgão administrativo tenha invocado causa legítima de inexecução o interessado deve indicar ainda no requerimento as razões da sua discordância e juntar cópia da notificação daquela invocação.",
            "4. Quando concorde com a invocação de causa legítima de inexecução, o interessado pode pedir, em idêntico prazo, a fixação de indemnização, seguindo-se imediatamente os tramites previstos no artigo 185.º"
        ],
        "Titulo": "CAPÍTULO X Processo executivo SECÇÃO III Execução para entrega de coisa certa ou para prestação de um facto"
    },
    {
        "Artigo": "Artigo 181.º",
        "Ementa": "(Resposta)",
        "Numero": [
            "1. Apresentado o requerimento, que é autuado por apenso ao processo em que foi proferida a decisão, e feito o preparo devido, é ordenada a notificação do órgão administrativo para, no prazo de 10 dias, cumprir a decisão ou responder o que se lhe ofereça sobre o pedido.",
            "2. Na sua resposta, o órgão administrativo pode invocar, pela primeira vez, causa legítima de inexecução e deve fazê-lo quando pretenda manter a invocação que haja previamente feito."
        ],
        "Titulo": "CAPÍTULO X Processo executivo SECÇÃO III Execução para entrega de coisa certa ou para prestação de um facto"
    },
    {
        "Artigo": "Artigo 182.º",
        "Ementa": "(Réplica)",
        "Numero": [
            "1. Quando, na resposta, o órgão administrativo invoque, pela primeira vez, causa legítima de inexecução, o interessado é notificado para, no prazo de 8 dias, replicar.",
            "2. Quando concorde com a invocação de causa legítima de inexecução, o interessado pode pedir, em idêntico prazo, a fixação de indemnização, seguindo-se imediatamente os tramites previstos no artigo 185.º"
        ],
        "Titulo": "CAPÍTULO X Processo executivo SECÇÃO III Execução para entrega de coisa certa ou para prestação de um facto"
    },
    {
        "Artigo": "Artigo 183.º",
        "Ementa": "(Tramitação subsequente)",
        "Numero": [
            "1. Junta a resposta e a réplica, ou findos os respectivos prazos, o tribunal ordena as diligências instrutórias que se mostrem necessárias.",
            "2. Instruído, o processo vai com vista ao Ministério Público por 8 dias.",
            "3. A decisão é proferida no prazo máximo de 8 dias."
        ],
        "Titulo": "CAPÍTULO X Processo executivo SECÇÃO III Execução para entrega de coisa certa ou para prestação de um facto"
    },
    {
        "Artigo": "Artigo 184.º",
        "Ementa": "(Decisão)",
        "Numero": [
            "1. Na decisão, verificada a possibilidade de execução, o tribunal, quando tal tenha sido invocado pelo órgão administrativo, decide se ocorre grave prejuízo para o interesse público no cumprimento da decisão.",
            "2. Quando declare não existir causa legítima de inexecução, ou quando esta não tenha sido invocada, o tribunal, quando não tenham sido fixados na decisão, especifica os actos e operações em que a execução deve consistir e os respectivos prazos, declarando nulos os actos praticados em desconformidade com a anterior decisão.",
            "3. Quando esteja pendente recurso contencioso dos actos previstos na parte final do número anterior, é feita a sua apensação ao processo, previamente à decisão, para efeitos da declaração de nulidade.",
            "4. Quando o tribunal declare a existência de causa legítima de inexecução, o interessado pode pedir, até ao trânsito em julgado da decisão, a fixação de indemnização."
        ],
        "Titulo": "CAPÍTULO X Processo executivo SECÇÃO III Execução para entrega de coisa certa ou para prestação de um facto"
    },
    {
        "Artigo": "Artigo 185.º",
        "Ementa": "(Fixação de indemnização quando se verifique causa legítima de inexecução)",
        "Numero": [
            "1. Pedida a fixação de indemnização com fundamento em incumprimento da decisão por causa legítima de inexecução, o tribunal ordena a notificação do órgão administrativo e do interessado para, no prazo de 15 dias, acordarem no respectivo montante.",
            "2. O prazo previsto no número anterior pode ser prorrogado quando haja fundadas expectativas de que o acordo se venha a concretizar em momento próximo.",
            "3. Quando não haja lugar a acordo, é aplicável, com as necessárias adaptações, o disposto no artigo 183.º",
            "4. O processo finda quando, entretanto, tenha sido proposta acção de indemnização com o mesmo objecto ou o tribunal para ela remeta as partes por considerar a matéria de complexa indagação.",
            "5. Quando o órgão administrativo não ordene o pagamento devido no prazo de 30 dias contado do acordo ou da notificação da decisão que o fixe, seguem-se os termos do processo executivo para pagamento de quantia certa."
        ],
        "Titulo": "CAPÍTULO X Processo executivo SECÇÃO III Execução para entrega de coisa certa ou para prestação de um facto"
    },
    {
        "Artigo": "Artigo 186.º",
        "Ementa": "(Medida compulsória para obter a execução)",
        "Numero": [
            "1. Quando, por qualquer forma, o tribunal competente para a execução tome conhecimento de que a decisão não foi espontaneamente cumprida, pode aplicar uma medida compulsória ao titular do órgão administrativo competente para ordenar o seu cumprimento.",
            "2. A medida compulsória consiste na responsabilização pessoal do seu destinatário pela entrega, por cada dia de atraso no cumprimento da decisão, de uma quantia cujo montante varia entre 10 e 50% do montante correspondente ao índice 100 da tabela indiciária de vencimentos dos trabalhadores da Administração Pública.",
            "3. Quando o órgão administrativo competente para ordenar o cumprimento da decisão seja colegial, a medida compulsória não é aplicada aos membros que tenham votado a favor daquele cumprimento pontual e tenham feito registar em acta esse voto, nem àqueles que, encontrando-se ausentes da votação, tenham comunicado por escrito ao presidente a sua vontade no sentido do cumprimento.",
            "4. Quando a execução consista no pagamento de quantia certa, a medida compulsória pode ser aplicada desde o termo do prazo para cumprimento espontâneo da decisão sem que tenha havido invocação de falta de verba ou cabimento orçamental.",
            "5. Quando a execução consista na entrega de coisa certa ou na prestação de um facto, a medida compulsória pode ser aplicada:",
            "a) Desde o termo do prazo para cumprimento espontâneo da decisão sem que tenha havido invocação de causa legítima de inexecução; e",
            "b) Tenha ou não havido invocação de causa legítima de inexecução, desde o trânsito em julgado da decisão proferida em processo executivo, ou naquele pelo qual as partes tenham optado ou para o qual tenham sido remetidas pelo tribunal competente para a execução, quando tal decisão tenha verificado a possibilidade de execução da anterior decisão ou tenha fixado indemnização.",
            "6. Quando a execução consista no pagamento de quantia certa, a medida compulsória cessa com a invocação de falta de verba ou cabimento orçamental ou com a emissão pelo Conselho Judiciário da respectiva ordem de pagamento.",
            "7. Quando a execução consista na entrega de coisa certa ou na prestação de um facto, a medida compulsória cessa:",
            "a) Com a invocação, antes ou no decurso do processo executivo, de causa legítima de inexecução;",
            "b) Com o trânsito em julgado da decisão proferida em processo executivo, ou naquele pelo qual as partes tenham optado ou para o qual tenham sido remetidas pelo tribunal competente para a execução, quando tal decisão tenha declarado a impossibilidade de execução da anterior decisão e não tenha fixado qualquer indemnização;",
            "c) Com o cumprimento de decisão que tenha verificado a possibilidade de execução ou tenha fixado indemnização; ou",
            "d) Quando a decisão prevista na alínea b) tenha fixado indemnização, com os fundamentos previstos no número anterior.",
            "8. A medida compulsória cessa ainda quando o cumprimento da decisão não possa ser ordenado pelo seu destinatário em virtude de suspensão ou cessação das respectivas funções.",
            "9. Antes da aplicação da medida o tribunal ouve, pelo prazo de 8 dias, o titular do órgão administrativo competente.",
            "10. A decisão de aplicação da medida fixa o seu montante diário, indica a data a partir da qual produz efeitos, especifica os nomes dos seus destinatários e é-lhes imediatamente notificada.",
            "11. A liquidação global das quantias devidas a título de medida compulsória é efectuada pelo tribunal após a cessação."
        ],
        "Titulo": "CAPÍTULO X Processo executivo SECÇÃO IV Garantias contra a inexecução ilícita"
    },
    {
        "Artigo": "Artigo 187.º",
        "Ementa": "(Inexecução ilícita das decisões dos tribunais em processos do contencioso administrativo)",
        "Numero": [
            "1. Excepto quando ocorra falta de verba ou cabimento orçamental ou, por concordância do interessado ou declaração do tribunal, seja verificada a existência de causa legítima, a inexecução de decisão proferida por um tribunal em processo do contencioso administrativo transitada em julgado constitui facto ilícito e produz os seguintes efeitos:",
            "a) Qualquer acto que desrespeite a decisão ou cuja execução conduza a idêntico resultado é nulo;",
            "b) A pessoa de direito público em causa e os titulares dos seus órgãos, funcionários, agentes ou representantes a quem o facto seja imputável são solidariamente responsáveis pelos prejuízos causados ao interessado;",
            "c) Os titulares dos órgãos, funcionários, agentes e representantes responsáveis pelo facto ilícito incorrem em responsabilidade disciplinar nos termos do respectivo estatuto.",
            "2. Constitui crime de desobediência:",
            "a) O facto de o titular do órgão competente para a execução actuar com intenção de não dar cumprimento à decisão nos termos fixados pelo tribunal, sem invocação, conforme as hipóteses, de falta de verba ou cabimento orçamental ou de causa legítima de inexecução;",
            "b) O não agendamento da questão pelo presidente do órgão colegial.",
            "3. À fixação de indemnização para os efeitos do disposto na alínea b) do n.º 1 é aplicável o regime previsto no artigo 185.º"
        ],
        "Titulo": "CAPÍTULO X Processo executivo SECÇÃO IV Garantias contra a inexecução ilícita"
    }
]