[
    {
        "Artigo": "Artigo 1.º",
        "Ementa": "(Definição)",
        "Numero": [
            "1. Entende-se por procedimento administrativo a sucessão ordenada de actos e formalidades tendentes à formação e manifestação da vontade da Administração Pública, ou à sua execução.",
            "2. Entende-se por processo administrativo o conjunto de documentos em que se traduzem os actos e formalidades que integram o procedimento administrativo."
        ],
        "Titulo": "PARTE I Princípios gerais CAPÍTULO I Disposições preliminares"
    },
    {
        "Artigo": "Artigo 2.º",
        "Ementa": "(Âmbito de aplicação)",
        "Numero": [
            "1. As disposições deste Código aplicam-se a todos os órgãos da Administração Pública que, no desempenho da actividade administrativa de gestão pública, estabeleçam relações com os particulares, bem como aos actos em matéria administrativa praticados pelos órgãos do Território que, embora não integrados na Administração Pública, desenvolvam funções materialmente administrativas.",
            "2. As disposições deste Código são ainda aplicáveis aos actos praticados por entidades concessionárias no exercício de poderes de autoridade.",
            "3. Os preceitos deste Código podem ser mandados aplicar por lei à actuação dos órgãos das instituições particulares de interesse público.",
            "4. Os princípios gerais da actividade administrativa definidos no presente Código são aplicáveis a toda a actuação da Administração, ainda que meramente técnica ou de gestão privada.",
            "5. As disposições deste Código relativas à organização e à actividade administrativas são aplicáveis a todas as actuações da Administração no domínio da gestão pública.",
            "6. As disposições do presente Código são ainda supletivamente aplicáveis a procedimentos especiais, desde que não envolvam diminuição das garantias dos particulares."
        ],
        "Titulo": "PARTE I Princípios gerais CAPÍTULO I Disposições preliminares"
    },
    {
        "Artigo": "Artigo 3.º",
        "Ementa": "(Princípio da legalidade)",
        "Numero": [
            "1. Os órgãos da Administração Pública devem actuar em obediência à lei e ao direito, dentro dos limites dos poderes que lhes estejam atribuídos e em conformidade com os fins para que os mesmos poderes lhes forem conferidos.",
            "2. Os actos administrativos praticados em estado de necessidade, com preterição das regras estabelecidas neste Código, são válidos, desde que os seus resultados não pudessem ter sido alcançados de outro modo, mas os lesados têm o direito de ser indemnizados nos termos gerais da responsabilidade da Administração."
        ],
        "Titulo": "PARTE I Princípios gerais CAPÍTULO II Princípios gerais"
    },
    {
        "Artigo": "Artigo 4.º",
        "Ementa": "(Princípio da prossecução do interesse público e da protecção dos direitos e interesses dos residentes)",
        "Numero": [
            "Compete aos órgãos administrativos prosseguir o interesse público, no respeito pelos direitos e interesses legalmente protegidos dos residentes."
        ],
        "Titulo": "PARTE I Princípios gerais CAPÍTULO II Princípios gerais"
    },
    {
        "Artigo": "Artigo 5.º",
        "Ementa": "(Princípio da igualdade e da proporcionalidade)",
        "Numero": [
            "1. Nas suas relações com os particulares, a Administração Pública deve reger-se pelo princípio da igualdade, não podendo privilegiar, beneficiar, prejudicar, privar de qualquer direito ou isentar de qualquer dever nenhum administrado em razão de ascendência, sexo, raça, língua, território de origem, religião, convicções políticas ou ideológicas, instrução, situação económica ou condição social.",
            "2. As decisões da Administração que colidam com direitos subjectivos ou interesses legalmente protegidos dos particulares só podem afectar essas posições em termos adequados e proporcionais aos objectivos a realizar."
        ],
        "Titulo": "PARTE I Princípios gerais CAPÍTULO II Princípios gerais"
    },
    {
        "Artigo": "Artigo 6.º",
        "Ementa": "(Princípio da utilização das línguas oficiais)",
        "Numero": [
            "As línguas oficiais de Macau serão utilizadas pelos órgãos da Administração Pública, no exercício da sua actividade."
        ],
        "Titulo": "PARTE I Princípios gerais CAPÍTULO II Princípios gerais"
    },
    {
        "Artigo": "Artigo 7.º",
        "Ementa": "(Princípio da justiça e da imparcialidade)",
        "Numero": [
            "No exercício da sua actividade, a Administração Pública deve tratar de forma justa e imparcial todos os que com ela entrem em relação."
        ],
        "Titulo": "PARTE I Princípios gerais CAPÍTULO II Princípios gerais"
    },
    {
        "Artigo": "Artigo 8.º",
        "Ementa": "(Princípio da boa fé)",
        "Numero": [
            "1. No exercício da actividade administrativa, e em todas as suas formas e fases, a Administração Pública e os particulares devem agir e relacionar-se segundo as regras da boa fé.",
            "2. No cumprimento do disposto no número anterior, devem ponderar-se os valores fundamentais do direito, relevantes em face das situações consideradas e, em especial:",
            "a) Da confiança suscitada na contraparte pela actuação em causa;",
            "b) Do objectivo a alcançar com a actuação empreendida."
        ],
        "Titulo": "PARTE I Princípios gerais CAPÍTULO II Princípios gerais"
    },
    {
        "Artigo": "Artigo 9.º",
        "Ementa": "(Princípio da colaboração entre a Administração e os particulares)",
        "Numero": [
            "1. Os órgãos da Administração Pública e os particulares devem actuar em estreita cooperação recíproca, devendo designadamente:",
            "a) Prestar as informações e os esclarecimentos solicitados, desde que não tenham carácter confidencial ou de reserva pessoal;",
            "b) Apoiar e estimular todas as iniciativas socialmente úteis.",
            "2. A Administração Pública é responsável pelas informações prestadas por escrito aos particulares, ainda que não obrigatórias."
        ],
        "Titulo": "PARTE I Princípios gerais CAPÍTULO II Princípios gerais"
    },
    {
        "Artigo": "Artigo 10.º",
        "Ementa": "(Princípio da participação)",
        "Numero": [
            "Os órgãos da Administração Pública devem assegurar a participação dos particulares, bem como das associações que tenham por objecto a defesa dos seus interesses, na formação das decisões que lhes disserem respeito, designadamente através da respectiva audiência, nos termos deste Código."
        ],
        "Titulo": "PARTE I Princípios gerais CAPÍTULO II Princípios gerais"
    },
    {
        "Artigo": "Artigo 11.º",
        "Ementa": "(Princípio da decisão)",
        "Numero": [
            "1. Os órgãos administrativos têm o dever de se pronunciar sobre todos os assuntos da sua competência que lhes sejam apresentados pelos particulares, e nomeadamente:",
            "a) Sobre os assuntos que lhes disserem directamente respeito;",
            "b) Sobre quaisquer petições, representações, queixas, reclamações ou recursos formulados em defesa da legalidade ou do interesse geral.",
            "2. Não existe o dever de decisão quando, há menos de dois anos contados desde a prática do acto até à data da apresentação do requerimento, o órgão competente tenha praticado um acto administrativo sobre o mesmo pedido formulado pelo mesmo particular com os mesmos fundamentos."
        ],
        "Titulo": "PARTE I Princípios gerais CAPÍTULO II Princípios gerais"
    },
    {
        "Artigo": "Artigo 12.º",
        "Ementa": "(Princípio da desburocratização e da eficiência)",
        "Numero": [
            "A Administração Pública deve ser estruturada e funcionar de modo a aproximar os serviços das populações e de forma não burocratizada, a fim de assegurar a celeridade, a economia e a eficiência das suas decisões."
        ],
        "Titulo": "PARTE I Princípios gerais CAPÍTULO II Princípios gerais"
    },
    {
        "Artigo": "Artigo 13.º",
        "Ementa": "(Princípio da gratuitidade)",
        "Numero": [
            "1. O procedimento administrativo é gratuito, salvo na parte em que leis especiais impuserem o pagamento de taxas ou de despesas efectuadas pela Administração.",
            "2. Em caso de comprovada insuficiência económica, a Administração isenta o interessado do pagamento das taxas ou dos custos referidos no número anterior.",
            "3. A insuficiência económica pode ser provada por qualquer idóneo, designadamente:",
            "a) Atestado da situação económica emitido pelo órgão da administração competente em matéria de acção social;",
            "b) Certidão comprovativa de que o requerente se encontra a cargo da assistência pública.",
            "4. Os documentos a que se refere o número anterior devem mencionar expressamente que se destinam a instruir um pedido de isenção de taxas ou custos administrativos."
        ],
        "Titulo": "PARTE I Princípios gerais CAPÍTULO II Princípios gerais"
    },
    {
        "Artigo": "Artigo 14.º",
        "Ementa": "(Princípio do acesso à justiça)",
        "Numero": [
            "Aos particulares é garantido o acesso aos tribunais com jurisdição administrativa, a fim de obterem a fiscalização contenciosa dos actos da Administração, bem como para tutela dos seus direitos ou interesses legalmente protegidos, nos termos previstos na legislação reguladora do contencioso administrativo."
        ],
        "Titulo": "PARTE I Princípios gerais CAPÍTULO II Princípios gerais"
    },
    {
        "Artigo": "Artigo 15.º",
        "Ementa": "(Órgãos da Administração Pública)",
        "Numero": [
            "a) Os órgãos que exerçam funções administrativas;",
            "b) Os órgãos dos institutos públicos e das associações públicas."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO I Generalidades"
    },
    {
        "Artigo": "Artigo 16.º",
        "Ementa": "(Presidente e secretário)",
        "Numero": [
            "1. Sempre que a lei não disponha de forma diferente, cada órgão administrativo colegial tem um presidente e um secretário, a eleger pelos membros que o compõem.",
            "2. Compete ao presidente do órgão colegial, além de outras funções que lhe sejam atribuídas, abrir e encerrar as reuniões, dirigir os trabalhos e assegurar o cumprimento das leis e a regularidade das deliberações.",
            "3. O presidente pode, ainda, suspender ou encerrar antecipadamente as reuniões, quando circunstâncias excepcionais o justifiquem, mediante decisão fundamentada, a incluir na acta da reunião."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO II Órgãos colegiais"
    },
    {
        "Artigo": "Artigo 17.º",
        "Ementa": "(Substituição do presidente e secretário)",
        "Numero": [
            "1. Salvo disposição legal em contrário, o presidente e o secretário de qualquer órgão colegial são substituídos, respectivamente, pelo vogal mais antigo e pelo vogal mais moderno.",
            "2. No caso de os vogais possuírem a mesma antiguidade, a substituição faz-se, respectivamente, pelo vogal de mais idade e pelo mais jovem."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO II Órgãos colegiais"
    },
    {
        "Artigo": "Artigo 18.º",
        "Ementa": "(Reuniões ordinárias)",
        "Numero": [
            "1. Na falta de determinação legal ou de deliberação do órgão, compete ao presidente a fixação dos dias e horas das reuniões ordinárias.",
            "2. Quaisquer alterações ao dia e hora fixados para as reuniões devem ser comunicadas a todos os membros do órgão colegial, de forma a garantir o seu conhecimento seguro e oportuno."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO II Órgãos colegiais"
    },
    {
        "Artigo": "Artigo 19.º",
        "Ementa": "(Reuniões extraordinárias)",
        "Numero": [
            "1. As reuniões extraordinárias têm lugar mediante convocação do presidente, salvo disposição especial.",
            "2. O presidente é obrigado a proceder à convocação sempre que, pelo menos, um terço dos vogais lho solicitem por escrito, indicando o assunto que desejam ver tratado.",
            "3. A convocatória da reunião deve ser feita para um dos quinze dias seguintes à apresentação do pedido, mas sempre com uma antecedência mínima de 48 horas.",
            "4. Da convocatória devem constar, de forma expressa e especificada, os assuntos a tratar na reunião."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO II Órgãos colegiais"
    },
    {
        "Artigo": "Artigo 20.º",
        "Ementa": "(Ordem do dia)",
        "Numero": [
            "1. A ordem do dia de cada reunião é estabelecida pelo presidente que, salvo disposição especial, deve incluir nela os assuntos que para esse fim lhe forem indicados por qualquer vogal, desde que sejam da competência do órgão e o pedido seja apresentado por escrito com uma antecedência mínima de cinco dias.",
            "2. A ordem do dia deve ser entregue a todos os membros com a antecedência de, pelo menos, 48 horas."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO II Órgãos colegiais"
    },
    {
        "Artigo": "Artigo 21.º",
        "Ementa": "(Objecto das deliberações)",
        "Numero": [
            "Só podem ser objecto de deliberação os assuntos incluídos na ordem do dia da reunião, salvo se, tratando-se de reunião ordinária, pelo menos dois terços dos membros reconhecerem a urgência de deliberação imediata sobre outros assuntos."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO II Órgãos colegiais"
    },
    {
        "Artigo": "Artigo 22.º",
        "Ementa": "(Reuniões públicas)",
        "Numero": [
            "1. As reuniões dos órgãos administrativos não são públicas, salvo disposição da lei em contrário.",
            "2. Quando as reuniões hajam de ser públicas, deve ser dada publicidade aos dias, horas e locais da sua realização, de forma a garantir o conhecimento dos interessados com uma antecedência de, pelo menos, 48 horas."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO II Órgãos colegiais"
    },
    {
        "Artigo": "Artigo 23.º",
        "Ementa": "(Inobservância das disposições sobre convocação de reuniões)",
        "Numero": [
            "A ilegalidade resultante da inobservância das disposições sobre a convocação de reuniões só se considera sanada quando todos os membros do órgão compareçam à reunião e não suscitem oposição à sua realização."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO II Órgãos colegiais"
    },
    {
        "Artigo": "Artigo 24.º",
        "Ementa": "(Quórum)",
        "Numero": [
            "1. Os órgãos colegiais só podem funcionar e deliberar em primeira convocação quando esteja presente a maioria do número legal dos seus membros com direito de voto.",
            "2. Sempre que a lei não disponha de forma diferente, não comparecendo o número de membros exigido, é convocada nova reunião, com o intervalo de, pelo menos, 24 horas, podendo o órgão funcionar e deliberar desde que estejam presentes um terço dos membros com direito de voto, em número não inferior a três, o que deve constar expressamente da convocatória."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO II Órgãos colegiais"
    },
    {
        "Artigo": "Artigo 25.º",
        "Ementa": "(Obrigatoriedade de voto)",
        "Numero": [
            "No silêncio da lei, é proibida a abstenção a todos os membros dos órgãos colegiais consultivos que estejam presentes à reunião e não se encontrem impedidos de intervir."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO II Órgãos colegiais"
    },
    {
        "Artigo": "Artigo 26.º",
        "Ementa": "(Formas de votação)",
        "Numero": [
            "1. Salvo disposição legal em contrário, as deliberações são tomadas por votação nominal, devendo votar primeiramente os vogais e, por fim, o presidente.",
            "2. São tomadas por escrutínio secreto as deliberações que envolvam a apreciação do comportamento ou das qualidades de qualquer pessoa.",
            "3. Em caso de dúvida sobre a qualificação das deliberações referidas no número anterior, o órgão colegial delibera sobre a forma de votação.",
            "4. Quando exigida, a fundamentação das deliberações tomadas por escrutínio secreto deve ser feita pelo presidente do órgão colegial após a votação, tendo presente a discussão que a tiver precedido.",
            "5. Não podem estar presentes no momento da discussão nem da votação os membros dos órgãos colegiais que se encontrem ou se considerem impedidos."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO II Órgãos colegiais"
    },
    {
        "Artigo": "Artigo 27.º",
        "Ementa": "(Maioria exigível nas deliberações)",
        "Numero": [
            "1. As deliberações são tomadas por maioria absoluta de votos dos membros presentes à reunião, salvo nos casos em que, por disposição legal, se exija maioria qualificada ou seja suficiente maioria relativa.",
            "2. Se for exigível maioria absoluta e esta se não formar, nem se verificar empate, procede-se imediatamente a nova votação e, se aquela situação se mantiver, adia-se a deliberação para a reunião seguinte, na qual é suficiente a maioria relativa."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO II Órgãos colegiais"
    },
    {
        "Artigo": "Artigo 28.º",
        "Ementa": "(Empate na votação)",
        "Numero": [
            "1. Em caso de empate na votação, o presidente tem voto de qualidade, salvo se a votação se tiver efectuado por escrutínio secreto.",
            "2. Havendo empate em votação por escrutínio secreto, procede-se imediatamente a nova votação e, se o empate se mantiver, adia-se a deliberação para a reunião seguinte; se na primeira votação dessa reunião se mantiver o empate, procede-se a votação nominal."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO II Órgãos colegiais"
    },
    {
        "Artigo": "Artigo 29.º",
        "Ementa": "(Acta da reunião)",
        "Numero": [
            "1. De cada reunião é lavrada acta, que deve conter um resumo de tudo o que nela tiver ocorrido, indicando, designadamente, a data e o local da reunião, os membros presentes, os assuntos apreciados, as deliberações tomadas e a forma e o resultado das respectivas votações.",
            "2. As actas são lavradas pelo secretário e postas à aprovação de todos os membros no final da respectiva reunião ou no início da seguinte, sendo assinadas, após a aprovação, pelo presidente e pelo secretário.",
            "3. Nos casos em que o órgão assim o delibere, a acta é aprovada, em minuta, logo na reunião a que disser respeito.",
            "4. As deliberações dos órgãos colegiais só podem adquirir eficácia depois de aprovadas as respectivas actas ou depois de assinadas as minutas, nos termos do número anterior."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO II Órgãos colegiais"
    },
    {
        "Artigo": "Artigo 30.º",
        "Ementa": "(Registo na acta do voto de vencido)",
        "Numero": [
            "1. Os membros do órgão colegial podem fazer constar da acta o seu voto de vencido e as razões que o justificam.",
            "2. Aqueles que ficarem vencidos na deliberação tomada e fizerem registo da respectiva declaração de voto na acta ficam isentos da responsabilidade que daquela eventualmente resulte.",
            "3. Quando se trate de pareceres a dar a outros órgãos administrativos, as deliberações são sempre acompanhadas das declarações de voto apresentadas."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO II Órgãos colegiais"
    },
    {
        "Artigo": "Artigo 31.º",
        "Ementa": "(Irrenunciabilidade e inalienabilidade)",
        "Numero": [
            "1. A competência é definida por lei ou por regulamento e é irrenunciável e inalienável, sem prejuízo do disposto quanto à delegação de poderes e à substituição.",
            "2. É nulo todo o acto ou contrato que tenha por objecto a renúncia à titularidade ou ao exercício da competência conferida aos órgãos administrativos, sem prejuízo da delegação de poderes e figuras afins."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO III Competência"
    },
    {
        "Artigo": "Artigo 32.º",
        "Ementa": "(Fixação da competência)",
        "Numero": [
            "1. A competência fixa-se no momento em que se inicia o procedimento, sendo irrelevantes as modificações de facto que ocorram posteriormente, salvo o disposto no n.º 3.",
            "2. São igualmente irrelevantes as modificações de direito, excepto se for extinto o órgão a que o procedimento estava afecto, se deixar de ser competente ou se lhe for atribuída a competência de que inicialmente carecesse.",
            "3. Quando o órgão territorialmente competente passar a ser outro, deve o processo ser-lhe remetido."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO III Competência"
    },
    {
        "Artigo": "Artigo 33.º",
        "Ementa": "(Questões prejudiciais)",
        "Numero": [
            "1. Se a decisão final depender da decisão de uma questão que seja da competência de outro órgão administrativo ou dos tribunais, deve o órgão competente para a decisão final suspender o procedimento administrativo até que o órgão ou o tribunal competente se pronunciem, salvo se da não resolução imediata do assunto resultarem graves prejuízos.",
            "2. A suspensão cessa:",
            "a) Quando, dependendo a decisão da questão prejudicial da formulação de pedido pelo interessado, o mesmo não o apresentar perante o órgão administrativo ou o tribunal competente, dentro dos trinta dias seguintes à notificação da suspensão;",
            "b) Quando o procedimento ou o processo instaurado para conhecimento da questão prejudicial estiver parado, por culpa do interessado, por mais de trinta dias;",
            "c) Quando, por circunstâncias supervenientes, a falta de resolução imediata do assunto causar graves prejuízos.",
            "3. Se não for declarada a suspensão ou esta cessar, o órgão administrativo conhece das questões prejudiciais, mas a respectiva decisão não produz quaisquer efeitos fora do procedimento em que for proferida."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO III Competência"
    },
    {
        "Artigo": "Artigo 34.º",
        "Ementa": "(Conflitos de competência territorial)",
        "Numero": [
            "Em caso de dúvida sobre a competência territorial, a entidade que decidir o conflito designa como competente o órgão cuja localização oferecer maiores vantagens para a boa resolução do assunto."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO III Competência"
    },
    {
        "Artigo": "Artigo 35.º",
        "Ementa": "(Controlo de competência)",
        "Numero": [
            "1. Antes de qualquer decisão, o órgão administrativo deve certificar-se de que é competente para conhecer da questão.",
            "2. A incompetência deve ser suscitada oficiosamente pelo órgão administrativo e pode ser arguida pelos interessados."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO III Competência"
    },
    {
        "Artigo": "Artigo 36.º",
        "Ementa": "(Apresentação de requerimento a órgão incompetente)",
        "Numero": [
            "1. Quando o particular, por erro desculpável e dentro do prazo fixado, dirigir requerimento, petição, reclamação ou recurso a órgão incompetente, o respectivo documento é oficiosamente remetido ao órgão competente, de tal se notificando o particular.",
            "2. Em caso de erro indesculpável, o requerimento, petição, reclamação ou recurso não é apreciado, de tal se notificando o particular em prazo não superior a quarenta e oito horas.",
            "3. Da qualificação do erro cabe reclamação e recurso, nos termos gerais."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO III Competência"
    },
    {
        "Artigo": "Artigo 37.º",
        "Ementa": "(Delegação de poderes)",
        "Numero": [
            "1. Os órgãos administrativos normalmente competentes para decidir em determinada matéria podem, sempre que para tal estejam habilitados por lei, permitir, através de um acto de delegação de poderes, que outro órgão ou agente pratique actos administrativos sobre a mesma matéria.",
            "2. Mediante um acto de delegação de poderes, os órgãos administrativos competentes para decidir em determinada matéria podem sempre permitir, independentemente de lei de habilitação, que o seu imediato inferior hierárquico, adjunto ou substituto pratiquem actos de administração ordinária nessa matéria.",
            "3. O disposto no número anterior vale igualmente para a delegação de poderes dos órgãos colegiais nos respectivos presidentes, salvo havendo lei de habilitação específica que estabeleça uma particular repartição de competências entre os diversos órgãos."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO IV Delegação de poderes e substituição"
    },
    {
        "Artigo": "Artigo 38.º",
        "Ementa": "(Subdelegação de poderes)",
        "Numero": [
            "Salvo disposição legal em contrário, o delegante pode autorizar o delegado a subdelegar."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO IV Delegação de poderes e substituição"
    },
    {
        "Artigo": "Artigo 39.º",
        "Ementa": "(Requisitos do acto de delegação)",
        "Numero": [
            "1. No acto de delegação ou subdelegação, deve o órgão delegante ou subdelegante especificar os poderes que são delegados ou subdelegados ou quais os actos que o delegado ou subdelegado pode praticar.",
            "2. Os actos de delegação e subdelegação de poderes estão sujeitos a publicação no Boletim Oficial de Macau, e, tratando-se de órgãos municipais, devem ser também afixados nos lugares do estilo."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO IV Delegação de poderes e substituição"
    },
    {
        "Artigo": "Artigo 40.º",
        "Ementa": "(Menção da qualidade de delegado ou subdelegado)",
        "Numero": [
            "O órgão delegado ou subdelegado deve mencionar essa qualidade no uso da delegação ou subdelegação."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO IV Delegação de poderes e substituição"
    },
    {
        "Artigo": "Artigo 41.º",
        "Ementa": "(Poderes do delegante ou do subdelegante)",
        "Numero": [
            "1. O órgão delegante ou subdelegante pode emitir directivas ou instruções vinculativas para o delegado ou subdelegado sobre o modo como devem ser exercidos os poderes delegados ou subdelegados.",
            "2. O órgão delegante ou subdelegante tem o poder de avocar, bem como o poder de revogar os actos praticados pelo delegado ou subdelegado, nos termos do disposto no n.º 2 do artigo 131.º"
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO IV Delegação de poderes e substituição"
    },
    {
        "Artigo": "Artigo 42.º",
        "Ementa": "(Extinção da delegação ou subdelegação)",
        "Numero": [
            "a) Por revogação do acto de delegação ou subdelegação;",
            "b) Por caducidade, resultante de se terem esgotado os seus efeitos ou da mudança dos titulares dos órgãos delegante ou delegado, subdelegante ou subdelegado."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO IV Delegação de poderes e substituição"
    },
    {
        "Artigo": "Artigo 43.º",
        "Ementa": "(Substituição)",
        "Numero": [
            "1. Salvo o disposto em lei especial, nos casos de ausência, falta ou impedimento do titular do cargo, a sua substituição cabe ao substituto legal ou, na sua falta, ao órgão ou agente designado pelo substituído.",
            "2. O exercício de funções em substituição abrange os poderes delegados ou subdelegados no substituído."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO IV Delegação de poderes e substituição"
    },
    {
        "Artigo": "Artigo 44.º",
        "Ementa": "(Competência para a resolução dos conflitos)",
        "Numero": [
            "1. Os conflitos de jurisdição entre os órgãos da Administração e um Tribunal são resolvidos pelo tribunal competente, nos termos da lei.",
            "2. Os conflitos de atribuições são resolvidos pelos tribunais administrativos, mediante recurso contencioso, quando envolvam órgãos de pessoas colectivas diferentes.",
            "3. Os conflitos de competência são resolvidos pelo órgão de menor categoria hierárquica que exercer poderes de supervisão sobre os órgãos envolvidos."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO V Conflitos de jurisdição, de atribuições e de competência"
    },
    {
        "Artigo": "Artigo 45.º",
        "Ementa": "(Resolução administrativa dos conflitos)",
        "Numero": [
            "1. A resolução dos conflitos de competência pode ser solicitada por qualquer interessado, mediante requerimento fundamentado dirigido à entidade competente para a decisão do procedimento, e deve ser oficiosamente suscitada pelos órgãos em conflito, logo que dele tenham conhecimento.",
            "2. O órgão competente para a resolução deve ouvir os órgãos em conflito, se estes ainda não se tiverem pronunciado, e proferir a decisão no prazo de trinta dias."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO V Conflitos de jurisdição, de atribuições e de competência"
    },
    {
        "Artigo": "Artigo 46.º",
        "Ementa": "(Casos de impedimento)",
        "Numero": [
            "1. Nenhum titular de órgão ou agente da Administração Pública pode intervir em procedimento administrativo, ou em acto ou contrato de direito público ou privado da Administração, nos casos seguintes:",
            "a) Quando nele tenha interesse, por si, como representante ou como gestor de negócios de outra pessoa;",
            "b) Quando, por si, ou como representante de outra pessoa, nele tenha interesse o seu cônjuge, algum parente ou afim em linha recta ou até ao 2.º grau da linha colateral, bem como qualquer pessoa com quem viva em economia comum;",
            "c) Quando, por si, ou como representante de outra pessoa, tenha interesse em questão semelhante à que deva ser decidida, ou quando tal situação se verifique em relação à pessoa abrangida pela alínea anterior;",
            "d) Quando tenha intervindo no procedimento como perito ou mandatário ou haja dado parecer sobre questão a resolver;",
            "e) Quando tenha actuado no procedimento como perito ou mandatário o seu cônjuge, parente ou afim em linha recta ou até ao 2.º grau da linha colateral, bem como qualquer pessoa com quem viva em economia comum;",
            "f) Quando contra ele, seu cônjuge ou parente em linha recta esteja intentada acção judicial proposta por interessado ou pelo respectivo cônjuge;",
            "g) Quando se trate de recurso de decisão proferida por si, ou com a sua intervenção, ou proferida por qualquer das pessoas referidas na alínea b) ou com intervenção destas;",
            "h) Quando se trate de questão relativa a um particular que seja membro de uma associação de defesa de interesses económicos ou afins, da qual também faça parte o titular do órgão ou agente.",
            "2. Excluem-se do disposto no número anterior as intervenções que se traduzam em actos de mero expediente, designadamente actos certificativos."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO VI Garantias de imparcialidade"
    },
    {
        "Artigo": "Artigo 47.º",
        "Ementa": "(Arguição e declaração do impedimento)",
        "Numero": [
            "1. Quando se verifique causa de impedimento em relação a qualquer titular de órgão ou agente administrativo, deve o mesmo comunicar desde logo o facto ao respectivo superior hierárquico ou ao presidente do órgão colegial dirigente, consoante os casos.",
            "2. Até ser proferida a decisão definitiva ou praticado o acto, qualquer interessado pode requerer a declaração do impedimento, especificando as circunstâncias de facto que constituem a sua causa.",
            "3. Compete ao superior hierárquico e ao presidente do órgão colegial conhecer da existência do impedimento e declará-lo, ouvindo, se considerar necessário, o titular do órgão ou agente.",
            "4. Tratando-se de impedimento do presidente do órgão colegial, a decisão do incidente compete ao próprio órgão, sem intervenção do presidente."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO VI Garantias de imparcialidade"
    },
    {
        "Artigo": "Artigo 48.º",
        "Ementa": "(Efeitos da arguição do impedimento)",
        "Numero": [
            "1. O titular do órgão ou agente deve suspender a sua actividade no procedimento logo que faça a comunicação a que se refere o n.º 1 do artigo anterior ou tenha conhecimento do requerimento a que se refere o n.º 2 do mesmo preceito, até à decisão do incidente, salvo ordem em contrário do respectivo superior hierárquico.",
            "2. Os impedidos nos termos do n.º 1 do artigo 46.º devem tomar as medidas que forem inadiáveis em caso de urgência ou de perigo, as quais devem ser ratificadas pela entidade que os substituir."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO VI Garantias de imparcialidade"
    },
    {
        "Artigo": "Artigo 49.º",
        "Ementa": "(Efeitos da declaração do impedimento)",
        "Numero": [
            "1. Declarado o impedimento do titular do órgão ou agente, é o mesmo substituído no procedimento pelo respectivo substituto legal, salvo se o superior hierárquico daquele resolver avocar a questão.",
            "2. Tratando-se de órgão colegial, se não houver ou não puder ser designado substituto, o órgão funciona sem o membro impedido."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO VI Garantias de imparcialidade"
    },
    {
        "Artigo": "Artigo 50.º",
        "Ementa": "(Fundamento da escusa e suspeição)",
        "Numero": [
            "1. O titular de órgão ou agente deve pedir dispensa de intervir no procedimento quando ocorra circunstância pela qual possa razoavelmente suspeitar-se da sua isenção ou da rectidão da sua conduta, e designadamente:",
            "a) Quando, por si ou como representante de outra pessoa, nele tenha interesse parente ou afim em linha recta ou até ao 3.º grau da linha colateral, ou tutelado ou curatelado dele ou do seu cônjuge;",
            "b) Quando o titular do órgão ou agente ou o seu cônjuge, ou algum parente ou afim na linha recta, for credor ou devedor de pessoa singular ou colectiva com interesse directo no procedimento, acto ou contrato;",
            "c) Quando tenha havido lugar ao recebimento de dádivas, antes ou depois de iniciado o procedimento, pelo titular do órgão ou agente, seu cônjuge, parente ou afim em linha recta;",
            "d) Se houver inimizade grave ou grande intimidade entre o titular do órgão ou agente, ou o seu cônjuge e a pessoa com interesse directo no procedimento, acto ou contrato.",
            "2. Com fundamento semelhante e até ser proferida decisão definitiva, pode qualquer interessado opor suspeição a titulares de órgãos ou agentes que intervenham no procedimento, acto ou contrato."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO VI Garantias de imparcialidade"
    },
    {
        "Artigo": "Artigo 51.º",
        "Ementa": "(Formulação do pedido)",
        "Numero": [
            "1. Nos casos previstos no artigo anterior, o pedido deve ser dirigido à entidade competente para dele conhecer, indicando com precisão os factos que o justifiquem.",
            "2. O pedido do titular do órgão ou agente só é formulado por escrito quando assim for determinado pela entidade a quem for dirigido.",
            "3. Quando o pedido for formulado por interessados no procedimento, acto ou contrato, é sempre ouvido o titular do órgão ou o agente visado."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO VI Garantias de imparcialidade"
    },
    {
        "Artigo": "Artigo 52.º",
        "Ementa": "(Decisão sobre a escusa ou suspeição)",
        "Numero": [
            "1. A competência para decidir da escusa ou suspeição defere-se nos termos referidos nos n.os 3 e 4 do artigo 47.º",
            "2. A decisão é proferida no prazo de três dias.",
            "3. Reconhecida procedência ao pedido, observa-se o disposto nos artigos 48.º e 49.º"
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO VI Garantias de imparcialidade"
    },
    {
        "Artigo": "Artigo 53.º",
        "Ementa": "(Sanção)",
        "Numero": [
            "1. Os actos ou contratos em que tiverem intervindo titulares dos órgãos ou agentes impedidos são anuláveis nos termos gerais, salvo se outra sanção estiver especialmente prevista.",
            "2. A omissão do dever de comunicação a que alude o artigo 47.º, n.º 1, constitui falta grave para efeitos disciplinares."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO I Órgãos da Administração Pública SECÇÃO VI Garantias de imparcialidade"
    },
    {
        "Artigo": "Artigo 54.º",
        "Ementa": "(Intervenção no procedimento administrativo)",
        "Numero": [
            "1. Todos os particulares têm o direito de intervir pessoalmente no procedimento administrativo ou de nele se fazer representar ou assistir, incluindo por meio de advogado ou solicitador.",
            "2. A capacidade de intervenção no procedimento, salvo disposição especial, tem por base e por medida a capacidade de exercício de direitos segundo a lei civil, a qual é também aplicável ao suprimento da incapacidade."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO II Interessados"
    },
    {
        "Artigo": "Artigo 55.º",
        "Ementa": "(Legitimidade)",
        "Numero": [
            "1. Têm legitimidade para iniciar o procedimento administrativo e para intervir nele os titulares de direitos subjectivos ou interesses legalmente protegidos lesados pela actuação administrativa, bem como as associações que tenham por fim a defesa desses interesses.",
            "2. Consideram-se, ainda, dotados de legitimidade para a protecção de interesses difusos:",
            "a) Os cidadãos a quem a actuação administrativa provoque ou possa previsivelmente provocar prejuízos relevantes em bens fundamentais como a saúde pública, a habitação, a educação, o património cultural, o ambiente, o ordenamento do território e a qualidade de vida;",
            "b) Os residentes na circunscrição em que se localize algum bem do domínio público afectado pela acção da Administração.",
            "3. Para defender os interesses difusos de que sejam titulares os residentes em determinada circunscrição têm legitimidade as associações dedicadas à defesa de tais interesses e os órgãos municipais da respectiva área."
        ],
        "Titulo": "PARTE II Sujeitos CAPÍTULO II Interessados"
    },
    {
        "Artigo": "Artigo 56.º",
        "Ementa": "(Língua a empregar no procedimento)",
        "Numero": [
            "1. No procedimento administrativo pode ser usada qualquer uma das línguas oficiais.",
            "2. São sempre garantidos aos interessados, quando hajam de iniciar ou de intervir no procedimento, os direitos de se exprimirem, oralmente ou por escrito, na língua oficial da sua escolha, e, bem assim, de, nessa mesma língua, receberem resposta, de lhes ser facultada versão dos documentos a que tenham acesso e de serem notificados dos actos praticados no procedimento.",
            "3. A inobservancia do disposto no número anterior não afecta a validade ou eficácia da decisão final do procedimento se os interessados tiverem compreendido claramente o sentido dos actos e formalidades aí previstos."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO I Princípios gerais"
    },
    {
        "Artigo": "Artigo 57.º",
        "Ementa": "(Iniciativa)",
        "Numero": [
            "O procedimento administrativo começa por iniciativa da Administração ou a requerimento dos interessados."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO I Princípios gerais"
    },
    {
        "Artigo": "Artigo 58.º",
        "Ementa": "(Comunicação aos interessados)",
        "Numero": [
            "1. O começo do procedimento por iniciativa da Administração é comunicado às pessoas cujos direitos ou interesses legalmente protegidos possam ser lesados pelos actos a praticar no procedimento e que possam ser desde logo nominalmente identificadas.",
            "2. Não há lugar à comunicação determinada no número anterior nos casos em que a lei a dispense e naqueles em que a mesma possa prejudicar a natureza secreta ou confidencial da matéria, como tal classificada nos termos legais, ou a oportuna adopção das providências a que o procedimento se destina.",
            "3. A comunicação deve indicar a entidade que ordenou o início do procedimento, a data em que o mesmo se iniciou, o serviço por onde o mesmo corre e o respectivo objecto."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO I Princípios gerais"
    },
    {
        "Artigo": "Artigo 59.º",
        "Ementa": "(Poderes da Administração)",
        "Numero": [
            "Os órgãos administrativos, mesmo que o procedimento seja instaurado por iniciativa dos interessados, podem proceder às diligências que considerem convenientes para a instrução, ainda que sobre matérias não mencionadas nos requerimentos ou nas respostas dos interessados, e decidir coisa diferente ou mais ampla do que a pedida, quando o interesse púbico assim o exigir."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO I Princípios gerais"
    },
    {
        "Artigo": "Artigo 60.º",
        "Ementa": "(Dever de celeridade)",
        "Numero": [
            "Os órgãos administrativos devem providenciar pelo rápido e eficaz andamento do procedimento, quer recusando e evitando tudo o que for impertinente ou dilatório, quer ordenando e promovendo tudo o que for necessário ao seguimento do procedimento e à justa e oportuna decisão."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO I Princípios gerais"
    },
    {
        "Artigo": "Artigo 61.º",
        "Ementa": "(Prazo geral para a conclusão)",
        "Numero": [
            "1. O procedimento deve ser concluído no prazo de noventa dias, salvo se outro prazo decorrer da lei ou for imposto por circunstâncias excepcionais.",
            "2. O prazo previsto no n.º 1 pode ser prorrogado, por um ou mais períodos, até ao limite de mais noventa dias, mediante autorização do dirigente máximo do serviço ou do órgão colegial competente, tendo em conta nomeadamente a complexidade do procedimento ou a necessidade de fazer intervir outras entidades.",
            "3. A inobservância dos prazos a que se referem os números anteriores deve ser justificada pelo órgão responsável, perante o dirigente máximo do serviço ou perante o órgão colegial competente, dentro dos cinco dias seguintes ao termo dos mesmos prazos.",
            "4. Os interessados devem ser informados, no prazo de dez dias, da justificação para a não conclusão do procedimento nos prazos legais e, quando previsível, da data em que a resolução definitiva é tomada."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO I Princípios gerais"
    },
    {
        "Artigo": "Artigo 62.º",
        "Ementa": "(Deveres gerais dos interessados)",
        "Numero": [
            "1. Os interessados têm o dever de não formular pretensões ilegais, não articular factos contrários à verdade, nem requerer diligências meramente dilatórias.",
            "2. Os interessados têm também o dever de prestar a sua colaboração para o conveniente esclarecimento dos factos e a descoberta da verdade."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO I Princípios gerais"
    },
    {
        "Artigo": "Artigo 63.º",
        "Ementa": "(Direito dos interessados à informação)",
        "Numero": [
            "1. Os particulares têm o direito de ser informados pela Administração, sempre que o requeiram, sobre o andamento dos procedimentos em que sejam directamente interessados, bem como o direito de conhecer as resoluções definitivas que sobre eles forem tomadas.",
            "2. As informações a prestar abrangem a indicação do serviço onde o processo se encontra, os actos e diligências praticados, as deficiências a suprir pelos interessados, as decisões adoptadas e quaisquer outros elementos solicitados.",
            "3. Não podem ser prestadas informações sobre peças ou elementos:",
            "a) Que, nos termos legais, estejam classificados como secretos ou confidenciais, enquanto essa classificação não for retirada pela entidade competente;",
            "b) Cujo conhecimento pelos interessados possa comprometer o fim principal do procedimento ou direitos fundamentais de outras pessoas.",
            "4. As informações solicitadas ao abrigo deste artigo devem ser fornecidas no prazo máximo de dez dias úteis.",
            "5. A recusa da prestação de informações é sempre fundamentada e, se o interessado o solicitar, formulada por escrito."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO II Direito à informação"
    },
    {
        "Artigo": "Artigo 64.º",
        "Ementa": "(Consulta do processo e passagem de certidões)",
        "Numero": [
            "1. Os interessados têm o direito de consultar o processo que não contenha documentos classificados, ou que revelem segredo comercial ou industrial ou segredo relativo à propriedade literária, artística ou científica.",
            "2. Os interessados têm o direito, mediante o pagamento das importâncias que forem devidas, de obter certidão, reprodução ou declaração autenticada dos documentos que constem dos processos a que tenham acesso."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO II Direito à informação"
    },
    {
        "Artigo": "Artigo 65.º",
        "Ementa": "(Certidões independentes de despacho)",
        "Numero": [
            "1. Os funcionários competentes são obrigados a passar aos interessados, independentemente de despacho, e no prazo de dez dias úteis a contar da apresentação do respectivo requerimento, certidão, reprodução ou declaração autenticada de que constem, consoante o pedido, todos ou alguns dos seguintes elementos:",
            "a) Data de apresentação de requerimentos ou documentos semelhantes;",
            "b) Conteúdo desses documentos ou pretensão neles formulada;",
            "c) Andamento que tiveram ou situação em que se encontram;",
            "d) Resolução tomada ou falta de resolução.",
            "2. O dever estabelecido no número anterior não abrange os documentos classificados ou que revelem segredo comercial ou industrial ou segredo relativo a propriedade literária, artística ou científica."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO II Direito à informação"
    },
    {
        "Artigo": "Artigo 66.º",
        "Ementa": "(Extensão do direito de informação)",
        "Numero": [
            "1. Os direitos reconhecidos nos artigos 63.º a 65.º são extensivos a quaisquer pessoas que provem ter interesse legítimo no conhecimento dos elementos que pretendam.",
            "2. O exercício dos direitos previstos no número anterior depende de despacho do dirigente do serviço, exarado em requerimento escrito, instruído com os documentos probatórios do interesse legítimo invocado."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO II Direito à informação"
    },
    {
        "Artigo": "Artigo 67.º",
        "Ementa": "(Princípio da administração aberta)",
        "Numero": [
            "1. Os particulares têm direito de acesso aos arquivos e registos administrativos, mesmo que não se encontre em curso qualquer procedimento que lhes diga directamente respeito.",
            "2. O direito de acesso aos documentos nominativos é reservado à pessoa a quem os dados digam respeito e a terceiros que demonstrem interesse directo e pessoal.",
            "3. O acesso aos arquivos e registos administrativos pode ser recusado, mediante decisão fundamentada, em matérias relativas à segurança do Território, à investigação criminal e à intimidade das pessoas.",
            "4. O acesso aos arquivos e registos administrativos faz-se em regra mediante a passagem de certidões ou fotocópias autenticadas dos elementos que os integram, sendo possível a consulta directa dos documentos arquivados ou registados quando a lei a permita ou quando o órgão competente a autorize.",
            "5. A consulta directa ou a passagem de certidões ou fotocópias, quando permitidas ou autorizadas, devem ser asseguradas aos interessados no prazo máximo de dez dias úteis."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO II Direito à informação"
    },
    {
        "Artigo": "Artigo 68.º",
        "Ementa": "(Dever de notificar)",
        "Numero": [
            "a) Decidam sobre quaisquer pretensões por eles formuladas;",
            "b) Imponham deveres, sujeições ou sanções, ou causem prejuízos;",
            "c) Criem, extingam, aumentem ou diminuam direitos ou interesses legalmente protegidos, ou afectem as condições do seu exercício."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO III Notificações"
    },
    {
        "Artigo": "Artigo 69.º",
        "Ementa": "(Dispensa de notificações)",
        "Numero": [
            "1. É dispensada a notificação dos actos nos casos seguintes:",
            "a) Quando sejam praticados oralmente na presença dos interessados;",
            "b) Quando o interessado, através de qualquer intervenção no procedimento, revele perfeito conhecimento do conteúdo dos actos em causa.",
            "2. Nos casos previstos no número anterior, os prazos cuja contagem se devesse iniciar com a notificação começam a correr no dia seguinte ao da prática oral do acto ou no dia seguinte àquele em que ocorrer a intervenção do interessado no procedimento."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO III Notificações"
    },
    {
        "Artigo": "Artigo 70.º",
        "Ementa": "(Conteúdo da notificação)",
        "Numero": [
            "a) O texto integral do acto administrativo;",
            "b) A identificação do procedimento administrativo, incluindo a indicação do autor do acto e a data deste;",
            "c) O órgão competente para apreciar a impugnação do acto e o prazo para esse efeito;",
            "d) A indicação de o acto ser ou não susceptível de recurso contencioso."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO III Notificações"
    },
    {
        "Artigo": "Artigo 71.º",
        "Ementa": "(Prazo das notificações)",
        "Numero": [
            "Quando não exista prazo especialmente fixado, os actos administrativos devem ser notificados no prazo de oito dias."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO III Notificações"
    },
    {
        "Artigo": "Artigo 72.º",
        "Ementa": "(Forma das notificações)",
        "Numero": [
            "1. As notificações devem ser feitas pessoalmente ou por ofício, telegrama, telex, telefax, ou por telefone, consoante as possibilidades e as conveniências.",
            "2. Se qualquer das referidas formas de notificação pessoal se revelar impossível ou ainda se os interessados a notificar forem desconhecidos ou em número tal que inviabilize essas formas de notificação, é feita notificação edital, afixando-se editais nos locais de estilo e publicando-se anúncios em dois dos jornais mais lidos do Território, um em língua portuguesa, outro em língua chinesa.",
            "3. Sempre que a notificação seja feita por telefone, é a mesma confirmada por uma das outras formas previstas no n.º 1, no dia útil imediato, sem prejuízo de a notificação se considerar feita na data da primeira comunicação."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO III Notificações"
    },
    {
        "Artigo": "Artigo 73.º",
        "Ementa": "(Prazo geral)",
        "Numero": [
            "1. Na falta de disposição especial ou de fixação pela Administração, o prazo para os actos a praticar pelos órgãos administrativos é de quinze dias.",
            "2. É igualmente de quinze dias o prazo para os interessados requererem ou praticarem quaisquer actos, promoverem diligências, responderem sobre os assuntos acerca dos quais se devam pronunciar ou exercerem outros poderes no procedimento."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO IV Prazos e dilações"
    },
    {
        "Artigo": "Artigo 74.º",
        "Ementa": "(Contagem dos prazos)",
        "Numero": [
            "a) Não se inclui na contagem o dia em que ocorreu o evento a partir do qual o prazo começa a correr;",
            "b) O prazo é contínuo e começa a correr independentemente de quaisquer formalidades;",
            "c) O termo do prazo que caia em dia em que o serviço não esteja aberto ao público, ou não funcione durante o período normal, transfere-se para o primeiro dia útil seguinte."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO IV Prazos e dilações"
    },
    {
        "Artigo": "Artigo 75.º",
        "Ementa": "(Dilação)",
        "Numero": [
            "a) Dez dias, se os interessados residirem ou se encontrarem em outras regiões da República Popular da China;",
            "b) Vinte dias, se os interessados residirem ou se encontrarem noutro país asiático;",
            "c) Trinta dias, se os interessados residirem ou se encontrarem em país fora da Ásia."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO IV Prazos e dilações"
    },
    {
        "Artigo": "Artigo 76.º",
        "Ementa": "(Requerimento inicial)",
        "Numero": [
            "1. Salvo nos casos em que a lei admite o pedido verbal, o requerimento inicial dos interessados deve ser formulado por escrito e conter:",
            "a) A designação do órgão administrativo a que se dirige;",
            "b) A identificação do requerente, pela indicação do nome, estado, profissão e residência;",
            "c) A exposição dos factos em que se baseia o pedido e, quando tal seja possível ao requerente, os respectivos fundamentos de direito;",
            "d) A indicação do pedido, em termos claros e precisos;",
            "e) A data e a assinatura do requerente, ou de outrem, a seu rogo, se o mesmo não souber ou não puder assinar.",
            "2. Em cada requerimento não pode ser formulado mais de um pedido, salvo se se tratar de pedidos alternativos ou subsidiários."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO I Início"
    },
    {
        "Artigo": "Artigo 77.º",
        "Ementa": "(Formulação verbal do requerimento)",
        "Numero": [
            "Quando a lei admita a formulação verbal do requerimento, é lavrado termo para esse efeito, o qual deve conter as menções a que se referem as alíneas a) a d) do n.º 1 do artigo anterior e ser assinado, depois de datado pelo requerente e pelo agente que receba o pedido."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO I Início"
    },
    {
        "Artigo": "Artigo 78.º",
        "Ementa": "(Deficiência do requerimento inicial)",
        "Numero": [
            "1. Se o requerimento inicial não satisfazer o disposto no artigo 76.º, o requerente é convidado a suprir as deficiências existentes que o órgão administrativo identificar como tal.",
            "2. Sem prejuízo do disposto no número anterior, devem os órgãos e agentes administrativos procurar suprir as deficiências dos requerimentos de modo a evitar que os interessados sofram prejuízos por virtude de simples irregularidades ou de mera imperfeição na formulação dos seus pedidos.",
            "3. São liminarmente indeferidos os requerimentos que não contenham a identificação do requerente e aqueles cujo pedido, após convite para aclaramento, se mantenha ininteligível."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO I Início"
    },
    {
        "Artigo": "Artigo 79.º",
        "Ementa": "(Apresentação dos requerimentos)",
        "Numero": [
            "1. Os requerimentos devem ser apresentados aos serviços dos órgãos a que são dirigidos.",
            "2. Salvo disposição em contrário, os requerimentos dirigidos a órgãos administrativos podem ser remetidos pelo correio."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO I Início"
    },
    {
        "Artigo": "Artigo 80.º",
        "Ementa": "(Registo de apresentação de requerimento)",
        "Numero": [
            "1. A apresentação de requerimentos, qualquer que seja o modo por que se efectue, é sempre objecto de registo, que deve mencionar o respectivo número de ordem, a data, o objecto do requerimento, o número de documentos juntos e o nome do requerente.",
            "2. Os requerimentos são registados segundo a ordem da sua apresentação, considerando-se simultaneamente apresentados os recebidos pelo correio na mesma distribuição.",
            "3. O registo é anotado nos requerimentos, mediante a menção do respectivo número e data, com a rubrica do agente que a ele procedeu."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO I Início"
    },
    {
        "Artigo": "Artigo 81.º",
        "Ementa": "(Recibo da entrega de requerimentos)",
        "Numero": [
            "1. Os interessados podem exigir recibo comprovativo da entrega dos requerimentos apresentados.",
            "2. O recibo pode ser passado em duplicado ou em fotocópia do requerimento que o requerente apresente para esse fim."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO I Início"
    },
    {
        "Artigo": "Artigo 82.º",
        "Ementa": "(Questões que prejudiquem o procedimento)",
        "Numero": [
            "1. O órgão administrativo, logo que estejam apurados os elementos necessários, pode conhecer de qualquer questão que prejudique o desenvolvimento normal do procedimento ou impeça a tomada de decisão sobre o seu objecto e, nomeadamente, das seguintes questões:",
            "a) A incompetência do órgão administrativo;",
            "b) A caducidade do direito que se pretende exercer;",
            "c) A ilegitimidade dos requerentes;",
            "d) A extemporaneidade do pedido.",
            "2. Quando o órgão administrativo entenda que qualquer das questões enunciadas no número anterior é susceptível de obstar ao conhecimento do objecto do procedimento, o interessado deve ser informado sobre o sentido previsível da decisão e seus fundamentos e pode pronunciar-se sobre a questão no prazo de dez dias."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO I Início"
    },
    {
        "Artigo": "Artigo 83.º",
        "Ementa": "(Admissibilidade de medidas provisórias)",
        "Numero": [
            "1. Em qualquer fase do procedimento pode o órgão competente para a decisão final, por sua iniciativa ou a requerimento dos interessados, ordenar as medidas provisórias que se mostrem necessárias, se houver justo receio de, sem tais medidas, se produzir lesão grave ou de difícil reparação dos interesses públicos em causa.",
            "2. A decisão de ordenar ou alterar qualquer medida provisória deve ser fundamentada e fixar prazo para a sua validade.",
            "3. A revogação das medidas provisórias também deve ser fundamentada.",
            "4. O recurso hierárquico necessário interposto de decisão que ordene qualquer medida provisória não suspende a sua eficácia, salvo quando o órgão competente o determine."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO II Medidas provisórias"
    },
    {
        "Artigo": "Artigo 84.º",
        "Ementa": "(Caducidade das medidas provisórias)",
        "Numero": [
            "a) Logo que seja proferida decisão definitiva no procedimento;",
            "b) Quando decorrer o prazo que lhes tiver sido fixado, ou a respectiva prorrogação;",
            "c) Se decorrer o prazo fixado na lei para a decisão final;",
            "d) Se, não estando estabelecido tal prazo, a decisão final não for proferida dentro dos seis meses seguintes ao início do procedimento."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO II Medidas provisórias"
    },
    {
        "Artigo": "Artigo 85.º",
        "Ementa": "(Direcção da instrução)",
        "Numero": [
            "1. A direcção da instrução cabe ao órgão competente para a decisão, salvo o disposto nos diplomas orgânicos dos serviços públicos ou em preceitos especiais.",
            "2. O órgão competente para a decisão pode delegar a competência para a direcção da instrução em subordinado seu, excepto nos casos em que a lei imponha a sua direcção pessoal.",
            "3. O órgão competente para dirigir a instrução pode encarregar subordinado seu da realização de diligências instrutórias específicas.",
            "4. Nos órgãos colegiais, as delegações previstas no n.º 2 podem ser conferidas a membros do órgão ou a agente dele dependente."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO III Instrução"
    },
    {
        "Artigo": "Artigo 86.º",
        "Ementa": "(Factos sujeitos a prova)",
        "Numero": [
            "1. O órgão competente deve procurar averiguar todos os factos cujo conhecimento seja conveniente para a justa e rápida decisão do procedimento, podendo, para o efeito, recorrer a todos os meios de prova admitidos em direito.",
            "2. Não carecem de prova nem de alegação os factos notórios bem como os factos de que o órgão competente tenha conhecimento em virtude do exercício das suas funções.",
            "3. O órgão competente deve fazer constar do procedimento os factos de que tenha conhecimento em virtude do exercício das suas competências."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO III Instrução"
    },
    {
        "Artigo": "Artigo 87.º",
        "Ementa": "(Ónus da prova)",
        "Numero": [
            "1. Cabe aos interessados provar os factos que tenham alegado, sem prejuízo do dever cometido ao órgão competente nos termos do n.º 1 do artigo anterior.",
            "2. Os interessados podem juntar documentos e pareceres ou requerer diligências de prova úteis para o esclarecimento dos factos com interesse para a decisão."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO III Instrução"
    },
    {
        "Artigo": "Artigo 88.º",
        "Ementa": "(Solicitação de provas aos interessados)",
        "Numero": [
            "1. O órgão que dirigir a instrução pode determinar aos interessados a prestação de informações e a colaboração noutros meios de prova.",
            "2. Quando seja necessária a prestação de informações ou a apresentação de provas pelos interessados, são estes notificados para o fazerem, por escrito ou oralmente, no prazo e condições que forem fixados.",
            "3. É legítima a recusa às determinações previstas no número anterior, quando a obediência às mesmas:",
            "a) Envolver a violação de segredo profissional;",
            "b) Implicar o esclarecimento de factos cuja revelação esteja proibida ou dispensada por lei;",
            "c) Importar a revelação de factos puníveis, praticados pelo próprio interessado, pelo seu cônjuge ou por seu ascendente ou descendente, irmão, ou afim nos mesmos graus;",
            "d) For susceptível de causar dano moral ou material ao próprio interessado ou a alguma das pessoas referidas na alínea anterior."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO III Instrução"
    },
    {
        "Artigo": "Artigo 89.º",
        "Ementa": "(Produção antecipada de prova)",
        "Numero": [
            "1. Havendo justo receio de vir a tornar-se impossível ou de difícil realização a produção de qualquer prova com interesse para a decisão, pode o órgão competente, oficiosamente ou a pedido fundamentado dos interessados, proceder à sua recolha antecipada.",
            "2. A produção antecipada de prova pode ter lugar antes da instauração do procedimento."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO III Instrução"
    },
    {
        "Artigo": "Artigo 90.º",
        "Ementa": "(Realização de exames e outras diligências)",
        "Numero": [
            "1. Quando seja necessário proceder a exames, vistorias ou outras diligências semelhantes que não possam ser directamente realizadas por serviços públicos, o órgão que dirigir a instrução pode nomear peritos.",
            "2. Quando sejam nomeados peritos, de acordo com o previsto no número anterior, podem os interessados indicar os seus em número igual ao da Administração e formular quesitos ou indicar pontos para aqueles se pronunciarem.",
            "3. O órgão que dirigir a instrução pode excluir do objecto da diligência os quesitos ou pontos indicados pelos interessados que não se mostrem necessários à decisão ou tenham por objecto matéria de carácter secreto ou confidencial."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO III Instrução"
    },
    {
        "Artigo": "Artigo 91.º",
        "Ementa": "(Espécies de pareceres)",
        "Numero": [
            "1. Os pareceres são obrigatórios ou facultativos, consoante sejam ou não exigidos por lei; e são vinculativos ou não vinculativos, conforme as respectivas conclusões tenham ou não de ser seguidas pelo órgão competente para a decisão.",
            "2. Salvo disposição expressa em contrário, os pareceres referidos na lei consideram-se obrigatórios e não vinculativos."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO III Instrução"
    },
    {
        "Artigo": "Artigo 92.º",
        "Ementa": "(Forma e prazo dos pareceres)",
        "Numero": [
            "1. Os pareceres devem ser sempre fundamentados e concluir de modo expresso e claro sobre todas as questões indicadas na consulta.",
            "2. Na falta de disposição especial, os pareceres são emitidos no prazo de trinta dias, excepto quando o órgão competente para a instrução fixar, fundamentadamente, prazo diferente.",
            "3. Quando um parecer obrigatório e não vinculativo não for emitido dentro dos prazos previstos no número anterior, pode o procedimento prosseguir e vir a ser decidido sem o parecer, salvo disposição legal expressa em contrário."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO III Instrução"
    },
    {
        "Artigo": "Artigo 93.º",
        "Ementa": "(Audiência dos interessados)",
        "Numero": [
            "1. Salvo o disposto nos artigos 96.º e 97.º, concluída a instrução, os interessados têm o direito de ser ouvidos no procedimento antes de ser tomada a decisão final, devendo ser informados, nomeadamente, sobre o sentido provável desta.",
            "2. O órgão instrutor decide, em cada caso, se a audiência dos interessados é escrita ou oral.",
            "3. A realização da audiência dos interessados suspende a contagem de prazos em todos os procedimentos administrativos."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO III Instrução"
    },
    {
        "Artigo": "Artigo 94.º",
        "Ementa": "(Audiência escrita)",
        "Numero": [
            "1. Quando o órgão instrutor optar pela audiência escrita, notifica os interessados para, em prazo não inferior a dez dias, dizerem o que se lhes oferecer.",
            "2. A notificação fornece os elementos necessários para que os interessados fiquem a conhecer todos os aspectos relevantes para a decisão, nas matérias de facto e de direito, indicando também as horas e o local onde o processo pode ser consultado.",
            "3. Na resposta, os interessados podem pronunciar-se sobre as questões que constituem objecto do procedimento, bem como requerer diligências complementares e juntar documentos."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO III Instrução"
    },
    {
        "Artigo": "Artigo 95.º",
        "Ementa": "(Audiência oral)",
        "Numero": [
            "1. Se o órgão instrutor optar pela audiência oral, ordena a convocação dos interessados com a antecedência de, pelo menos, oito dias.",
            "2. Na audiência oral podem ser apreciadas todas as questões com interesse para a decisão, nas matérias de facto e de direito.",
            "3. A falta de comparência dos interessados não constitui motivo de adiamento da audiência, mas, se for apresentada justificação da falta até ao momento fixado para a audiência, deve proceder-se ao adiamento desta.",
            "4. Da audiência é lavrada acta, da qual consta o extracto das alegações feitas pelos interessados, podendo estes juntar quaisquer alegações escritas, durante a diligência ou posteriormente."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO III Instrução"
    },
    {
        "Artigo": "Artigo 96.º",
        "Ementa": "(Inexistência de audiência dos interessados)",
        "Numero": [
            "a) Quando a decisão seja urgente;",
            "b) Quando seja razoavelmente de prever que a diligência possa comprometer a execução ou a utilidade da decisão;",
            "c) Quando o número de interessados a ouvir seja de tal forma elevado que a audiência se torne impraticável, devendo nesse caso proceder-se a consulta pública, quando possível, pela forma mais adequada."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO III Instrução"
    },
    {
        "Artigo": "Artigo 97.º",
        "Ementa": "(Dispensa de audiência dos interessados)",
        "Numero": [
            "a) Se os interessados já se tiverem pronunciado no procedimento sobre as questões que importem à decisão e sobre as provas produzidas;",
            "b) Se os elementos constantes do procedimento conduzirem a uma decisão favorável aos interessados."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO III Instrução"
    },
    {
        "Artigo": "Artigo 98.º",
        "Ementa": "(Relatório do instrutor)",
        "Numero": [
            "Quando o órgão instrutor não for o órgão competente para a decisão final, elabora um relatório no qual indica o pedido do interessado, resume o conteúdo do procedimento e formula uma proposta de decisão, sintetizando as razões de facto e de direito que a justificam."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO III Instrução"
    },
    {
        "Artigo": "Artigo 99.º",
        "Ementa": "(Causas de extinção)",
        "Numero": [
            "O procedimento extingue-se pela tomada da decisão final, bem como por qualquer dos outros factos previstos nesta secção."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO IV Decisão e outras causas de extinção"
    },
    {
        "Artigo": "Artigo 100.º",
        "Ementa": "(Decisão final expressa)",
        "Numero": [
            "Na decisão final expressa, o órgão competente deve resolver todas as questões pertinentes suscitadas durante o procedimento e que não hajam sido decididas em momento anterior."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO IV Decisão e outras causas de extinção"
    },
    {
        "Artigo": "Artigo 101.º",
        "Ementa": "(Deferimento tácito)",
        "Numero": [
            "1. Se a decisão não for proferida no prazo estabelecido por lei, as autorizações ou aprovações solicitadas apenas se consideram concedidas nos casos em que leis especiais prevejam o deferimento tácito.",
            "2. Quando a lei não fixar prazo especial, o prazo de produção do deferimento tácito é de noventa dias a contar da formulação do pedido ou da apresentação do processo para esse efeito.",
            "3. Os prazos previstos nos números anteriores suspendem-se sempre que o procedimento estiver parado por motivo imputável ao interessado."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO IV Decisão e outras causas de extinção"
    },
    {
        "Artigo": "Artigo 102.º",
        "Ementa": "(Indeferimento tácito)",
        "Numero": [
            "1. Sem prejuízo do disposto no artigo anterior, a falta, no prazo fixado para a sua emissão, de decisão final sobre pretensão dirigida a órgão administrativo competente confere ao interessado, salvo disposição em contrário, a faculdade de presumir indeferida essa pretensão, para poder exercer o respectivo meio legal de impugnação.",
            "2. O prazo a que se refere o número anterior é, salvo o disposto em lei especial, de noventa dias.",
            "3. Os prazos referidos no número anterior contam-se, na falta de disposição especial:",
            "a) Da data da entrada do requerimento ou petição no serviço competente, quando a lei não imponha formalidades especiais para a fase preparatória da decisão;",
            "b) Do termo do prazo fixado na lei para a conclusão daquelas formalidades ou, na falta de fixação, do termo dos três meses seguintes à apresentação da pretensão;",
            "c) Da data do conhecimento da conclusão das mesmas formalidades, se essa for anterior ao termo do prazo aplicável de acordo com a alínea anterior."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO IV Decisão e outras causas de extinção"
    },
    {
        "Artigo": "Artigo 103.º",
        "Ementa": "(Outras causas de extinção do procedimento)",
        "Numero": [
            "1. O procedimento extingue-se quando os interessados, mediante requerimento escrito, desistam do procedimento ou de alguns dos pedidos formulados, ou renunciem aos seus direitos ou interesses legalmente protegidos, salvo se a desistência ou a renúncia não forem permitidas por lei ou se a Administração entender que o interesse público exige a sua continuação.",
            "2. O órgão competente para a decisão pode declarar o procedimento extinto:",
            "a) Quando por causa imputável ao interessado este esteja parado por mais de seis meses;",
            "b) Quando a finalidade a que este se destinava ou o objecto da decisão se revelarem impossíveis ou inúteis."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO IV Decisão e outras causas de extinção"
    },
    {
        "Artigo": "Artigo 104.º",
        "Ementa": "(Falta de pagamento de taxas ou despesas)",
        "Numero": [
            "1. O procedimento extingue-se, ainda, pela falta de pagamento, no prazo devido, de quaisquer taxas ou despesas de que a lei faça depender a realização dos actos procedimentais.",
            "2. Os interessados podem obstar à extinção do procedimento se realizarem o pagamento em dobro da quantia em falta nos dez dias seguintes ao termo do prazo fixado para o seu pagamento."
        ],
        "Titulo": "PARTE III Procedimento administrativo CAPÍTULO V Marcha do procedimento SECÇÃO IV Decisão e outras causas de extinção"
    },
    {
        "Artigo": "Artigo 105.º",
        "Ementa": "(Âmbito de aplicação)",
        "Numero": [
            "As disposições do presente capítulo aplicam-se a todos os regulamentos da Administração Pública."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO I Regulamento"
    },
    {
        "Artigo": "Artigo 106.º",
        "Ementa": "(Pedidos)",
        "Numero": [
            "Os interessados podem apresentar aos órgãos competentes pedidos em que solicitem a elaboração, modificação ou revogação de regulamentos, os quais devem ser fundamentados, sem o que a Administração não toma conhecimento deles."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO I Regulamento"
    },
    {
        "Artigo": "Artigo 107.º",
        "Ementa": "(Projecto de regulamento)",
        "Numero": [
            "Todo o projecto de regulamento é acompanhado de uma exposição de motivos, da qual consta obrigatoriamente a indicação das normas legais e regulamentares vigentes sobre a matéria, bem como dos estudos, pareceres, informações e demais elementos que tenham servido de base à sua elaboração."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO I Regulamento"
    },
    {
        "Artigo": "Artigo 108.º",
        "Ementa": "(Apreciação pública)",
        "Numero": [
            "1. Quando a natureza da matéria o permita, o órgão competente deve, em regra, submeter a apreciação pública, para recolha de sugestões, o projecto de regulamento, o qual é, para o efeito, publicado no Boletim Oficial de Macau.",
            "2. Os interessados devem dirigir por escrito as suas sugestões ao órgão com competência regulamentar, dentro do prazo de trinta dias contados da data da publicação do projecto de regulamento.",
            "3. No preâmbulo do regulamento faz-se menção de que o respectivo projecto foi objecto de apreciação pública, quando tenha sido o caso."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO I Regulamento"
    },
    {
        "Artigo": "Artigo 109.º",
        "Ementa": "(Regulamentos de execução e revogatórios)",
        "Numero": [
            "1. Os regulamentos necessários à execução das leis em vigor não podem ser objecto de revogação global sem que a matéria seja simultaneamente objecto de nova regulamentação.",
            "2. Nos regulamentos faz-se sempre menção especificada das normas revogadas."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO I Regulamento"
    },
    {
        "Artigo": "Artigo 110.º",
        "Ementa": "(Conceito de acto administrativo)",
        "Numero": [
            "Para os efeitos da presente lei, consideram-se actos administrativos as decisões dos órgãos da Administração que ao abrigo de normas de direito público visem produzir efeitos jurídicos numa situação individual e concreta."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO I Validade do acto administrativo"
    },
    {
        "Artigo": "Artigo 111.º",
        "Ementa": "(Condição, termo ou modo)",
        "Numero": [
            "Os actos administrativos podem ser sujeitos a condição, termo ou modo, desde que estes não sejam contrários à lei ou ao fim a que o acto se destina."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO I Validade do acto administrativo"
    },
    {
        "Artigo": "Artigo 112.º",
        "Ementa": "(Forma dos actos)",
        "Numero": [
            "1. Os actos administrativos devem ser praticados por escrito, desde que outra forma não seja prevista por lei ou imposta pela natureza e circunstâncias do acto.",
            "2. A forma escrita só é obrigatória para os actos dos órgãos colegiais quando a lei expressamente a determinar, mas esses actos devem ser sempre consignados em acta, sem o que não produzem efeitos."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO I Validade do acto administrativo"
    },
    {
        "Artigo": "Artigo 113.º",
        "Ementa": "(Menções obrigatórias)",
        "Numero": [
            "1. Sem prejuízo de outras referências especialmente exigidas, devem sempre constar do acto:",
            "a) A indicação da autoridade que o praticou;",
            "b) A menção da delegação ou subdelegação de poderes, quando exista;",
            "c) A identificação adequada do destinatário ou destinatários;",
            "d) A enunciação dos factos ou actos que lhe deram origem, quando relevantes;",
            "e) A fundamentação, quando exigível;",
            "f) O conteúdo ou o sentido da decisão e o respectivo objecto;",
            "g) A data em que é praticado;",
            "h) A assinatura do autor do acto ou do presidente do órgão colegial de que emane.",
            "2. Todas as menções exigidas pelo número anterior devem ser enunciadas de forma clara, precisa e completa de modo a poderem determinar-se inequivocamente o seu sentido e alcance e os efeitos jurídicos do acto administrativo.",
            "3. A publicação no Boletim Oficial de Macau dos diplomas de delegação de competências do Governador nos Secretários-Adjuntos dispensa a menção referida na alínea b) do n.º 1."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO I Validade do acto administrativo"
    },
    {
        "Artigo": "Artigo 114.º",
        "Ementa": "(Dever de fundamentação)",
        "Numero": [
            "1. Para além dos casos em que a lei especialmente o exija, devem ser fundamentados os actos administrativos que, total ou parcialmente:",
            "a) Neguem, extingam, restrinjam ou afectem por qualquer modo direitos ou interesses legalmente protegidos, ou imponham ou agravem deveres, encargos ou sanções;",
            "b) Decidam reclamação ou recurso;",
            "c) Decidam em contrário de pretensão ou oposição formulada por interessado;",
            "d) Decidam em contrário de parecer, informação ou proposta oficial;",
            "e) Decidam de modo diferente da prática habitualmente seguida na resolução de casos semelhantes, ou na interpretação e aplicação dos mesmos princípios ou preceitos legais;",
            "f) Impliquem revogação, modificação ou suspensão de acto administrativo anterior.",
            "2. Salvo disposição legal em contrário, não carecem de ser fundamentados os actos de homologação de deliberações tomadas por júris, bem como as ordens dadas pelos superiores hierárquicos aos seus subalternos em matéria de serviço e com a forma legal."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO I Validade do acto administrativo"
    },
    {
        "Artigo": "Artigo 115.º",
        "Ementa": "(Requisitos da fundamentação)",
        "Numero": [
            "1. A fundamentação deve ser expressa, através de sucinta exposição dos fundamentos de facto e de direito da decisão, podendo consistir em mera declaração de concordância com os fundamentos de anteriores pareceres, informações ou propostas que constituem neste caso parte integrante do respectivo acto.",
            "2. Equivale à falta de fundamentação a adopção de fundamentos que, por obscuridade, contradição ou insuficiência, não esclareçam concretamente a motivação do acto.",
            "3. Na resolução de assuntos da mesma natureza, pode utilizar-se qualquer meio mecânico que reproduza os fundamentos das decisões, desde que tal não envolva diminuição das garantias dos administrados."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO I Validade do acto administrativo"
    },
    {
        "Artigo": "Artigo 116.º",
        "Ementa": "(Fundamentação de actos orais)",
        "Numero": [
            "1. A fundamentação dos actos orais abrangidos pelo n.º 1 do artigo 114.º que não constem de acta deve, a requerimento dos interessados e para efeito de impugnação, ser reduzida a escrito e comunicada integralmente àqueles, no prazo de dez dias, através da expedição de ofício sob registo do correio ou de entrega de notificação pessoal, a cumprir no mesmo prazo.",
            "2. O não exercício, pelos interessados, da faculdade conferida pelo número anterior não prejudica os efeitos da eventual falta de fundamentação do acto."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO I Validade do acto administrativo"
    },
    {
        "Artigo": "Artigo 117.º",
        "Ementa": "(Regra geral)",
        "Numero": [
            "1. O acto administrativo produz os seus efeitos desde a data em que for praticado, salvo nos casos em que a lei ou o próprio acto lhe atribuam eficácia retroactiva ou diferida.",
            "2. Para efeitos do disposto no número anterior, o acto considera-se praticado logo que estejam preenchidos os seus elementos, não obstando à perfeição do mesmo, para esse fim, qualquer motivo determinante de anulabilidade."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO II Eficácia do acto administrativo"
    },
    {
        "Artigo": "Artigo 118.º",
        "Ementa": "(Eficácia retroactiva)",
        "Numero": [
            "1. Têm eficácia retroactiva os actos administrativos:",
            "a) Que se limitem a interpretar actos anteriores;",
            "b) Que dêem execução a decisões dos tribunais, anulatórias de actos administrativos, salvo tratando-se de actos renováveis;",
            "c) A que a lei atribua esse efeito.",
            "2. Fora dos casos abrangidos pelo número anterior, o autor do acto administrativo só pode atribuir-lhe eficácia retroactiva:",
            "a) Quando a retroactividade seja favorável para os interessados e não lese direitos ou interesses legalmente protegidos de terceiros, desde que à data a que se pretende fazer remontar a eficácia do acto já existissem os pressupostos justificativos da retroactividade;",
            "b) Quando estejam em causa decisões revogatórias de actos administrativos tomadas por órgãos ou agentes que os praticaram, na sequência de reclamação ou recurso hierárquico;",
            "c) Quando a lei o permitir."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO II Eficácia do acto administrativo"
    },
    {
        "Artigo": "Artigo 119.º",
        "Ementa": "(Eficácia diferida)",
        "Numero": [
            "a) Quando estiver sujeito a aprovação;",
            "b) Quando os seus efeitos ficarem sujeitos a condição ou termo suspensivos;",
            "c) Quando os seus efeitos, pela natureza do acto ou por disposição legal, dependerem da verificação de qualquer requisito que não respeite à validade do próprio acto."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO II Eficácia do acto administrativo"
    },
    {
        "Artigo": "Artigo 120.º",
        "Ementa": "(Publicidade obrigatória)",
        "Numero": [
            "1. A publicidade dos actos administrativos só é obrigatória quando exigida por lei.",
            "2. A publicação dos actos administrativos referidos no número anterior é feita nas duas línguas oficiais.",
            "3. A falta de publicidade dos actos, quando legalmente exigida, implica a sua ineficácia.",
            "4. Quando a lei impuser a publicação do acto mas não regular os respectivos termos, deve a mesma ser feita no Boletim Oficial de Macau, no prazo de trinta dias, e conter todos os elementos referidos no n.º 1 do artigo 113.º, devendo, quando possível, os fundamentos da decisão constar da publicação, ainda que por extracto."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO II Eficácia do acto administrativo"
    },
    {
        "Artigo": "Artigo 121.º",
        "Ementa": "(Eficácia dos actos constitutivos de deveres ou encargos)",
        "Numero": [
            "1. Os actos que constituam deveres ou encargos para os particulares e não estejam sujeitos a publicação começam a produzir efeitos a partir da sua notificação aos destinatários, ou de outra forma de conhecimento oficial pelos mesmos ou do começo de execução do acto.",
            "2. Presume-se o conhecimento oficial sempre que o interessado intervenha no procedimento administrativo e aí revele perfeito conhecimento do conteúdo do acto."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO II Eficácia do acto administrativo"
    },
    {
        "Artigo": "Artigo 122.º",
        "Ementa": "(Actos nulos)",
        "Numero": [
            "1. São nulos os actos a que falte qualquer dos elementos essenciais ou para os quais a lei comine expressamente essa forma de invalidade.",
            "2. São, designadamente, actos nulos:",
            "a) Os actos viciados de usurpação de poder;",
            "b) Os actos estranhos às atribuições da pessoa colectiva em que o seu autor se integre;",
            "c) Os actos cujo objecto seja impossível, ininteligível ou constitua um crime;",
            "d) Os actos que ofendam o conteúdo essencial de um direito fundamental;",
            "e) Os actos praticados sob coacção;",
            "f) Os actos que careçam em absoluto de forma legal;",
            "g) As deliberações dos órgãos colegiais que forem tomadas tumultuosamente ou com inobservância do quórum ou da maioria legalmente exigidos;",
            "h) Os actos que ofendam os casos julgados;",
            "i) Os actos consequentes de actos administrativos anteriormente anulados ou revogados, desde que não haja contra-interessados com interesse legítimo na manutenção do acto consequente."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO III Invalidade do acto administrativo"
    },
    {
        "Artigo": "Artigo 123.º",
        "Ementa": "(Regime da nulidade)",
        "Numero": [
            "1. O acto nulo não produz quaisquer efeitos jurídicos, independentemente da declaração de nulidade.",
            "2. A nulidade é invocável a todo o tempo por qualquer interessado e pode ser declarada, também a todo o tempo, por qualquer órgão administrativo ou por qualquer tribunal.",
            "3. O disposto nos números anteriores não prejudica a possibilidade de atribuição de certos efeitos jurídicos a situações de facto decorrentes de actos nulos, por força do simples decurso do tempo, de harmonia com os princípios gerais de direito."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO III Invalidade do acto administrativo"
    },
    {
        "Artigo": "Artigo 124.º",
        "Ementa": "(Actos anuláveis)",
        "Numero": [
            "São anuláveis os actos administrativos praticados com ofensa dos princípios ou normas jurídicas aplicáveis para cuja violação se não preveja outra sanção."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO III Invalidade do acto administrativo"
    },
    {
        "Artigo": "Artigo 125.º",
        "Ementa": "(Regime da anulabilidade)",
        "Numero": [
            "1. O acto anulável pode ser revogado nos termos previstos no artigo 130.º",
            "2. O acto anulável é susceptível de recurso para os tribunais, nos termos da legislação reguladora do contencioso administrativo."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO III Invalidade do acto administrativo"
    },
    {
        "Artigo": "Artigo 126.º",
        "Ementa": "(Ratificação, reforma e conversão)",
        "Numero": [
            "1. Não são susceptíveis de ratificação, reforma e conversão os actos nulos.",
            "2. São aplicáveis à ratificação, reforma e conversão dos actos anuláveis as normas que regulam a competência para a revogação dos actos inválidos e a sua tempestividade.",
            "3. Em caso de incompetência, o poder de ratificar o acto cabe ao órgão competente para a sua prática.",
            "4. Desde que não tenha havido alteração ao regime legal, a ratificação, reforma e conversão retroagem os seus efeitos à data dos actos a que respeitam."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO III Invalidade do acto administrativo"
    },
    {
        "Artigo": "Artigo 127.º",
        "Ementa": "(Iniciativa da revogação)",
        "Numero": [
            "Os actos administrativos podem ser revogados por iniciativa dos órgãos competentes, ou a pedido dos interessados, mediante reclamação ou recurso administrativo."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO IV Revogação do acto administrativo"
    },
    {
        "Artigo": "Artigo 128.º",
        "Ementa": "(Actos insusceptíveis de revogação)",
        "Numero": [
            "1. Não são susceptíveis de revogação:",
            "a) Os actos nulos;",
            "b) Os actos anulados contenciosamente;",
            "c) Os actos revogados com eficácia retroactiva.",
            "2. Podem ser objecto de revogação com eficácia retroactiva os actos cujos efeitos tenham caducado ou se encontrem esgotados."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO IV Revogação do acto administrativo"
    },
    {
        "Artigo": "Artigo 129.º",
        "Ementa": "(Revogabilidade dos actos válidos)",
        "Numero": [
            "1. Os actos administrativos que sejam válidos são livremente revogáveis, excepto nos casos seguintes:",
            "a) Quando a sua irrevogabilidade resultar de vinculação legal;",
            "b) Quando forem constitutivos de direitos ou de interesses legalmente protegidos;",
            "c) Quando deles resultem, para a Administração, obrigações legais ou direitos irrenunciáveis.",
            "2. Os actos constitutivos de direitos ou interesses legalmente protegidos são, contudo, revogáveis:",
            "a) Na parte em que sejam desfavoráveis aos interesses dos seus destinatários;",
            "b) Quando todos os interessados dêem a sua concordância à revogação do acto e não se trate de direitos ou interesses indisponíveis."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO IV Revogação do acto administrativo"
    },
    {
        "Artigo": "Artigo 130.º",
        "Ementa": "(Revogabilidade dos actos anuláveis)",
        "Numero": [
            "1. Os actos administrativos anuláveis só podem ser revogados com fundamento na sua invalidade e dentro do prazo do respectivo recurso contencioso ou até à resposta da entidade recorrida.",
            "2. Se houver prazos diferentes para o recurso contencioso atende-se ao que terminar em último lugar."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO IV Revogação do acto administrativo"
    },
    {
        "Artigo": "Artigo 131.º",
        "Ementa": "(Competência para a revogação)",
        "Numero": [
            "1. Salvo disposição especial, são competentes para a revogação dos actos administrativos, além dos seus autores, os respectivos superiores hierárquicos, desde que não se trate de acto da competência exclusiva do subalterno.",
            "2. Os actos administrativos praticados por delegação ou subdelegação de poderes podem ser revogados pelo órgão delegante ou subdelegante, bem como pelo delegado ou subdelegado enquanto vigorar a delegação ou subdelegação.",
            "3. Os actos administrativos praticados por órgãos sujeitos a tutela administrativa só podem ser revogados pelos órgãos tutelares nos casos expressamente permitidos por lei."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO IV Revogação do acto administrativo"
    },
    {
        "Artigo": "Artigo 132.º",
        "Ementa": "(Forma dos actos de revogação)",
        "Numero": [
            "1. O acto de revogação, salvo disposição especial, deve revestir a forma legalmente prescrita para o acto revogado.",
            "2. No entanto, deve o acto de revogação revestir a mesma forma que tiver sido utilizada na prática do acto revogado quando a lei não estabelecer forma alguma para este, ou quando o acto revogado tiver revestido forma mais solene que a legalmente prevista.",
            "3. São de observar na revogação as formalidades exigidas para a prática do acto revogado, salvo quando a lei disponha de forma diferente."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO IV Revogação do acto administrativo"
    },
    {
        "Artigo": "Artigo 133.º",
        "Ementa": "(Eficácia da revogação)",
        "Numero": [
            "1. A revogação de actos administrativos apenas produz efeitos para o futuro, salvo o disposto nos números seguintes.",
            "2. A revogação tem efeito retroactivo quando se fundamente na invalidade do acto revogado.",
            "3. O autor da revogação pode, no próprio acto, atribuir-lhe efeito retroactivo:",
            "a) Quando este seja favorável aos interessados;",
            "b) Quando todos os interessados tenham concordado expressamente com a retroactividade dos efeitos e estes não respeitem a direitos ou interesses indisponíveis."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO IV Revogação do acto administrativo"
    },
    {
        "Artigo": "Artigo 134.º",
        "Ementa": "(Efeitos repristinatórios da revogação)",
        "Numero": [
            "A revogação de um acto revogatório só produz efeitos repristinatórios se a lei ou acto de revogação o determinarem expressamente."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO IV Revogação do acto administrativo"
    },
    {
        "Artigo": "Artigo 135.º",
        "Ementa": "(Rectificação dos actos administrativos)",
        "Numero": [
            "1. Os erros de cálculo e os erros materiais na expressão da vontade do órgão administrativo, quando manifestos, podem ser rectificados, a todo o tempo, pelos órgãos competentes para a revogação do acto.",
            "2. A rectificação pode ter lugar por iniciativa dos órgãos competentes ou a pedido dos interessados, tem efeitos retroactivos e deve ser feita sob a forma e com a publicidade usadas para a prática do acto rectificado."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO IV Revogação do acto administrativo"
    },
    {
        "Artigo": "Artigo 136.º",
        "Ementa": "(Executoriedade)",
        "Numero": [
            "1. Os actos administrativos são executórios logo que eficazes.",
            "2. O cumprimento das obrigações e o respeito pelas limitações que derivam de um acto administrativo podem ser impostos coercivamente pela Administração sem recurso prévio aos tribunais, desde que a imposição seja feita pelas formas e nos termos admitidos por lei.",
            "3. O cumprimento das obrigações pecuniárias resultantes de actos administrativos pode ser exigido pela Administração, nos termos do artigo 142.º"
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO V Execução do acto administrativo"
    },
    {
        "Artigo": "Artigo 137.º",
        "Ementa": "(Actos não executórios)",
        "Numero": [
            "1. Não são executórios:",
            "a) Os actos cuja eficácia esteja suspensa;",
            "b) Os actos de que tenha sido interposto recurso com efeito suspensivo;",
            "c) Os actos sujeitos a aprovação;",
            "d) Os actos confirmativos de actos executórios.",
            "2. A eficácia dos actos administrativos pode ser suspensa pelos órgãos competentes para a sua revogação e pelos órgãos tutelares a quem a lei conceda esse poder, bem como pelos tribunais competentes nos termos da legislação do contencioso administrativo."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO V Execução do acto administrativo"
    },
    {
        "Artigo": "Artigo 138.º",
        "Ementa": "(Legalidade da execução)",
        "Numero": [
            "1. Salvo em estado de necessidade, os órgãos da Administração Pública não podem praticar nenhum acto ou operação material de que resulte limitação de direitos subjectivos ou interesses legalmente protegidos dos particulares, sem terem praticado previamente o acto administrativo que legitime tal actuação.",
            "2. Na execução dos actos administrativos devem, na medida do possível, ser utilizados os meios que, garantindo a realização integral dos seus objectivos, envolvam menor prejuízo para os direitos e interesses dos particulares.",
            "3. Os interessados podem impugnar administrativa e contenciosamente os actos ou operações de execução que excedam os limites do acto exequendo.",
            "4. São também susceptíveis de recurso contencioso os actos ou operações de execução arguidos de ilegalidade, desde que esta não seja consequência da ilegalidade do acto exequendo."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO V Execução do acto administrativo"
    },
    {
        "Artigo": "Artigo 139.º",
        "Ementa": "(Notificação da execução)",
        "Numero": [
            "1. A decisão de proceder à execução administrativa é sempre notificada ao seu destinatário antes de se iniciar a execução.",
            "2. O órgão administrativo pode fazer a notificação da execução conjuntamente com a notificação do acto definitivo e executório.",
            "3. Da notificação devem constar as cominações em que o notificando incorre em caso de incumprimento de ordem que lhe seja transmitido através da notificação."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO V Execução do acto administrativo"
    },
    {
        "Artigo": "Artigo 140.º",
        "Ementa": "(Proibição de embargos)",
        "Numero": [
            "Não são admitidos embargos, administrativos ou judiciais, em relação à execução coerciva dos actos administrativos, sem prejuízo do disposto na lei em matéria de suspensão da eficácia dos actos."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO V Execução do acto administrativo"
    },
    {
        "Artigo": "Artigo 141.º",
        "Ementa": "(Fins da execução)",
        "Numero": [
            "A execução pode ter por fim o pagamento de quantia certa, a entrega de coisa certa ou a prestação de um facto."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO V Execução do acto administrativo"
    },
    {
        "Artigo": "Artigo 142.º",
        "Ementa": "(Execução para pagamento de quantia certa)",
        "Numero": [
            "1. Quando por força de um acto administrativo devam ser pagas a uma pessoa colectiva pública, ou por ordem desta, prestações pecuniárias, segue-se, na falta de pagamento voluntário no prazo fixado, o processo de execução fiscal.",
            "2. Para o efeito, o órgão administrativo competente emite nos termos legais uma certidão, com valor de título executivo, que remete, juntamente com o processo administrativo, à Direcção dos Serviços de Finanças.",
            "3. Segue-se o processo indicado no n.º 1 quando, na execução de actos fungíveis, estes forem realizados por pessoa diversa do obrigado.",
            "4. No caso previsto no número anterior, a Administração opta por realizar directamente os actos de execução ou por encarregar terceiro de os praticar, ficando todas as despesas, incluindo indemnizações e sanções pecuniárias, por conta do obrigado."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO V Execução do acto administrativo"
    },
    {
        "Artigo": "Artigo 143.º",
        "Ementa": "(Execução para entrega de coisa certa)",
        "Numero": [
            "Se o obrigado não fizer a entrega da coisa que a Administração devia receber, o órgão competente procede às diligências que forem necessárias para tomar posse administrativa da coisa devida."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO V Execução do acto administrativo"
    },
    {
        "Artigo": "Artigo 144.º",
        "Ementa": "(Execução para prestação de facto)",
        "Numero": [
            "1. No caso de execução para prestação de facto fungível, a Administração notifica o obrigado para que proceda à prática do acto devido, fixando um prazo razoável para o seu cumprimento.",
            "2. Se o obrigado não cumprir dentro do prazo fixado, a Administração opta por realizar a execução directamente ou por intermédio de terceiro, ficando neste caso todas as despesas, incluindo indemnizações e sanções pecuniárias, por conta do obrigado.",
            "3. As obrigações positivas de prestação de facto infungível só podem ser objecto de coacção directa sobre os indivíduos obrigados nos casos expressamente previstos na lei, e sempre com observância dos direitos fundamentais dos cidadãos e do respeito da pessoa humana."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO II Acto administrativo SECÇÃO V Execução do acto administrativo"
    },
    {
        "Artigo": "Artigo 145.º",
        "Ementa": "(Princípio geral)",
        "Numero": [
            "1. Os particulares têm o direito de solicitar a revogação ou a modificação dos actos administrativos, nos termos regulados neste Código.",
            "2. O direito reconhecido no número anterior pode ser exercido, consoante os casos:",
            "a) Mediante reclamação para o autor do acto;",
            "b) Mediante recurso para o superior hierárquico do autor do acto, para o órgão colegial de que este seja membro, ou para o delegante ou subdelegante;",
            "c) Mediante recurso para o órgão que exerça poderes de tutela ou de superintendência sobre o autor do acto."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO III Reclamação e recursos administrativos SECÇÃO I Generalidades"
    },
    {
        "Artigo": "Artigo 146.º",
        "Ementa": "(Fundamentos da impugnação)",
        "Numero": [
            "Salvo disposição em contrário, as reclamações e os recursos podem ter por fundamento a ilegalidade ou a inconveniência do acto administrativo impugnado."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO III Reclamação e recursos administrativos SECÇÃO I Generalidades"
    },
    {
        "Artigo": "Artigo 147.º",
        "Ementa": "(Legitimidade)",
        "Numero": [
            "1. Têm legitimidade para reclamar ou recorrer os titulares de direitos subjectivos ou interesses legalmente protegidos que se considerem lesados pelo acto administrativo.",
            "2. É aplicável à reclamação e aos recursos administrativos o disposto nos n.os 2 e 3 do artigo 55.º",
            "3. Não podem reclamar nem recorrer aqueles que, sem reserva, tenham aceitado, expressa ou tacitamente, um acto administrativo depois de praticado."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO III Reclamação e recursos administrativos SECÇÃO I Generalidades"
    },
    {
        "Artigo": "Artigo 148.º",
        "Ementa": "(Princípio geral)",
        "Numero": [
            "1. Pode reclamar-se de qualquer acto administrativo, salvo disposição legal em contrário.",
            "2. Não é possível reclamar de acto que decida anterior reclamação ou recurso administrativo, salvo com fundamento em omissão de pronúncia."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO III Reclamação e recursos administrativos SECÇÃO II Reclamação"
    },
    {
        "Artigo": "Artigo 149.º",
        "Ementa": "(Prazo da reclamação)",
        "Numero": [
            "a) Da publicação do acto no Boletim Oficial de Macau, quando a mesma seja obrigatória;",
            "b) Da notificação do acto, quando esta se tenha efectuado, se a publicação não for obrigatória;",
            "c) Da data em que o interessado tiver conhecimento do acto, nos restantes casos."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO III Reclamação e recursos administrativos SECÇÃO II Reclamação"
    },
    {
        "Artigo": "Artigo 150.º",
        "Ementa": "(Efeitos da reclamação)",
        "Numero": [
            "1. A reclamação de acto de que não caiba recurso contencioso tem efeito suspensivo, salvo nos casos em que a lei disponha o contrário ou quando o autor do acto considere que a sua não execução imediata causa grave prejuízo ao interesse público.",
            "2. A reclamação de acto de que caiba recurso contencioso não tem efeito suspensivo, salvo nos casos em que a lei disponha o contrário ou quando o autor do acto, oficiosamente ou a pedido dos interessados, considere que a execução imediata do acto causa prejuízos irreparáveis ou de difícil reparação ao seu destinatário.",
            "3. A suspensão da execução a pedido dos interessados deve ser requerida à entidade competente para decidir no prazo de cinco dias a contar da data em que o processo lhe for apresentado.",
            "4. Na apreciação do pedido deve verificar-se se as provas revelam uma probabilidade séria de veracidade dos factos alegados pelos interessados, devendo decretar-se, em caso afirmativo, a suspensão da eficácia.",
            "5. O disposto nos números anteriores não prejudica o pedido de suspensão de eficácia perante os tribunais administrativos, nos termos da legislação aplicável."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO III Reclamação e recursos administrativos SECÇÃO II Reclamação"
    },
    {
        "Artigo": "Artigo 151.º",
        "Ementa": "(Prazos de recurso)",
        "Numero": [
            "1. A reclamação de actos insusceptíveis de recurso contencioso suspende o prazo de interposição do recurso hierárquico necessário.",
            "2. A reclamação dos demais actos não suspende nem interrompe os prazos de recurso."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO III Reclamação e recursos administrativos SECÇÃO II Reclamação"
    },
    {
        "Artigo": "Artigo 152.º",
        "Ementa": "(Prazo para a decisão)",
        "Numero": [
            "O prazo para o órgão competente apreciar e decidir a reclamação é de quinze dias."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO III Reclamação e recursos administrativos SECÇÃO II Reclamação"
    },
    {
        "Artigo": "Artigo 153.º",
        "Ementa": "(Objecto)",
        "Numero": [
            "Podem ser objecto de recurso hierárquico todos os actos administrativos praticados por órgãos sujeitos aos poderes hierárquicos de outros órgãos, desde que a lei não exclua tal possibilidade."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO III Reclamação e recursos administrativos SECÇÃO III Recurso hierárquico"
    },
    {
        "Artigo": "Artigo 154.º",
        "Ementa": "(Espécies e âmbito)",
        "Numero": [
            "1. O recurso hierárquico é necessário ou facultativo, consoante o acto a impugnar seja ou não insusceptível de recurso contencioso.",
            "2. Ainda que o acto de que se interpõe recurso hierárquico seja susceptível de recurso contencioso, tanto a ilegalidade como a inconveniência do acto podem ser apreciados naquele."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO III Reclamação e recursos administrativos SECÇÃO III Recurso hierárquico"
    },
    {
        "Artigo": "Artigo 155.º",
        "Ementa": "(Prazos de interposição)",
        "Numero": [
            "1. Sempre que a lei não estabeleça prazo diferente, é de trinta dias o prazo para a interposição do recurso hierárquico necessário.",
            "2. O recurso hierárquico facultativo deve ser interposto dentro do prazo estabelecido para interposição de recurso contencioso do acto em causa."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO III Reclamação e recursos administrativos SECÇÃO III Recurso hierárquico"
    },
    {
        "Artigo": "Artigo 156.º",
        "Ementa": "(Interposição)",
        "Numero": [
            "1. O recurso hierárquico interpõe-se por meio de requerimento no qual o recorrente deve expor todos os fundamentos do recurso, podendo juntar os documentos que considere convenientes.",
            "2. O recurso é dirigido ao mais elevado superior hierárquico do autor do acto, salvo se a competência para a decisão se encontrar delegada ou subdelegada.",
            "3. O requerimento de interposição do recurso pode ser apresentado ao autor do acto ou à autoridade a quem seja dirigido."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO III Reclamação e recursos administrativos SECÇÃO III Recurso hierárquico"
    },
    {
        "Artigo": "Artigo 157.º",
        "Ementa": "(Efeitos)",
        "Numero": [
            "1. O recurso hierárquico necessário suspende a eficácia do acto recorrido, salvo nos casos em que a lei disponha em contrário ou quando o autor do acto considere que a sua não execução imediata causa grave prejuízo ao interesse público.",
            "2. O órgão competente para apreciar o recurso pode revogar a decisão a que se refere o número anterior, ou tomá-la quando o autor do acto o não tenha feito.",
            "3. O recurso hierárquico facultativo não suspende a eficácia do acto recorrido."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO III Reclamação e recursos administrativos SECÇÃO III Recurso hierárquico"
    },
    {
        "Artigo": "Artigo 158.º",
        "Ementa": "(Notificação dos contra-interessados)",
        "Numero": [
            "Interposto o recurso, o órgão competente para dele conhecer deve notificar aqueles que possam ser prejudicados pela sua procedência para alegarem, no prazo de quinze dias, o que tiverem por conveniente sobre o pedido e os seus fundamentos."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO III Reclamação e recursos administrativos SECÇÃO III Recurso hierárquico"
    },
    {
        "Artigo": "Artigo 159.º",
        "Ementa": "(Intervenção do autor do acto)",
        "Numero": [
            "1. Após a notificação a que se refere o artigo anterior ou, se a ela não houver lugar, logo que interposto o recurso, começa a correr um prazo de quinze dias dentro do qual o autor do acto recorrido se deve pronunciar sobre o recurso e remetê-lo ao órgão competente para dele conhecer, notificando o recorrente da remessa do processo.",
            "2. Quando os contra-interessados não hajam deduzido oposição e os elementos constantes do procedimento demonstrem suficientemente a procedência do recurso, pode o autor do acto recorrido revogar, modificar ou substituir o acto de acordo com o pedido do recorrente, informando da sua decisão o órgão competente para conhecer do recurso."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO III Reclamação e recursos administrativos SECÇÃO III Recurso hierárquico"
    },
    {
        "Artigo": "Artigo 160.º",
        "Ementa": "(Rejeição do recurso)",
        "Numero": [
            "a) Quando haja sido interposto para órgão incompetente;",
            "b) Quando o acto impugnado não seja susceptível de recurso;",
            "c) Quando o recorrente careça de legitimidade;",
            "d) Quando o recurso haja sido interposto fora do prazo;",
            "e) Quando ocorra qualquer outra causa que obste ao conhecimento do recurso."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO III Reclamação e recursos administrativos SECÇÃO III Recurso hierárquico"
    },
    {
        "Artigo": "Artigo 161.º",
        "Ementa": "(Decisão)",
        "Numero": [
            "1. O órgão competente para conhecer do recurso pode, sem sujeição ao pedido do recorrente, salvas as excepções previstas na lei, confirmar ou revogar o acto recorrido; se a competência do autor do acto recorrido não for exclusiva, pode também modificá-lo ou substituí-lo.",
            "2. O órgão competente para decidir o recurso pode, se for caso disso, anular, no todo ou em parte, o procedimento administrativo e determinar a realização de nova instrução ou de diligências complementares."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO III Reclamação e recursos administrativos SECÇÃO III Recurso hierárquico"
    },
    {
        "Artigo": "Artigo 162.º",
        "Ementa": "(Prazo para a decisão)",
        "Numero": [
            "1. Quando a lei não fixe prazo diferente, o recurso hierárquico deve ser decidido no prazo de trinta dias contado a partir da remessa do processo ao órgão competente para dele conhecer.",
            "2. O prazo referido no número anterior é elevado até ao máximo de noventa dias quando haja lugar à realização de nova instrução ou de diligências complementares.",
            "3. Decorridos os prazos referidos nos números anteriores sem que haja sido tomada uma decisão, considera-se o recurso tacitamente indeferido."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO III Reclamação e recursos administrativos SECÇÃO III Recurso hierárquico"
    },
    {
        "Artigo": "Artigo 163.º",
        "Ementa": "(Recurso hierárquico impróprio)",
        "Numero": [
            "1. Considera-se impróprio o recurso hierárquico interposto para um órgão que exerça poder de supervisão sobre outro órgão da mesma pessoa colectiva, fora do âmbito da hierarquia administrativa.",
            "2. Nos casos expressamente previstos na lei, também cabe recurso hierárquico impróprio para os órgãos colegiais em relação aos actos administrativos praticados por qualquer dos seus membros.",
            "3. São aplicáveis ao recurso hierárquico impróprio, com as necessárias adaptações, as disposições reguladoras do recurso hierárquico."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO III Reclamação e recursos administrativos SECÇÃO IV Recurso hierárquico impróprio e recurso tutelar"
    },
    {
        "Artigo": "Artigo 164.º",
        "Ementa": "(Recurso tutelar)",
        "Numero": [
            "1. O recurso tutelar tem por objecto actos administrativos praticados por pessoas colectivas públicas sujeitas a tutela ou superintendência.",
            "2. O recurso tutelar só existe nos casos expressamente previstos por lei e tem, salvo disposição em contrário, carácter facultativo.",
            "3. O recurso tutelar só pode ter por fundamento a inconveniência do acto recorrido nos casos em que a lei estabeleça uma tutela de mérito.",
            "4. A modificação ou substituição do acto recorrido só é possível se a lei conferir poderes de tutela substitutiva e no âmbito destes.",
            "5. Ao recurso tutelar são aplicáveis as disposições reguladoras do recurso hierárquico, na parte em que não contrariem a natureza própria daquele e o respeito devido à autonomia da entidade tutelada."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO III Reclamação e recursos administrativos SECÇÃO IV Recurso hierárquico impróprio e recurso tutelar"
    },
    {
        "Artigo": "Artigo 165.º",
        "Ementa": "(Conceito de contrato administrativo)",
        "Numero": [
            "1. Diz-se contrato administrativo o acordo de vontades pelo qual é constituída, modificada ou extinta uma relação jurídica administrativa.",
            "2. São contratos administrativos, designadamente, os contratos de:",
            "a) Empreitada de obras públicas;",
            "b) Concessão de obras públicas;",
            "c) Concessão de serviços públicos;",
            "d) Concessão de exploração de jogos de fortuna ou azar;",
            "e) Fornecimento contínuo;",
            "f) Prestação de serviços para fins de imediata utilidade pública."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO IV Contrato administrativo"
    },
    {
        "Artigo": "Artigo 166.º",
        "Ementa": "(Utilização do contrato administrativo)",
        "Numero": [
            "Os órgãos administrativos, na prossecução das atribuições da pessoa colectiva em que se integram, podem celebrar contratos administrativos, salvo se outra coisa resultar da lei ou da natureza das relações a estabelecer."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO IV Contrato administrativo"
    },
    {
        "Artigo": "Artigo 167.º",
        "Ementa": "(Poderes da Administração)",
        "Numero": [
            "a) Modificar unilateralmente o conteúdo das prestações, desde que seja respeitado o objecto do contrato e o seu equilíbrio financeiro;",
            "b) Dirigir o modo de execução das prestações;",
            "c) Rescindir unilateralmente os contratos por imperativo de interesse público devidamente fundamentado, sem prejuízo do pagamento de justa indemnização;",
            "d) Fiscalizar o modo de execução do contrato;",
            "e) Aplicar as sanções previstas para a inexecução do contrato."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO IV Contrato administrativo"
    },
    {
        "Artigo": "Artigo 168.º",
        "Ementa": "(Formação do contrato)",
        "Numero": [
            "São aplicáveis à formação dos contratos administrativos, com as necessárias adaptações, as disposições deste Código relativas ao procedimento administrativo."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO IV Contrato administrativo"
    },
    {
        "Artigo": "Artigo 169.º",
        "Ementa": "(Escolha do co-contratante)",
        "Numero": [
            "1. Salvo regime especial, nos contratos que visem associar um particular ao desempenho regular de atribuições administrativas o co-contratante deve ser escolhido por concurso público, por concurso limitado ou por ajuste directo.",
            "2. Ao concurso público devem ser admitidas todas as entidades que satisfaçam os requisitos gerais estabelecidos por lei.",
            "3. Ao concurso limitado só podem ser admitidas as entidades que satisfaçam os requisitos especialmente fixados pela Administração para cada caso ou que tenham sido convidadas para o efeito pelo contraente público.",
            "4. O ajuste directo deve, em regra, ser precedido de consulta feita, pelo menos, a três entidades."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO IV Contrato administrativo"
    },
    {
        "Artigo": "Artigo 170.º",
        "Ementa": "(Obrigatoriedade de concurso público)",
        "Numero": [
            "1. Com ressalva do disposto nas normas que regulam a realização de despesas públicas ou em legislação especial, os contratos administrativos devem, em regra, ser precedidos de concurso público.",
            "2. O concurso público pode ser dispensado nos casos seguintes:",
            "a) Por decisão devidamente fundamentada do órgão competente, se o valor do contrato for inferior ao limite fixado por lei;",
            "b) Por proposta fundamentada do órgão competente, que mereça a concordância expressa do órgão superior da hierarquia ou do órgão de tutela, se o valor do contrato for superior àquele limite.",
            "3. Se for dispensado o concurso público, deve ser realizado concurso limitado, salvo se este for também dispensado, devendo então observar-se o disposto no n.º 4 do artigo anterior."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO IV Contrato administrativo"
    },
    {
        "Artigo": "Artigo 171.º",
        "Ementa": "(Forma dos contratos)",
        "Numero": [
            "Os contratos administrativos devem ser sempre celebrados por escrito, salvo se a lei estabelecer outra forma."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO IV Contrato administrativo"
    },
    {
        "Artigo": "Artigo 172.º",
        "Ementa": "(Regime de invalidade dos contratos)",
        "Numero": [
            "1. Os contratos administrativos são nulos ou anuláveis, nos termos do presente Código, quando forem nulos ou anuláveis os actos administrativos de que haja dependido a sua celebração.",
            "2. São aplicáveis a todos os contratos administrativos as disposições do Código Civil relativas à falta e vícios da vontade.",
            "3. Sem prejuízo do disposto no n.º 1, à invalidade dos contratos administrativos aplicam-se os regimes seguintes:",
            "a) Quanto aos contratos administrativos com objecto passível de acto administrativo, o regime de invalidade do acto administrativo estabelecido no presente Código;",
            "b) Quanto aos contratos administrativos com objecto passível de contrato de direito privado, o regime de invalidade do negócio jurídico previsto no Código Civil."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO IV Contrato administrativo"
    },
    {
        "Artigo": "Artigo 173.º",
        "Ementa": "(Actos opinativos)",
        "Numero": [
            "1. Os actos administrativos que interpretem cláusulas contratuais ou que se pronunciem sobre a respectiva validade não são definitivos e executórios, pelo que na falta de acordo do co-contratante, a Administração só pode obter os efeitos pretendidos através de acção a propor no tribunal competente.",
            "2. O disposto no número anterior não prejudica a aplicação das disposições gerais da lei civil relativas aos contratos bilaterais, a menos que tais preceitos tenham sido afastados por vontade expressa dos contratantes."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO IV Contrato administrativo"
    },
    {
        "Artigo": "Artigo 174.º",
        "Ementa": "(Execução forçada das prestações)",
        "Numero": [
            "1. Salvo disposição legal em contrário, a execução forçada das prestações contratuais em falta só pode ser obtida através dos tribunais administrativos.",
            "2. *"
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO IV Contrato administrativo"
    },
    {
        "Artigo": "Artigo 175.º",
        "Ementa": "(Arbitragem voluntária)",
        "Numero": [
            "É admissível o recurso à arbitragem, nos termos da lei."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO IV Contrato administrativo"
    },
    {
        "Artigo": "Artigo 176.º",
        "Ementa": "(Legislação subsidiária)",
        "Numero": [
            "Em tudo quanto não estiver expressamente regulado no presente Código, são aplicáveis aos contratos administrativos os princípios gerais de direito administrativo e, com as necessárias adaptações, as disposições legais que regulam as despesas públicas e as normas que regulam formas específicas de contratação pública."
        ],
        "Titulo": "PARTE IV Actividade administrativa CAPÍTULO IV Contrato administrativo"
    }
]